Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Report_ReminderStep_3
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_Reminder.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="Logo" attribute="fo:visibility" condition="/Report/Logo = ''" value="hidden"/> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="Title" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="TableHeader" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:display-align" value="center"/> <xfd:attribute-value object="TableHeader" attribute="fo:height" value="6mm"/> <xfd:attribute-value object="TableHeader" attribute="fo:padding" value="0.5mm"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before" value="1pt solid"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm"/> <fo:region-after region-name="xsl-region-after" extent="20mm" padding-left="20mm" padding-right="20mm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt"> <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/>&#160;<xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - Org.no:&#160;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> Phone: <xfd:field xpath="Phone"/> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> E-Mail: <xfd:field xpath="Email"/> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> Homepage: <xfd:field xpath="Website"/> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Page <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:table table-layout="fixed" width="100%" padding-before="-15mm" space-after="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row height="30mm" font-size="24pt" font-weight="bold" display-align="after"> <!-- Header Logo --> <fo:table-cell> <fo:block> <fo:external-graphic fo:id="Logo" content-height="scale-down-to-fit" height="25mm" scaling="uniform"/> </fo:block> </fo:table-cell> <!-- Header Title --> <fo:table-cell text-align="right"> <fo:block font-size="24pt" font-weight="bold" id="Title">Reminder 3</fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="5mm"> <fo:table-cell number-columns-spanned="3"/> </fo:table-row> <fo:table-row> <!-- Sub-Header Left --> <fo:table-cell> <xsl:for-each select="/Report/Body/Data/Specification/Partner/Partner/Address/Address"> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block><xfd:field xpath="Zip"/> <xfd:field xpath="City"/></fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> </xsl:for-each> </fo:table-cell> <!-- Sub-Header Right --> <fo:table-cell text-align="right"> <fo:block> Date: <xfd:field xpath="/Report/Body/Data/Specification/Transaction/EconomicTransaction/FiscalDate"/> </fo:block> <xsl:for-each select="/Report/Body/Data/Specification/PaymentMeans/PaymentMeans"> <fo:block> <xfd:field xpath="LongDescription"/> </fo:block> </xsl:for-each> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Content --> <fo:block space-after="10mm"> <fo:block id="SubTitle">Missing paymentnotice - Last warning before collectionservice</fo:block> <fo:block> </fo:block> <fo:block>Dispite earlier paymentnotices we still have not received your payment for the following invoices.</fo:block> <fo:block> </fo:block> <xsl:for-each select="/Report/Body/Data/Specification/PartnerPost/PartnerPostDto"> <fo:table table-layout="fixed" width="50mm" margin-left="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block>Invoice:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Date:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Due:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="DueDateDaysFriendly"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Amount:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/TotalAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:for-each> <fo:block> </fo:block> <fo:block>The due amount must be paied within 10 dags from the date of this notice. If you fail to do this we will be forced to send the due amount to collectionservices. This will mean significant fees for collectionservices and/or lawyerservices.</fo:block> <fo:block id="SubTitle" space-before="5mm">Statement</fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(3)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Date</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Due</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Invoice</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Amount</fo:block> </fo:table-cell> </fo:table-row> </fo:table-header> <fo:table-body> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/UnsettledPartnerPosts/PartnerPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="DueDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PostTypeTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <fo:table-row> <fo:table-cell id="TableLine" number-columns-spanned="5"/> </fo:table-row> </fo:table-body> </fo:table> <xsl:for-each select="/Report/Body/Data/Specification/Transaction/EconomicTransaction/LedgerPosts/LedgerPost"> <xsl:if test="LedgerAccount = 'Xena_Domain_Income_Accounts_Financial_Costs'"> <fo:block space-before="3mm"> Because of the late payment there will be added the following cost to your account: <xfd:field xpath="-Amount"/>. </fo:block> </xsl:if> </xsl:for-each> </fo:block> <!-- InvoiceIdentification --> <xsl:if test="/Report/Body/Data/Specification/Identifications/InvoiceIdentification"> <fo:block space-after="10mm" font-weight="bold" id="PaymentLines"> <fo:block>When paying, please use payment ID:</fo:block> <xsl:for-each select="/Report/Body/Data/Specification/Identifications/InvoiceIdentification"> <fo:block><xfd:field xpath="Identification"/></fo:block> </xsl:for-each> </fo:block> </xsl:if> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_Reminder.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="Logo" attribute="fo:visibility" condition="/Report/Logo = ''" value="hidden"/> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="Title" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="TableHeader" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:display-align" value="center"/> <xfd:attribute-value object="TableHeader" attribute="fo:height" value="6mm"/> <xfd:attribute-value object="TableHeader" attribute="fo:padding" value="0.5mm"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before" value="1pt solid"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm"/> <fo:region-after region-name="xsl-region-after" extent="20mm" padding-left="20mm" padding-right="20mm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt"> <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/>&#160;<xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - CVR:&#160;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> Telefon: <xfd:field xpath="Phone"/> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> E-Mail: <xfd:field xpath="Email"/> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> Hjemmeside: <xfd:field xpath="Website"/> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Side <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:table table-layout="fixed" width="100%" padding-before="-15mm" space-after="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row height="30mm" font-size="24pt" font-weight="bold" display-align="after"> <!-- Header Logo --> <fo:table-cell> <fo:block> <fo:external-graphic fo:id="Logo" content-height="scale-down-to-fit" height="25mm" scaling="uniform"/> </fo:block> </fo:table-cell> <!-- Header Title --> <fo:table-cell text-align="right"> <fo:block font-size="24pt" font-weight="bold" id="Title">Rykker 3</fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="5mm"> <fo:table-cell number-columns-spanned="3"/> </fo:table-row> <fo:table-row> <!-- Sub-Header Left --> <fo:table-cell> <xsl:for-each select="/Report/Body/Data/Specification/Partner/Partner/Address/Address"> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block><xfd:field xpath="Zip"/> <xfd:field xpath="City"/></fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> </xsl:for-each> </fo:table-cell> <!-- Sub-Header Right --> <fo:table-cell text-align="right"> <fo:block> Dato: <xfd:field xpath="/Report/Body/Data/Specification/Transaction/EconomicTransaction/FiscalDate"/> </fo:block> <xsl:for-each select="/Report/Body/Data/Specification/PaymentMeans/PaymentMeans"> <fo:block> <xfd:field xpath="LongDescription"/> </fo:block> </xsl:for-each> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Content --> <fo:block space-after="10mm"> <fo:block id="SubTitle">Sidste betalingspåmindelse - inkassovarsel</fo:block> <fo:block> </fo:block> <fo:block>På trods af tidligere påmindelse har vi stadig ikke modtaget Deres indbetaling for nedenstående faktura.</fo:block> <fo:block> </fo:block> <xsl:for-each select="/Report/Body/Data/Specification/PartnerPost/PartnerPostDto"> <fo:table table-layout="fixed" width="50mm" margin-left="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block>Faktura:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Dato:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Forfald:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="DueDateDaysFriendly"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Beløb:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/TotalAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:for-each> <fo:block> </fo:block> <fo:block>Såfremt det skyldige beløb ikke betales senest 10 dage fra dato, vil fordringen uden yderligere varsel blive overdraget til inkasso. Der vil blive pålagt inkassogebyr og derudover inddrivelsesomkostninger ved inkassoskridt hos vor interne inkassoafdeling, eksternt inkassobureau eller vor advokat.</fo:block> <fo:block id="SubTitle" space-before="5mm">Oversigt over alle åbne faktura</fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(3)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Dato</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Forfald</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Faktura</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekst</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Beløb</fo:block> </fo:table-cell> </fo:table-row> </fo:table-header> <fo:table-body> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/UnsettledPartnerPosts/PartnerPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="DueDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PostTypeTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <fo:table-row> <fo:table-cell id="TableLine" number-columns-spanned="5"/> </fo:table-row> </fo:table-body> </fo:table> <xsl:for-each select="/Report/Body/Data/Specification/Transaction/EconomicTransaction/LedgerPosts/LedgerPost"> <xsl:if test="LedgerAccount = 'Xena_Domain_Income_Accounts_Financial_Costs'"> <fo:block space-before="3mm"> Der beregnes en omkostning på <xfd:field xpath="-Amount"/> kr. for denne betalingspåmindelse. </fo:block> </xsl:if> </xsl:for-each> </fo:block> <!-- InvoiceIdentification --> <xsl:if test="/Report/Body/Data/Specification/Identifications/InvoiceIdentification"> <fo:block space-after="10mm" font-weight="bold" id="PaymentLines"> <fo:block>Ved betaling brug venligst betalings-ID:</fo:block> <xsl:for-each select="/Report/Body/Data/Specification/Identifications/InvoiceIdentification"> <fo:block><xfd:field xpath="Identification"/></fo:block> </xsl:for-each> </fo:block> </xsl:if> </fo:flow> </fo:page-sequence> </xfd:document>
