Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_PartnerSaldoAgeReportList
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_PartnerSaldoAgeReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="29.7cm" page-height="21cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block> <xsl:choose> <xsl:when test="/Report/Body/Criteria/Specification/ContextType = 'ContextType_Customer'"> Customer saldos - age-distributed </xsl:when> <xsl:otherwise> Supplier saldos - age-distributed </xsl:otherwise> </xsl:choose> </fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> <xsl:choose> <xsl:when test="/Report/Body/Criteria/Specification/ContextType = 'ContextType_Customer'"> Customer saldos - age-distributed </xsl:when> <xsl:otherwise> Supplier saldos - age-distributed </xsl:otherwise> </xsl:choose> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > By date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/CalculatedByFriendly/text()"/> </fo:block> </fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block> From account: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/AccountNumberFrom"/> </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <fo:table width="100%" > <fo:table-column column-width="proportional-column-width(7)" column-number="1"/> <fo:table-column column-width="proportional-column-width(18)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15)" column-number="4"/> <fo:table-column column-width="proportional-column-width(15)" column-number="5"/> <fo:table-column column-width="proportional-column-width(15)" column-number="6"/> <fo:table-column column-width="proportional-column-width(15)" column-number="7"/> <fo:table-body> <!-- Header --> <fo:table-row border-bottom="solid 0.25pt black" id="AccountHeader"> <fo:table-cell> <fo:block>Account</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Name</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Balance 0-30</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Balance 30-60</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Balance 60-90</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Balance 90+</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Balance, total</fo:block> </fo:table-cell> </fo:table-row> <!-- Partners --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/PartnerSaldos/PartnerBalanceAgeDataDto"> <fo:table-cell> <fo:block> <xfd:field xpath="AccountNumber" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Name" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance30" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance3060" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance6090" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance90" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <fo:table-row border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell><fo:block></fo:block></fo:table-cell> <fo:table-cell><fo:block></fo:block></fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance30" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance3060" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance6090" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance90" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_PartnerSaldoAgeReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="29.7cm" page-height="21cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block> <xsl:choose> <xsl:when test="/Report/Body/Criteria/Specification/ContextType = 'ContextType_Customer'"> Aldersfordelt saldoliste, kunder </xsl:when> <xsl:otherwise> Aldersfordelt saldoliste, leverandører </xsl:otherwise> </xsl:choose> </fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> <xsl:choose> <xsl:when test="/Report/Body/Criteria/Specification/ContextType = 'ContextType_Customer'"> Aldersfordelt saldoliste, kunder </xsl:when> <xsl:otherwise> Aldersfordelt saldoliste, leverandører </xsl:otherwise> </xsl:choose> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/CalculatedByFriendly/text()"/> </fo:block> </fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block> Fra kontonr: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/AccountNumberFrom"/> </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block> Til kontonr: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/AccountNumberTo"/> </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <fo:table width="100%" > <fo:table-column column-width="proportional-column-width(7)" column-number="1"/> <fo:table-column column-width="proportional-column-width(18)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15)" column-number="4"/> <fo:table-column column-width="proportional-column-width(15)" column-number="5"/> <fo:table-column column-width="proportional-column-width(15)" column-number="6"/> <fo:table-column column-width="proportional-column-width(15)" column-number="7"/> <fo:table-body> <!-- Header --> <fo:table-row border-bottom="solid 0.25pt black" id="AccountHeader"> <fo:table-cell> <fo:block>Konto</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Navn</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo 0-30</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo 30-60</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo 60-90</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo 90+</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo, total</fo:block> </fo:table-cell> </fo:table-row> <!-- Partners --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/PartnerSaldos/PartnerBalanceAgeDataDto"> <fo:table-cell> <fo:block> <xfd:field xpath="AccountNumber" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Name" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance30" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance3060" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance6090" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance90" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Balance" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <fo:table-row border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell><fo:block></fo:block></fo:table-cell> <fo:table-cell><fo:block></fo:block></fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance30" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance3060" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance6090" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance90" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Total/Specification/Balance" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
