Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_LedgerJournal
source: <?xml version="1.0" encoding="UTF-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_FiscalBalance.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Dansk"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="BalanceHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="BalanceHeaderBorder" attribute="fo:border-bottom-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="29.7cm" page-height="21cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Ledger journal</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Ledger journal </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Ledger: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerDescription"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Lines --> <fo:block font-size="11pt" line-height="13pt"> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="2cm"/> <fo:table-column column-width="1.5cm"/> <fo:table-column column-width="3cm"/> <fo:table-column column-width="2.5cm"/> <fo:table-column column-width="5.5cm"/> <fo:table-column column-width="4cm"/> <fo:table-column column-width="2.5cm"/> <fo:table-column column-width="0.8cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Date</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Voucher</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Type</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Account</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Description</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block margin-right="0.2cm">Amount</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Contra</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>VAT</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Dept.</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bearer</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Purpose</fo:block> </fo:table-cell> </fo:table-row> <!-- Lines --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Lines/LedgerLineDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerLineTypeTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerTagShortDescription"/> <xfd:field xpath="ArticleGroupDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" margin-right="0.2cm" format="number:##.##0,00 th:. dec:, sign:"/> <xfd:field margin-right="0.2cm" xpath="CurrencyAbbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ContraTagShortDescription"/> <xfd:field xpath="PartnerAccountNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAbbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="DepartmentDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="BearerDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PurposeDescription"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> <fo:table width="100%" table-layout="fixed" margin-top="1cm"> <fo:table-column column-width="proportional-column-width(100)" column-number="1"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Summary </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <fo:block font-size="11pt" line-height="13pt" margin-top="0.5cm"> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="3cm"/> <fo:table-column column-width="9.7cm"/> <fo:table-column column-width="4cm"/> <fo:table-column column-width="4.5cm"/> <fo:table-column column-width="4.5cm"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Type</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Account</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Movement</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Before</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>After</fo:block> </fo:table-cell> </fo:table-row> <!-- ArticleGroup movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/ArticleGroupMovements/ArticleGroupMovement"> <fo:table-cell> <fo:block> Article group post </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleGroupDescription" margin-right="0.2cm"/>(<xfd:field xpath="LedgerAccountTranslated"/>) </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- LedgerPost movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/LedgerPostMovements/LedgerPostMovement"> <fo:table-cell> <fo:block> Ledger post </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerTagNumber"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Partner movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/PartnerMovements/PartnerMovement"> <fo:table-cell> <fo:block> Partner post </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PartnerAccountNumber"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- VAT movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/VatMovements/VatMovement"> <fo:table-cell> <fo:block> VAT post </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="UTF-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_FiscalBalance.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Dansk"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="BalanceHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="BalanceHeaderBorder" attribute="fo:border-bottom-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="29.7cm" page-height="21cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Kassekladde</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Kassekladde </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Kladdenavn: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerDescription"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Lines --> <fo:block font-size="11pt" line-height="13pt"> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="2cm"/> <fo:table-column column-width="1.5cm"/> <fo:table-column column-width="3cm"/> <fo:table-column column-width="2.5cm"/> <fo:table-column column-width="5.3cm"/> <fo:table-column column-width="4cm"/> <fo:table-column column-width="2.5cm"/> <fo:table-column column-width="1cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-column column-width="1.3cm"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Dato</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bilag</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Type</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Konto</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Beskrivelse</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block margin-right="0.2cm">Beløb</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Modkonto</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Moms</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Afd.</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bærer</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Formål</fo:block> </fo:table-cell> </fo:table-row> <!-- Lines --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Lines/LedgerLineDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerLineTypeTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerTagShortDescription"/> <xfd:field xpath="ArticleGroupDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" margin-right="0.2cm" format="number:##.##0,00 th:. dec:, sign:"/> <xfd:field margin-right="0.2cm" xpath="CurrencyAbbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ContraTagShortDescription"/> <xfd:field xpath="PartnerAccountNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAbbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="DepartmentDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="BearerDescription"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PurposeDescription"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> <fo:table width="100%" table-layout="fixed" margin-top="1cm"> <fo:table-column column-width="proportional-column-width(100)" column-number="1"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Summary </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <fo:block font-size="11pt" line-height="13pt" margin-top="0.5cm"> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="3cm"/> <fo:table-column column-width="9.7cm"/> <fo:table-column column-width="4cm"/> <fo:table-column column-width="4.5cm"/> <fo:table-column column-width="4.5cm"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Type</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Konto</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Bevægelse</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo, før</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Saldo, efter</fo:block> </fo:table-cell> </fo:table-row> <!-- ArticleGroup movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/ArticleGroupMovements/ArticleGroupMovement"> <fo:table-cell> <fo:block> Varegruppe </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleGroupDescription" margin-right="0.2cm"/>(<xfd:field xpath="LedgerAccountTranslated"/>) </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- LedgerPost movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/LedgerPostMovements/LedgerPostMovement"> <fo:table-cell> <fo:block> Finans </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerTagNumber"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Partner movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/PartnerMovements/PartnerMovement"> <fo:table-cell> <fo:block> Partner </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="PartnerAccountNumber"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- VAT movements --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Summary/VoucherDraftSummaryResult/VatMovements/VatMovement"> <fo:table-cell> <fo:block> Moms </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Movement" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoBefore" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AccumulatedSaldoAfter" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
