Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_OrderDelivery
source: <?xml version="1.0" encoding="utf-8" ?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_OrderDelivery.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="2544BDE3" attribute="fo:visibility" condition="Totals/Totals/PriceNettTotal=0" value="hidden"/> <xfd:attribute-value object="ArticleLineHeaderDiscount" attribute="fo:visibility" condition="Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="ArticleLineDiscount" attribute="fo:visibility" condition="Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="TotalsDiscount" attribute="fo:visibility" condition="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="4592BE02" attribute="fo:visibility" condition="PriceEach=0" value="hidden"/> <xfd:attribute-value object="1349BE08" attribute="fo:visibility" condition="Quantity=0" value="hidden"/> <xfd:attribute-value object="69B2BE1D" attribute="fo:width" condition="0=0" value="0"/> <xfd:attribute-value object="25291608" attribute="fo:visibility" condition="count(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/VatTotals/VatTotal) &lt; 2" value="collapse"/> <xfd:attribute-value object="25291609" attribute="fo:visibility" condition="count(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/VatTotals/VatTotal) &gt; 1" value="collapse"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:scaling" condition="string-length(normalize-space(/Report/Logo)) = 0" value="non-uniform"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Logo)) = 0" value="hidden"/> <xfd:attribute-value object="68745D1E" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Payer/Partner/OrgNumber)) = 0" value="hidden"/> <xfd:attribute-value object="4D126270" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="4DF76387" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="1EA88BD3" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="1EA88BD3" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="TableHeader" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:display-align" value="center"/> <xfd:attribute-value object="TableHeader" attribute="fo:height" value="6mm"/> <xfd:attribute-value object="TableHeader" attribute="fo:padding" value="0.5mm"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before" value="1pt solid"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="DeliveryAddress" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Name)) = 0" value="collapse"/> <xfd:attribute-value object="DeliveryAddress" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Name)) = 0" value="collapse"/> <!-- Variables --> <xsl:variable name="hasBackorder" select="count(/Report/Body/Data/Specification/TasksForLaterDelivery/KeyValuePair2) > 0"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm" padding-bottom="5mm"/> <fo:region-after region-name="xsl-region-after" extent="25mm" padding-left="20mm" padding-right="20mm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt" > <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - Org: <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> <fo:inline keep-together.within-line="always"> Phone: <xfd:field xpath="Phone"/> </fo:inline> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> E-Mail: <xfd:field xpath="Email"/> </fo:inline> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Homepage: <xfd:field xpath="Website"/> </fo:inline> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Page <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" fo:id="OrderAddress"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2" fo:id="DeliveryAddress"/> <fo:table-column column-width="proportional-column-width(50)" column-number="3"/> <fo:table-body> <fo:table-row height="7,5cm">7 <!-- Logo and address --> <fo:table-cell> <fo:block height="3,5cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="24EDBFC1" height="3,5cm" scaling="uniform"/> </fo:block> <fo:block padding-top="20px"> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Name" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Street" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/PlaceName != ''"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/PlaceName" fo:padding-left="50px"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="concat(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Zip,' ',/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/City)" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Country/Country/DisplayName" fo:padding-left="50px"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block height="3cm"> </fo:block> <fo:block padding-top="20px"> <xfd:field xpath="concat('Leveringsadresse:','')" fo:padding-left="50px" /> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Name" fo:padding-left="50px" /> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Street" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/PlaceName != ''"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/PlaceName" fo:padding-left="50px"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="concat(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Zip,' ',/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/City)" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Country/Country/DisplayName" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryNote != ''"> <fo:block space-before="3mm" linefeed-treatment="preserve"> <fo:inline font-family="Calibri" font-weight="bold">Delivery note: </fo:inline> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryNote"/> </fo:block> </xsl:if> </fo:table-cell> <!-- Invoice header info --> <fo:table-cell> <fo:block text-align="right" font-size="24pt" font-family="Calibri" font-weight="bold" id="4D126270"> Deliveryslip </fo:block> <fo:block text-align="right"> Page <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> <fo:block text-align="right"> Date: <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/DeliveryDate"/> </fo:block> <fo:block text-align="right"> Order no.:<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OrderNumber"/>&#x00A0; Customer no.: <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/PartnerAccountNumber"/> </fo:block> <xsl:if test="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OurReference)) &gt; 0"> <fo:block text-align="right"> Our ref:&#x00A0;<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OurReference"/> </fo:block> </xsl:if> <xsl:if test="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/YourReference)) &gt; 0"> <fo:block text-align="right"> Your ref:&#x00A0;<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/YourReference"/> </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Tasks --> <fo:block> <xsl:if test="$hasBackorder"> <fo:block id="SubTitle">In this delivery:</fo:block> </xsl:if> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" > <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(45)" column-number="2"/> <fo:table-column column-width="proportional-column-width(10)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15)" column-number="4"/> <fo:table-column column-width="proportional-column-width(10)" column-number="5"/> <fo:table-body> <!-- Article line header --> <fo:table-row id="TableHeader" height="30px" display-align="center" padding-left="2px" padding-right="2px"> <fo:table-cell> <fo:block>Article</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Location</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Qty</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> </fo:table-row> <!-- Article line --> <xsl:for-each select="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/OrderLines/OrderLine"> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Location/Location/Abbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell > <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xfd:conditional-inline-sequence><xfd:conditional-inline test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xfd:conditional-inline></xfd:conditional-inline-sequence> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Location/Location/Abbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell > <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:," fo:id="1349BE08"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> </xsl:for-each> </fo:table-body> </fo:table> <xsl:if test="$hasBackorder"> <fo:block padding-bottom="20px"> </fo:block> <fo:block id="SubTitle">For later delivery:</fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" > <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(55)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(10)" column-number="4"/> <fo:table-body> <!-- Article line header --> <fo:table-row id="TableHeader" height="30px" display-align="center" padding-left="2px" padding-right="2px"> <fo:table-cell> <fo:block>Article</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Qty</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> </fo:table-row> <!-- Article line --> <xsl:for-each select="/Report/Body/Data/Specification/TasksForLaterDelivery/KeyValuePair2"> <xsl:for-each select="Value/OrderLine"> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell > <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xfd:conditional-inline-sequence><xfd:conditional-inline test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xfd:conditional-inline></xfd:conditional-inline-sequence> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell > <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:," fo:id="1349BE08"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> </xsl:for-each> </xsl:for-each> </fo:table-body> </fo:table> </xsl:if> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8" ?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_OrderDelivery.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="2544BDE3" attribute="fo:visibility" condition="Totals/Totals/PriceNettTotal=0" value="hidden"/> <xfd:attribute-value object="ArticleLineHeaderDiscount" attribute="fo:visibility" condition="Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="ArticleLineDiscount" attribute="fo:visibility" condition="Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="TotalsDiscount" attribute="fo:visibility" condition="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Totals/Totals/DiscountTotal=0" value="hidden"/> <xfd:attribute-value object="4592BE02" attribute="fo:visibility" condition="PriceEach=0" value="hidden"/> <xfd:attribute-value object="1349BE08" attribute="fo:visibility" condition="Quantity=0" value="hidden"/> <xfd:attribute-value object="69B2BE1D" attribute="fo:width" condition="0=0" value="0"/> <xfd:attribute-value object="25291608" attribute="fo:visibility" condition="count(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/VatTotals/VatTotal) &lt; 2" value="collapse"/> <xfd:attribute-value object="25291609" attribute="fo:visibility" condition="count(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/VatTotals/VatTotal) &gt; 1" value="collapse"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:scaling" condition="string-length(normalize-space(/Report/Logo)) = 0" value="non-uniform"/> <xfd:attribute-value object="24EDBFC1" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Logo)) = 0" value="hidden"/> <xfd:attribute-value object="68745D1E" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Payer/Partner/OrgNumber)) = 0" value="hidden"/> <xfd:attribute-value object="4D126270" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="4DF76387" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="6250645F" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="6250645F" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="1EA88BD3" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="1EA88BD3" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="DeliveryAddress" attribute="fo:visibility" condition="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Name)) = 0" value="collapse"/> <!-- Variables --> <xsl:variable name="hasBackorder" select="count(/Report/Body/Data/Specification/TasksForLaterDelivery/KeyValuePair2) > 0"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm" padding-bottom="5mm"/> <fo:region-after region-name="xsl-region-after" extent="25mm" padding-left="20mm" padding-right="20mm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt" > <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - V-tal: <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> <fo:inline keep-together.within-line="always"> Telefon: <xfd:field xpath="Phone"/> </fo:inline> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Teldupostur: <xfd:field xpath="Email"/> </fo:inline> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Heimasíða: <xfd:field xpath="Website"/> </fo:inline> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Síða <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" fo:id="OrderAddress"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2" fo:id="DeliveryAddress"/> <fo:table-column column-width="proportional-column-width(50)" column-number="3"/> <fo:table-body> <fo:table-row height="7,5cm"> <!-- Logo and address --> <fo:table-cell> <fo:block height="3,5cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="24EDBFC1" height="3,5cm" scaling="uniform"/> </fo:block> <fo:block padding-top="20px"> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Name" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Street" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/PlaceName != ''"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/PlaceName" fo:padding-left="50px"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="concat(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Zip,' ',/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/City)" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/Address/Address/Country/Country/DisplayName" fo:padding-left="50px"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block height="3cm"> </fo:block> <fo:block padding-top="20px"> <xfd:field xpath="concat('Leveringsadresse:','')" fo:padding-left="50px" /> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Name" fo:padding-left="50px" /> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Street" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/PlaceName != ''"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/PlaceName" fo:padding-left="50px"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="concat(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Zip,' ',/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/City)" fo:padding-left="50px"/> </fo:block> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryAddress/Address/Country/Country/DisplayName" fo:padding-left="50px"/> </fo:block> <xsl:if test="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryNote != ''"> <fo:block space-before="3mm" linefeed-treatment="preserve"> <fo:inline font-family="Calibri" font-weight="bold">Viðmerking: </fo:inline> <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/DeliveryNote"/> </fo:block> </xsl:if> </fo:table-cell> <!-- Invoice header info --> <fo:table-cell> <fo:block text-align="right" font-size="24pt" font-family="Calibri" font-weight="bold" id="4D126270"> Fylgiseðil </fo:block> <fo:block text-align="right"> Síða <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> <fo:block text-align="right"> Dato: <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/DeliveryDate"/> </fo:block> <fo:block text-align="right"> Ordrenr.:<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OrderNumber"/>&#x00A0; Kundenr: <xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/PartnerAccountNumber"/> </fo:block> <xsl:if test="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OurReference)) &gt; 0"> <fo:block text-align="right"> Vor ref:&#x00A0;<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/OurReference"/> </fo:block> </xsl:if> <xsl:if test="string-length(normalize-space(/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/YourReference)) &gt; 0"> <fo:block text-align="right"> Deres ref:&#x00A0;<xfd:field xpath="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/Order/Order/YourReference"/> </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Tasks --> <fo:block> <xsl:if test="$hasBackorder"> <fo:block id="SubTitle">Indeholdt i denne levering:</fo:block> </xsl:if> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" > <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(45)" column-number="2"/> <fo:table-column column-width="proportional-column-width(10)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15)" column-number="4"/> <fo:table-column column-width="proportional-column-width(10)" column-number="5"/> <fo:table-body> <!-- Article line header --> <fo:table-row id="6250645F" height="30px" display-align="center" padding-left="2px" padding-right="2px"> <fo:table-cell> <fo:block>Varenr</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekst</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Lokation</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Antal</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> </fo:table-row> <!-- Article line --> <xsl:for-each select="/Report/Body/Data/Specification/OrderDelivery/OrderDelivery/OrderLines/OrderLine"> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Location/Location/Abbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell > <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xfd:conditional-inline-sequence><xfd:conditional-inline test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xfd:conditional-inline></xfd:conditional-inline-sequence> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Location/Location/Abbreviation"/> </fo:block> </fo:table-cell> <fo:table-cell > <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:," fo:id="1349BE08"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> </xsl:for-each> </fo:table-body> </fo:table> <xsl:if test="$hasBackorder"> <fo:block padding-bottom="20px"></fo:block> <fo:block id="SubTitle">Til levering seinni:</fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" > <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(55)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(10)" column-number="4"/> <fo:table-body> <!-- Article line header --> <fo:table-row id="6250645F" height="30px" display-align="center" padding-left="2px" padding-right="2px"> <fo:table-cell> <fo:block>Vørunr</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekstur</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Nøgd</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> </fo:table-row> <!-- Article line --> <xsl:for-each select="/Report/Body/Data/Specification/TasksForLaterDelivery/KeyValuePair2"> <xsl:for-each select="Value/OrderLine"> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell > <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-row line-height="20pt"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xfd:conditional-inline-sequence><xfd:conditional-inline test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xfd:conditional-inline></xfd:conditional-inline-sequence> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell > <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:," fo:id="1349BE08"/> </fo:block> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> </xsl:for-each> </xsl:for-each> </fo:table-body> </fo:table> </xsl:if> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
