Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_LedgerTagStatement
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_LedgerTagStatement.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <xfd:attribute-value object="debetAmount" attribute="fo:visibility" condition="string-length(normalize-space(LedgerPost/LedgerPostDto/Amount)) &lt; 0" value="hidden"/> <xfd:attribute-value object="creditAmount" attribute="fo:visibility" condition="string-length(normalize-space(LedgerPost/LedgerPostDto/Amount)) &gt; 0" value="hidden"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Ledgeraccount statement</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Ledgeraccount statement </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Ledgergroup: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/LedgerAccountTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> From date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/From"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Ledgeraccount:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/Number"/>&#x00A0;<xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>To date:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/To"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(15.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(10.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(30.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="5"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="6"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Date</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Voucher</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Debet</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Credit</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Balance</fo:block> </fo:table-cell> </fo:table-row> <!-- Start balance --> <fo:table-row> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Primo balance</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/StartingAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerPosts/LedgerTagSpecificationPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerPost/LedgerPostDto/FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Voucher/VoucherDto/VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Voucher/VoucherDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="LedgerPost/LedgerPostDto/Amount" fo:id="debetAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="-1 * LedgerPost/LedgerPostDto/Amount" fo:id="creditAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="RunningTotal" format="number:#.###,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_LedgerTagStatement.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <xfd:attribute-value object="debetAmount" attribute="fo:visibility" condition="string-length(normalize-space(LedgerPost/LedgerPostDto/Amount)) &lt; 0" value="hidden"/> <xfd:attribute-value object="creditAmount" attribute="fo:visibility" condition="string-length(normalize-space(LedgerPost/LedgerPostDto/Amount)) &gt; 0" value="hidden"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Finanskontoudtog</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Finanskontoudtog </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Gruppe: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/LedgerAccountTranslated"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> Fra dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/From"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Konto:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/Number"/>&#x00A0;<xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerTag/LedgerTagDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Til dato:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/To"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(15.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(10.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(30.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="5"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="6"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Dato</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bilag</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekst</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Debit</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Kredit</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Saldo</fo:block> </fo:table-cell> </fo:table-row> <!-- Start balance --> <fo:table-row> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Startsaldo</fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block></fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/LedgerTagSpecificationDto/StartingAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="/Report/Body/Data/LedgerTagSpecificationDto/LedgerPosts/LedgerTagSpecificationPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="LedgerPost/LedgerPostDto/FiscalDateDaysFriendly"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Voucher/VoucherDto/VoucherNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Voucher/VoucherDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="LedgerPost/LedgerPostDto/Amount" fo:id="debetAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="-1 * LedgerPost/LedgerPostDto/Amount" fo:id="creditAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="RunningTotal" format="number:#.###,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
