Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_LedgerPostReportList
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_LedgerPostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>List of ledgerposts</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> List of ledgerposts </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Ledgergroup: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerAccountTranslated/text()"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> From date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDateFromFriendly/text()"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Ledgeraccount:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="concat(/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Number,' ',/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Description)" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> To date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDateToFriendly/text()"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Articlegroup:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Department:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Partner:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Partner/PartnerDto/AccountNumber" />&#x00A0;<xfd:field xpath="/Report/Body/Criteria/Specification/Partner/PartnerDto/Address/AddressDto/Name" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bearer:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>VAT:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Vat/VatDto/Abbreviation" />&#x00A0;<xfd:field xpath="/Report/Body/Criteria/Specification/Vat/VatDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Purpose:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <xfd:block-repeat xpath="/Report/Body/Data/LedgerAccountGroup"> <fo:block> <xfd:block-repeat xpath="LedgerPostGroups/LedgerPostDtoGroup"> <fo:block> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(15.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(10.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(35.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(16.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(11.0)" column-number="5"/> <fo:table-column column-width="proportional-column-width(13.0)" column-number="6"/> <fo:table-body> <!-- Account --> <fo:table-row id="AccountHeader"> <fo:table-cell number-columns-spanned="6"> <fo:block> <xfd:field xpath="../../LedgerAccountTranslated" fo:font-size="14pt" fo:font-weight="bold"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row id="AccountHeader" border-after-style="solid" border-after-color="black" border-after-width="0.25pt"> <fo:table-cell number-columns-spanned="6"> <fo:block> <xfd:field xpath="GroupName" fo:font-size="12pt"/> </fo:block> </fo:table-cell> </fo:table-row> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Date</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Voucher</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Curr. amount</fo:block> </fo:table-cell> <fo:table-cell text-align="center"> <fo:block>VAT</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Amount</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="LedgerPosts/LedgerPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description" fo:width="2.552in" fo:overflow="hidden" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block fo:wrap-option="no-wrap"> <xfd:field xpath="CurrencyAmount" format="number:##.##0,00 th:. dec:, sign:" /> <fo:inline margin-left="0.2cm" /> <xfd:field xpath="CurrencyAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="center"> <fo:block> <xfd:field xpath="VatAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- End total for each group --> <fo:table-row border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Total:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="EndTotal" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> </fo:block> </xfd:block-repeat> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_LedgerPostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Finansposteringsliste</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Finansposteringsliste </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block > Finansgruppe: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerAccountTranslated/text()"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> Fra dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDateFromFriendly/text()"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Finanskonto:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="concat(/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Number,' ',/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Description)" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> Til dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDateToFriendly/text()"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Varegruppe:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Afdeling:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Partner:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Partner/PartnerDto/AccountNumber" />&#x00A0;<xfd:field xpath="/Report/Body/Criteria/Specification/Partner/PartnerDto/Address/AddressDto/Name" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bærer:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Moms:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Vat/VatDto/Abbreviation" />&#x00A0;<xfd:field xpath="/Report/Body/Criteria/Specification/Vat/VatDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Formål:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description" /> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> <fo:table-cell></fo:table-cell> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <xfd:block-repeat xpath="/Report/Body/Data/LedgerAccountGroup"> <fo:block> <xfd:block-repeat xpath="LedgerPostGroups/LedgerPostDtoGroup"> <fo:block> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(15.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(10.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(35.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(16.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(11.0)" column-number="5"/> <fo:table-column column-width="proportional-column-width(13.0)" column-number="6"/> <fo:table-body> <!-- Account --> <fo:table-row id="AccountHeader"> <fo:table-cell number-columns-spanned="6"> <fo:block> <xfd:field xpath="../../LedgerAccountTranslated" fo:font-size="14pt" fo:font-weight="bold"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row id="AccountHeader" border-after-style="solid" border-after-color="black" border-after-width="0.25pt"> <fo:table-cell number-columns-spanned="6"> <fo:block> <xfd:field xpath="GroupName" fo:font-size="12pt"/> </fo:block> </fo:table-cell> </fo:table-row> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Dato</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Bilag</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekst</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Valutabeløb</fo:block> </fo:table-cell> <fo:table-cell text-align="center"> <fo:block>Moms</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Beløb</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="LedgerPosts/LedgerPostDto"> <fo:table-cell> <fo:block> <xfd:field xpath="FiscalDateDaysFriendly" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VoucherNumber" /> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description" fo:width="2.552in" fo:overflow="hidden" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block fo:wrap-option="no-wrap"> <xfd:field xpath="CurrencyAmount" format="number:##.##0,00 th:. dec:, sign:" /> <fo:inline margin-left="0.2cm" /> <xfd:field xpath="CurrencyAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="center"> <fo:block> <xfd:field xpath="VatAbbreviation" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Amount" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- End total for each group --> <fo:table-row border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block>I alt posteret:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="EndTotal" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> </fo:block> </xfd:block-repeat> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
