Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_OrderInvoice
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_OrderInvoice.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="Logo" attribute="fo:visibility" condition="/Report/Logo = ''" value="hidden"/> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="Title" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="TableHeader" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:display-align" value="center"/> <xfd:attribute-value object="TableHeader" attribute="fo:height" value="6mm"/> <xfd:attribute-value object="TableHeader" attribute="fo:padding" value="0.5mm"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before" value="1pt solid"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <!-- Variables --> <xsl:variable name="hasDiscount" select="/Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal!=0"/> <xsl:variable name="partnerIsPrivate" select="/Report/Body/Data/OrderInvoice/Payer/Partner/PartnerType='xena_partnertype_person'"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm"/> <fo:region-after region-name="xsl-region-after" extent="25mm" padding-left="20mm" padding-right="20mm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt"> <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <fo:block> Payment terms: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/Description"/> </fo:block> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/>&#160;<xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - Company Reg. No.:&#160;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> <fo:inline keep-together.within-line="always"> Phone: <xfd:field xpath="Phone"/> </fo:inline> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> E-Mail: <xfd:field xpath="Email"/> </fo:inline> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Homepage: <xfd:field xpath="Website"/> </fo:inline> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Page <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:table table-layout="fixed" width="100%" padding-before="-15mm" space-after="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row height="30mm" font-size="24pt" font-family="Calibri" font-weight="bold" display-align="after"> <!-- Header Logo --> <fo:table-cell> <fo:block> <fo:external-graphic fo:id="Logo" content-height="scale-down-to-fit" height="25mm" scaling="uniform"/> </fo:block> </fo:table-cell> <!-- Header Title --> <fo:table-cell text-align="right"> <fo:block font-size="24pt" font-weight="bold" id="Title"> <xsl:choose> <xsl:when test="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &lt; 0"> Credit note </xsl:when> <xsl:otherwise> Invoice </xsl:otherwise> </xsl:choose> <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoiceNumber"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="5mm"> <fo:table-cell number-columns-spanned="3"/> </fo:table-row> <fo:table-row> <!-- Sub-Header Left --> <fo:table-cell text-align="left"> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Order/Order/Address/Address"> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> <xsl:if test="../../Partner/Partner/OrgNumber != ''"> <fo:block> Company Reg. No.: <xfd:field xpath="../../Partner/Partner/OrgNumber"/> </fo:block> </xsl:if> </xsl:for-each> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryAddress/Address"> <xsl:if test="Name != '' or Street != ''"> <fo:block space-before="10mm"> Delivery address: </fo:block> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> </xsl:if> </xsl:for-each> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryNote != ''"> <fo:block space-before="3mm" linefeed-treatment="preserve"> <fo:inline font-family="Calibri" font-weight="bold">Delivery note: </fo:inline> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryNote"/> </fo:block> </xsl:if> </fo:table-cell> <!-- Sub-Header Right --> <fo:table-cell text-align="right"> <fo:block> Date: <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoicingDate"/> </fo:block> <fo:block> Order no: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/OrderNumber"/> </fo:block> <fo:block> Customer no: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/PartnerAccountNumber"/> </fo:block> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/OurReference != ''"> <fo:block> Our ref: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/OurReference"/> </fo:block> </xsl:if> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/YourReference != ''"> <fo:block> Your ref: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/YourReference"/> </fo:block> </xsl:if> <xsl:for-each select="/Report/Body/Data/OrderInvoice/PaymentMeans/PaymentMeans"> <fo:block> <xfd:field xpath="LongDescription"/> </fo:block> </xsl:for-each> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash'"> <fo:block text-align="right"> Invoiced at: <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoiceTimeLocal"/> </fo:block> </xsl:if> <fo:block font-family="Calibri" font-weight="bold" space-before="10mm"> Due: <xfd:field xpath="/Report/Body/Data/OrderInvoice/DueDate"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Tasks --> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Tasks/OrderInvoiceTask"> <fo:block space-after="10mm"> <fo:block id="SubTitle"> <xfd:field xpath="Description"/> </fo:block> <fo:block linefeed-treatment="preserve"> <xfd:field xpath="Details"/> </fo:block> <xsl:if test="PrintDetails"> <fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(16)"/> <fo:table-column column-width="proportional-column-width(28)"/> <fo:table-column column-width="proportional-column-width(12)"/> <fo:table-column column-width="proportional-column-width(8)"/> <fo:table-column column-width="proportional-column-width(14)"/> <xsl:if test="$hasDiscount"> <fo:table-column column-width="proportional-column-width(10)"/> </xsl:if> <fo:table-column column-width="proportional-column-width(14)"/> <xsl:if test="$partnerIsPrivate"> <fo:table-column column-width="proportional-column-width(16)"/> </xsl:if> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Article</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Text</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Qty</fo:block> </fo:table-cell> <fo:table-cell> <fo:block/> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Price/each</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block text-align="right">Disc%</fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block text-align="right">Total</fo:block> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> <fo:block text-align="right">incl. VAT</fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-header> <fo:table-body> <xsl:for-each select="OrderLines/OrderLine"> <fo:table-row> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xsl:if test="ArticleMapping/ArticleMapping/PartnerArticleDescription != ''"> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleDescription"/> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping/PartnerArticleDescription != '')"> <xfd:field xpath="Description"/> </xsl:if> </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <xsl:if test="Quantity!=0"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> <xsl:if test="PriceEach!=0"> <fo:block text-align="right"> <xfd:field xpath="PriceEach * ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <xsl:if test="Quantity!=0"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> <xsl:if test="PriceEach!=0"> <fo:block text-align="right"> <xfd:field xpath="PriceEach" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <xsl:if test="$hasDiscount"> <fo:table-cell> <xsl:if test="Totals/Totals/DiscountTotalPct!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/DiscountTotalPct" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <fo:table-cell> <xsl:if test="Totals/Totals/PriceNettTotal!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> <xsl:if test="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> </fo:table-row> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> (<xfd:field xpath="Description"/>) </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell > <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> </fo:table-cell> </xsl:if> <fo:table-cell> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> </fo:table-cell> </xsl:if> </fo:table-row> </xsl:if> </xsl:for-each> <!-- Task footer --> <fo:table-row id="TableLine"> <fo:table-cell number-columns-spanned="5" text-align="right"> <fo:block width="100%">Subtotal:</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block ></fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <fo:block/> </xsl:if> </fo:block> </xsl:for-each> <!-- invoice texts --> <xsl:for-each select="/Report/Extras"> <fo:block space-after="10mm"> <fo:block linefeed-treatment="preserve"> <xfd:field xpath="extra_invoice_text"/> </fo:block> </fo:block> </xsl:for-each> <!-- Totals - multiple VATs --> <fo:block space-after="10mm"> <fo:table table-layout="fixed" width="100%" text-align="right"> <fo:table-column column-width="proportional-column-width(1)"/> <xsl:if test="$hasDiscount"> <fo:table-column column-width="proportional-column-width(1)"/> </xsl:if> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <!-- Header --> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Gross</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block text-align="right">Discount</fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block>Net</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Rate</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>VAT</fo:block> </fo:table-cell> <fo:table-cell> <fo:block font-weight="bold">Amount due</fo:block> </fo:table-cell> </fo:table-row> </fo:table-header> <!-- VAT details--> <fo:table-body> <xfd:table-row-repeat xpath="/Report/Body/Data/OrderInvoice/VatTotals/VatTotal"> <fo:table-cell> <fo:block/> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block/> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block> <xfd:field xpath="Basis" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Percentage" format="number:####0,0 th:. dec:,"/>% </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Summary --> <fo:table-row id="TableLine"> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceNettTotal + /Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal"/> </fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceNettTotal"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block/> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/VatEstTotal"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block font-family="Calibri" font-weight="bold"> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Currency/Currency/Abbreviation"/> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- InvoiceIdentification --> <xsl:if test="/Report/Body/Data/OrderInvoice/Identifications/InvoiceIdentification"> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType != 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentLines"> <fo:block>When paying, please use payment ID:</fo:block> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Identifications/InvoiceIdentification"> <fo:block><xfd:field xpath="Identification"/></fo:block> </xsl:for-each> </fo:block> </xsl:if> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentInfo"> <fo:block>This invoice has been paid</fo:block> </fo:block> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &lt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentInfo"> <fo:block>This credit note has been paid</fo:block> </fo:block> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_prepaid')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentInfo"> <fo:block>The goods will be delivered once this invoice has been paid.</fo:block> </fo:block> </xsl:if> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" dt-namespaces="" sample-xml="..\ExampleData\Xena_Reports_DefaultXSLT_OrderInvoice.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <!-- Attributes --> <xfd:attribute-value object="Logo" attribute="fo:visibility" condition="/Report/Logo = ''" value="hidden"/> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="Title" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="SubTitle" attribute="fo:font-size" value="14pt"/> <xfd:attribute-value object="TableHeader" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TableHeader" attribute="fo:display-align" value="center"/> <xfd:attribute-value object="TableHeader" attribute="fo:height" value="6mm"/> <xfd:attribute-value object="TableHeader" attribute="fo:padding" value="0.5mm"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before" value="1pt solid"/> <xfd:attribute-value object="TableLine" attribute="fo:border-before-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <!-- Variables --> <xsl:variable name="hasDiscount" select="/Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal!=0"/> <xsl:variable name="partnerIsPrivate" select="/Report/Body/Data/OrderInvoice/Payer/Partner/PartnerType='xena_partnertype_person'"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="210mm" page-height="297mm"> <fo:region-body region-name="xsl-region-body" margin="20mm"/> <fo:region-after region-name="xsl-region-after" extent="25mm" padding-left="20mm" padding-right="20mm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after" font-size="11pt"> <fo:table> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(5)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row> <fo:table-cell/> <fo:table-cell text-align="center"> <fo:block> Gjaldstreytir: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/Description"/>. </fo:block> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto"> <fo:block> <xfd:field xpath="Name"/> <xsl:if test="Street != ''"> - <xfd:field xpath="Street"/> </xsl:if> <xsl:if test="PlaceName != ''"> - <xfd:field xpath="PlaceName"/> </xsl:if> <xsl:if test="Zip != '' or City != ''"> - <xfd:field xpath="Zip"/>&#160;<xfd:field xpath="City"/> </xsl:if> <xsl:if test="CountryDisplayName != ''"> - <xfd:field xpath="CountryDisplayName"/> </xsl:if> <xsl:if test="/Report/FiscalSetup/FiscalSetupDto/OrgNumber != ''"> - V-tal:&#160;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </xsl:if> </fo:block> </xsl:for-each> <xsl:for-each select="/Report/FiscalSetup/FiscalSetupDto"> <fo:block> <xsl:if test="Phone != ''"> <fo:inline keep-together.within-line="always"> Telefon: <xfd:field xpath="Phone"/> </fo:inline> </xsl:if> <xsl:if test="Email != ''"> <xsl:if test="Phone != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Teldupostur: <xfd:field xpath="Email"/> </fo:inline> </xsl:if> <xsl:if test="Website != ''"> <xsl:if test="Phone != '' or Email != ''"> - </xsl:if> <fo:inline keep-together.within-line="always"> Heimasíða: <xfd:field xpath="Website"/> </fo:inline> </xsl:if> </fo:block> </xsl:for-each> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> Síða <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body" font-size="11pt"> <fo:table table-layout="fixed" width="100%" padding-before="-15mm" space-after="10mm"> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-body> <fo:table-row height="30mm" font-size="24pt" font-family="Calibri" font-weight="bold" display-align="after"> <!-- Header Logo --> <fo:table-cell> <fo:block> <fo:external-graphic fo:id="Logo" content-height="scale-down-to-fit" height="25mm" scaling="uniform"/> </fo:block> </fo:table-cell> <!-- Header Title --> <fo:table-cell text-align="right"> <fo:block font-size="24pt" font-family="Calibri" font-weight="bold" id="Title"> <xsl:choose> <xsl:when test="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &lt; 0"> Kreditnota </xsl:when> <xsl:otherwise> Fakturi </xsl:otherwise> </xsl:choose> <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoiceNumber"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row height="5mm"> <fo:table-cell number-columns-spanned="3"/> </fo:table-row> <fo:table-row> <!-- Sub-Header Left --> <fo:table-cell text-align="left"> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Order/Order/Address/Address"> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> <xsl:if test="../../Partner/Partner/OrgNumber != ''"> <fo:block> V-tal: <xfd:field xpath="../../Partner/Partner/OrgNumber"/> </fo:block> </xsl:if> </xsl:for-each> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryAddress/Address"> <xsl:if test="Name != ''"> <fo:block space-before="10mm"> Leveringsadressa: </fo:block> <fo:block> <xfd:field xpath="Name"/> </fo:block> <fo:block> <xfd:field xpath="Street"/> </fo:block> <xsl:if test="PlaceName != ''"> <fo:block> <xfd:field xpath="PlaceName"/> </fo:block> </xsl:if> <fo:block> <xfd:field xpath="Zip"/> <xfd:field xpath="City"/> </fo:block> <fo:block> <xfd:field xpath="Country/Country/DisplayName"/> </fo:block> </xsl:if> </xsl:for-each> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryNote != ''"> <fo:block space-before="3mm" linefeed-treatment="preserve"> <fo:inline font-family="Calibri" font-weight="bold">Viðmerking: </fo:inline> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/DeliveryNote"/> </fo:block> </xsl:if> </fo:table-cell> <!-- Sub-Header Right --> <fo:table-cell text-align="right"> <fo:block> Dagseting: <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoicingDate"/> </fo:block> <fo:block> Ordranr.: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/OrderNumber"/> </fo:block> <fo:block> Kundanr: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/PartnerAccountNumber"/> </fo:block> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/OurReference != ''"> <fo:block> Okkara tilv.: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/OurReference"/> </fo:block> </xsl:if> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/YourReference != ''"> <fo:block> Tygara tilv.: <xfd:field xpath="/Report/Body/Data/OrderInvoice/Order/Order/YourReference"/> </fo:block> </xsl:if> <xsl:for-each select="/Report/Body/Data/OrderInvoice/PaymentMeans/PaymentMeans"> <fo:block> <xfd:field xpath="LongDescription"/> </fo:block> </xsl:for-each> <xsl:if test="/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash'"> <fo:block text-align="right"> Fakturatíð: <xfd:field xpath="/Report/Body/Data/OrderInvoice/InvoiceTimeLocal"/> </fo:block> </xsl:if> <fo:block font-family="Calibri" font-weight="bold" space-before="10mm"> Gjaldsdagur: <xfd:field xpath="/Report/Body/Data/OrderInvoice/DueDate"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Tasks --> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Tasks/OrderInvoiceTask"> <fo:block space-after="10mm"> <fo:block id="SubTitle"> <xfd:field xpath="Description"/> </fo:block> <fo:block linefeed-treatment="preserve"> <xfd:field xpath="Details"/> </fo:block> <xsl:if test="PrintDetails"> <fo:block> <fo:table table-layout="fixed" width="100%"> <fo:table-column column-width="proportional-column-width(16)"/> <fo:table-column column-width="proportional-column-width(28)"/> <fo:table-column column-width="proportional-column-width(12)"/> <fo:table-column column-width="proportional-column-width(8)"/> <fo:table-column column-width="proportional-column-width(14)"/> <xsl:if test="$hasDiscount"> <fo:table-column column-width="proportional-column-width(10)"/> </xsl:if> <fo:table-column column-width="proportional-column-width(14)"/> <xsl:if test="$partnerIsPrivate"> <fo:table-column column-width="proportional-column-width(16)"/> </xsl:if> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Vørunr</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Tekstur</fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Nøgd</fo:block> </fo:table-cell> <fo:table-cell> <fo:block/> </fo:table-cell> <fo:table-cell> <fo:block text-align="right">Prísur/eind</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block text-align="right">Avsláttur%</fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block text-align="right">Ialt</fo:block> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> <fo:block text-align="right">við mvg</fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-header> <fo:table-body> <xsl:for-each select="OrderLines/OrderLine"> <fo:table-row> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xsl:if test="ArticleMapping/ArticleMapping/PartnerArticleDescription != ''"> <xfd:field xpath="ArticleMapping/ArticleMapping/PartnerArticleDescription"/> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping/PartnerArticleDescription != '')"> <xfd:field xpath="Description"/> </xsl:if> </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> <xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <xsl:if test="Quantity!=0"> <fo:block> <xfd:field xpath="ArticleMapping/ArticleMapping/Unit/Unit/Abbreviation"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> <xsl:if test="PriceEach!=0"> <fo:block text-align="right"> <xfd:field xpath="PriceEach * ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <xsl:if test="not(ArticleMapping/ArticleMapping)"> <fo:table-cell> <fo:block> <xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> <xfd:field xpath="Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell padding-left="0.8mm"> <xsl:if test="Quantity!=0"> <fo:block> <xfd:field xpath="Unit/Unit/Abbreviation"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> <xsl:if test="PriceEach!=0"> <fo:block text-align="right"> <xfd:field xpath="PriceEach" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <xsl:if test="$hasDiscount"> <fo:table-cell> <xsl:if test="Totals/Totals/DiscountTotalPct!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/DiscountTotalPct" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> <fo:table-cell> <xsl:if test="Totals/Totals/PriceNettTotal!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> <xsl:if test="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal!=0"> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> </xsl:if> </fo:table-row> <xsl:if test="ArticleMapping/ArticleMapping"> <fo:table-row font-size="7pt" > <fo:table-cell> <fo:block> (<xfd:field xpath="Article/Article/ArticleNumber"/><xsl:if test="Article/Article/HasVariants = 'true'">-<xfd:field xpath="ArticleVariant/ArticleVariant/Abbreviation"/></xsl:if>) </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="left"> (<xfd:field xpath="Description"/>) </fo:block> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block text-align="right"> (<xfd:field xpath="Quantity div ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> x <xfd:field xpath="ArticleMapping/ArticleMapping/Quantity" format="number:##.##0,00 th:. dec:,"/> </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> <xsl:if test="Quantity!=0"> <fo:block> <xsl:if test="Unit/Unit/Abbreviation!=''"> <xfd:field xpath="Unit/Unit/Abbreviation" fo:padding-left="0.8mm"/> </xsl:if>) </fo:block> </xsl:if> </fo:table-cell> <fo:table-cell> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> </fo:table-cell> </xsl:if> <fo:table-cell> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell> </fo:table-cell> </xsl:if> </fo:table-row> </xsl:if> </xsl:for-each> <!-- Task footer --> <fo:table-row id="TableLine"> <fo:table-cell number-columns-spanned="5" text-align="right"> <fo:block width="100%">Upphædd:</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block ></fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Totals/Totals/PriceNettTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <xsl:if test="$partnerIsPrivate"> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Totals/Totals/PriceNettTotal + Totals/Totals/VatEstTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <fo:block/> </xsl:if> </fo:block> </xsl:for-each> <!-- invoice texts --> <xsl:for-each select="/Report/Extras"> <fo:block space-after="10mm"> <fo:block linefeed-treatment="preserve"> <xfd:field xpath="extra_invoice_text"/> </fo:block> </fo:block> </xsl:for-each> <!-- Totals - multiple VATs --> <fo:block space-after="10mm"> <fo:table table-layout="fixed" width="100%" text-align="right"> <fo:table-column column-width="proportional-column-width(1)"/> <xsl:if test="$hasDiscount"> <fo:table-column column-width="proportional-column-width(1)"/> </xsl:if> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <fo:table-column column-width="proportional-column-width(1)"/> <!-- Header --> <fo:table-header> <fo:table-row id="TableHeader"> <fo:table-cell> <fo:block>Brutto</fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block text-align="right">Rabat</fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block>Netto</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Satsur</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>MVG</fo:block> </fo:table-cell> <fo:table-cell> <fo:block font-family="Calibri" font-weight="bold">At gjalda</fo:block> </fo:table-cell> </fo:table-row> </fo:table-header> <!-- VAT details--> <fo:table-body> <xfd:table-row-repeat xpath="/Report/Body/Data/OrderInvoice/VatTotals/VatTotal"> <fo:table-cell> <fo:block/> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block/> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block> <xfd:field xpath="Basis" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="Percentage" format="number:####0,0 th:. dec:,"/>% </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="VatAmount" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Summary --> <fo:table-row id="TableLine"> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceNettTotal + /Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <xsl:if test="$hasDiscount"> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/DiscountTotal"/> </fo:block> </fo:table-cell> </xsl:if> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceNettTotal"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block/> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/VatEstTotal"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block font-family="Calibri" font-weight="bold"> <xfd:field xpath="/Report/Body/Data/OrderInvoice/Currency/Currency/Abbreviation"/> <xfd:field format="number:##.##0,00 th:. dec:," xpath="/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- InvoiceIdentification --> <xsl:if test="/Report/Body/Data/OrderInvoice/Identifications/InvoiceIdentification"> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType != 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentLines"> <fo:block>Við gjalding vinarliga nýt gjalds-eyðmerki:</fo:block> <xsl:for-each select="/Report/Body/Data/OrderInvoice/Identifications/InvoiceIdentification"> <fo:block><xfd:field xpath="Identification"/></fo:block> </xsl:for-each> </fo:block> </xsl:if> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_prepaid')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PrePaid"> <fo:block>Hesin fakturin skal gjaldast áðrenn levering. Vøra avsendast við skráseting av tygara gjalding</fo:block> </fo:block> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &gt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentInfo"> <fo:block>Hesin fakturin er goldin</fo:block> </fo:block> </xsl:if> <xsl:if test="(/Report/Body/Data/OrderInvoice/Totals/Totals/PriceGrossTotal &lt; 0) and (/Report/Body/Data/OrderInvoice/Order/Order/TermsOfPayment/TermsOfPayment/DueType = 'xena_cash')"> <fo:block space-after="10mm" font-family="Calibri" font-weight="bold" id="PaymentInfo"> <fo:block>Hendan kreditnotan er útgoldin</fo:block> </fo:block> </xsl:if> </fo:flow> </fo:page-sequence> </xfd:document>
