Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_HistoricStockValueReportList
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_ArticlePostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>List of historic stock values</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no.:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> List of stock value </fo:block> </fo:table-cell> </fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Warehouse/WarehouseDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block > Warehouse: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Warehouse/WarehouseDto/Description"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Location/LocationDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block>Location:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Location/LocationDto/LocationAbbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block>Article group:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell/> <fo:table-cell/> </fo:table-row> </xsl:if> <fo:table-row> <fo:table-cell> <fo:block>Per date:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDate"/> </fo:block> </fo:table-cell> <fo:table-cell/> <fo:table-cell/> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"/> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <xsl:for-each select="/Report/Body/Data/Specification/Posts/Specification"> <fo:block font-size="11pt" line-height="13pt" padding-bottom="30px"> <xfd:field xpath="ArticleGroupDescription"></xfd:field> <fo:table margin-left="3px"> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(30.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.5)" column-number="4"/> <fo:table-column column-width="proportional-column-width(17.5)" column-number="5"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Article #</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Description</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Quantity</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Average cost</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Total value</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="ArticleStock/HistoricStockValueData"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleDescription"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AvailableQuantity" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AverageCostPrice" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="TotalStockValue" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> <fo:table> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(20.0)" column-number="2"/> <fo:table-body> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block> <xfd:field xpath="concat('Total: ',ArticleGroupDescription)" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="TotalArticleGroupValue" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xsl:for-each> <fo:table> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(20.0)" column-number="2"/> <fo:table-body> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block> Grand total </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/GrandTotal" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_ArticlePostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Historisk lagerværdiliste</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> CVR.:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Lagerværdi, historisk </fo:block> </fo:table-cell> </fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Warehouse/WarehouseDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block > Lager: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Warehouse/WarehouseDto/Description"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Location/LocationDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block>Lokation:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Location/LocationDto/LocationAbbreviation"/> </fo:block> </fo:table-cell> </fo:table-row> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto)&gt;0"> <fo:table-row> <fo:table-cell> <fo:block>Varegruppe:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/ArticleGroup/ArticleGroupDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell/> <fo:table-cell/> </fo:table-row> </xsl:if> <fo:table-row> <fo:table-cell> <fo:block>Pr. dato:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalDate"/> </fo:block> </fo:table-cell> <fo:table-cell/> <fo:table-cell/> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"/> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <xsl:for-each select="/Report/Body/Data/Specification/Posts/Specification"> <fo:block font-size="11pt" line-height="13pt" padding-bottom="30px"> <xfd:field xpath="ArticleGroupDescription"></xfd:field> <fo:table margin-left="3px"> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(30.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.5)" column-number="4"/> <fo:table-column column-width="proportional-column-width(17.5)" column-number="5"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block>Varenr.</fo:block> </fo:table-cell> <fo:table-cell> <fo:block>Beskrivelse</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Antal</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Gns. pris</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Værdi, total</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="ArticleStock/HistoricStockValueData"> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleNumber"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="ArticleDescription"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AvailableQuantity" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="AverageCostPrice" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="TotalStockValue" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> <fo:table> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(20.0)" column-number="2"/> <fo:table-body> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block> <xfd:field xpath="concat('Total: ',ArticleGroupDescription)" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="TotalArticleGroupValue" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xsl:for-each> <fo:table> <fo:table-column column-width="proportional-column-width(20.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(20.0)" column-number="2"/> <fo:table-body> <fo:table-row id="PostsHeader"> <fo:table-cell> <fo:block> Total lagerværdi </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/GrandTotal" format="number:##.##0,00 th:. dec:, sign:"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
