Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_LedgerTagStatisticReportList
source: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_ArticlePostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>List of development by month</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org. no.:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(30)" column-number="2"/> <fo:table-column column-width="proportional-column-width(20)" column-number="3"/> <fo:table-column column-width="proportional-column-width(30)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> List of development in ledgertag </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Ledger tag:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Description" /> </fo:block> </fo:table-cell> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto)&gt;0"> <fo:table-cell> <fo:block>Department:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Bearer/BearerDto)&gt;0"> <fo:table-cell> <fo:block>Bearer:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Purpose/PurposeDto)&gt;0"> <fo:table-cell> <fo:block>Purpose:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(10.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(22.0)" column-number="5"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader" border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid"> <fo:block>&#x00A0;</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalPeriod/FiscalPeriodDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/PreviousPeriod/FiscalPeriodDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Difference</fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block>Ratio</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Details/LedgerTagStatistic"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid" margin-left="3px"> <fo:block> <xfd:field xpath="PeriodDescription"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Period" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="Period_LastYear" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Difference" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="DifferenceRatio" format="number:##.##0,0 th:. dec:, sign:" /> % </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Totals --> <fo:table-row id="PostsHeader" border-top-width="0.25pt" border-top-style="solid" border-bottom-width="0.25pt" border-bottom-style="solid"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid" margin-left="3px"> <fo:block>Totals:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Period" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Period_LastYear" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Difference" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/DifferenceRatio" format="number:##.##0,0 th:. dec:, sign:" /> % </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="utf-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_ArticlePostReportList.xml"> <xfd:localization> <xfd:locale language-id="da_DK" language-name="Danish"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PostsHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="AccountHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightTextColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Månedlig udvikling af finanskonto</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> CVR:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(20)" column-number="1"/> <fo:table-column column-width="proportional-column-width(30)" column-number="2"/> <fo:table-column column-width="proportional-column-width(20)" column-number="3"/> <fo:table-column column-width="proportional-column-width(30)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Månedlig udvikling af finanskonto </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block>Finanskonto:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/LedgerTag/LedgerTagDto/Description" /> </fo:block> </fo:table-cell> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto)&gt;0"> <fo:table-cell> <fo:block>Afdeling:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Bearer/BearerDto)&gt;0"> <fo:table-cell> <fo:block>Bærer:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Purpose/PurposeDto)&gt;0"> <fo:table-cell> <fo:block>Formål:</fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description" /> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"></fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Posts --> <fo:block font-size="11pt" line-height="13pt"> <fo:table padding-bottom="30px"> <fo:table-column column-width="proportional-column-width(10.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="2"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="3"/> <fo:table-column column-width="proportional-column-width(26.0)" column-number="4"/> <fo:table-column column-width="proportional-column-width(22.0)" column-number="5"/> <fo:table-body> <!-- Columnheaders --> <fo:table-row id="PostsHeader" border-top-width="0.25pt" border-top-style="solid"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid"> <fo:block>&#x00A0;</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalPeriod/FiscalPeriodDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/PreviousPeriod/FiscalPeriodDto/Description" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block>Difference</fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block>%</fo:block> </fo:table-cell> </fo:table-row> <!-- Posts --> <xfd:table-row-repeat xpath="/Report/Body/Data/Specification/Details/LedgerTagStatistic"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid" margin-left="3px"> <fo:block> <xfd:field xpath="PeriodDescription"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Period" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="Period_LastYear" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="Difference" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="DifferenceRatio" format="number:##.##0,0 th:. dec:, sign:" /> % </fo:block> </fo:table-cell> </xfd:table-row-repeat> <!-- Totals --> <fo:table-row id="PostsHeader" border-top-width="0.25pt" border-top-style="solid" border-bottom-width="0.25pt" border-bottom-style="solid"> <fo:table-cell border-left-width="0.25pt" border-left-style="solid" margin-left="3px"> <fo:block>Total:</fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Period" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Period_LastYear" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/Difference" format="number:##.##0,00 th:. dec:, sign:" /> </fo:block> </fo:table-cell> <fo:table-cell text-align="right" margin-right="3px" border-right-width="0.25pt" border-right-style="solid"> <fo:block> <xfd:field xpath="/Report/Body/Data/Specification/DifferenceRatio" format="number:##.##0,0 th:. dec:, sign:" /> % </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:flow> </fo:page-sequence> </xfd:document>
