Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources.ReportLayout/Files.*.resx
Languages: fo_fo

# Xena_Reports_DefaultXSLT_FiscalBalance
source: <?xml version="1.0" encoding="UTF-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_FiscalBalance.xml"> <xfd:localization> <xfd:locale language-id="en_US" language-name="English (United States)"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="BalanceHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="BalanceHeaderBorder" attribute="fo:border-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm"/> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Fiscal balance</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1"/>/<fo:page-number-citation format="1" ref-id="xf#theEnd"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org.no.: <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Printed: <xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Fiscal balance </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block> Period: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalPeriod/FiscalPeriodDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> From date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/DateFrom"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto) = 1"> <fo:table-cell> <fo:block> Department: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto) = 0"> <fo:table-cell/> <fo:table-cell/> </xsl:if> <fo:table-cell> <fo:block> To date: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/DateTo"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Bearer/BearerDto) = 1"> <fo:table-cell> <fo:block> Bearer: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Purpose/PurposeDto) = 1"> <fo:table-cell> <fo:block> Purpose: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"/> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Balance details --> <fo:table table-layout="fixed" width="100%" font-size="11pt" line-height="15pt"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <xfd:table-row-repeat fo:id="47234D0A" xpath="/Report/Body/Data/FiscalBalanceGroupDataDto" id="32B716B6"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt" number-columns-spanned="4"> <!-- Resultatopgørelse / Aktiver / Passiver --> <fo:block> <xsl:if test="not(position() = 1)"> <xsl:attribute name="break-before">page</xsl:attribute> </xsl:if> </fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" margin-bottom="20px" border-bottom-width="1pt" border-bottom-style="solid" id="BalanceHeaderBorder"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="14pt" line-height="20pt" id="BalanceHeader"> <xfd:field xpath="TranslatedDescription"/> </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="Center"> Primo </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="center"> Movement </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="center"> Year to date </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Grupper --> <fo:block> <xfd:block-repeat xpath="Details/FiscalBalanceGroupDetailDataDto"> <!-- Overskrift for LedgerAccount --> <fo:block margin-bottom="10px"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" border-bottom-width="0.25pt" border-bottom-style="solid" id="BalanceHeaderBorder" font-weight="bold" font-family="Calibri"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> <xfd:field xpath="TranslatedGroup"/> </fo:block> </fo:table-cell> <!-- Below is only visible if they have no posts and have amounts themself --> <xsl:if test="count(Details/FiscalBalanceDetailDataDto) = 0 and count(GroupedDetails/FiscalBalanceDetailGroupData) = 0"> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- LedgerAccount detaljer --> <fo:block> <fo:block> <fo:block> <!-- Konto subgrupper --> <xfd:block-repeat xpath="GroupedDetails/FiscalBalanceDetailGroupData" margin-bottom="10px"> <fo:block margin-left="10px" font-weight="bold" font-family="Calibri"> <xfd:field xpath="Description"/> </fo:block> <!-- Konto linje (LedgerTag/ArticleGroup/Vat) med gruppering --> <xfd:block-repeat xpath="Details/FiscalBalanceDetailDataDto" font-family="Calibri"> <fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block padding-left="0px" margin-left="20px"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> <!-- Total gruppering --> <fo:table table-layout="fixed" width="100%" font-family="Calibri" font-weight="bold"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Description"/>, total: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xfd:block-repeat> <!-- Konto linje (LedgerTag/ArticleGroup/Vat) uden gruppering --> <xfd:block-repeat xpath="Details/FiscalBalanceDetailDataDto"> <fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block padding-left="0px" margin-left="10px"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> </fo:block> <xfd:conditional-block-sequence> <xfd:conditional-block test="count(Details/FiscalBalanceDetailDataDto) &gt; 0 or count(GroupedDetails/FiscalBalanceDetailGroupData) &gt; 0"> <fo:block keep-together.within-page="auto" keep-with-previous.within-line="always"> <fo:table width="100%" padding-after="20px" border-collapse="collapse" border-top-width="0.25pt" border-top-style="solid" id="BalanceHeaderBorder"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold"> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="TranslatedGroup"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:conditional-block> </xfd:conditional-block-sequence> </fo:block> </fo:block> <!-- DB I --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Product_Consumption'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Margin I </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> <!-- DB II --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Sales_Costs'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Margin II </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> <!-- IB --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Administration_Costs'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Earnings </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> </xfd:block-repeat> </fo:block> <fo:block keep-with-previous.within-line="auto" font-size="11pt" line-height="15pt"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold"> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="TranslatedDescription"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right" id="341B16B6"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
fo_fo: <?xml version="1.0" encoding="UTF-8"?> <xfd:document xmlns:fo="http://www.w3.org/1999/XSL/Format" xmlns:xfd="http://www.ecrion.com/xfd/1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:xf="http://www.ecrion.com/xf/1.0" xmlns:xc="http://www.ecrion.com/2008/xc" xmlns:svg="http://www.w3.org/2000/svg" fo:font-family="Times" fo:font-size="12pt" sample-xml=".\ExampleData\Xena_Reports_DefaultXSLT_FiscalBalance.xml"> <xfd:localization> <xfd:locale language-id="en_US" language-name="English (United States)"/> </xfd:localization> <xfd:attribute-value object="Logo" attribute="fo:src" dynamic-value="concat('data:image/jpg;base64,',/Report/Logo)"/> <xfd:attribute-value object="FiscalSetupName" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="FiscalSetupOrgNo" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="PrintDate" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/InvertedTextColour"/> <xfd:attribute-value object="TitleCell" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="TitleFooter" attribute="fo:background-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/LightHighlightColour"/> <xfd:attribute-value object="BalanceHeader" attribute="fo:color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <xfd:attribute-value object="BalanceHeaderBorder" attribute="fo:border-color" dynamic-value="/Report/FiscalSetup/FiscalSetupDto/DarkHighlightColour"/> <!-- Layout --> <fo:layout-master-set> <fo:simple-page-master master-name="A4" page-width="21cm" page-height="29.7cm"> <fo:region-body region-name="xsl-region-body" margin="2cm"/> <fo:region-after region-name="xsl-region-after" extent="2cm" padding-left="2cm" padding-right="2cm" /> </fo:simple-page-master> </fo:layout-master-set> <!-- Page --> <fo:page-sequence master-reference="A4" font-family="Calibri, Microsoft YaHei"> <!-- Footer --> <fo:static-content flow-name="xsl-region-after"> <fo:block font-size="11pt" line-height="20pt"> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1" /> <fo:table-column column-width="proportional-column-width(50)" column-number="2" /> <fo:table-body> <fo:table-row border-top-style="solid" border-top-width="0.25pt" border-top-color="rgb(0,0,0)"> <fo:table-cell display-align="center"> <fo:block>Finansbalance</fo:block> </fo:table-cell> <fo:table-cell display-align="center" text-align="right"> <fo:block> <fo:page-number format="1" />/<fo:page-number-citation format="1" ref-id="xf#theEnd" /> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:static-content> <!-- Body --> <fo:flow flow-name="xsl-region-body"> <!-- Header --> <fo:block> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(50)" column-number="1"/> <fo:table-column column-width="proportional-column-width(50)" column-number="2"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block height="3cm"> <fo:external-graphic src="url()" content-height="scale-down-to-fit" id="Logo" height="3cm" width="100%" scaling="uniform"/> </fo:block> </fo:table-cell> <fo:table-cell text-align="right"> <fo:block font-size="24pt" id="FiscalSetupName"> <xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/Address/AddressDto/Name"/> </fo:block> <fo:block font-size="14pt" line-height="21pt" id="FiscalSetupOrgNo"> Org:&#x00A0;<xfd:field xpath="/Report/FiscalSetup/FiscalSetupDto/OrgNumber"/> </fo:block> <fo:block font-size="11pt" line-height="42pt" id="PrintDate"> Udskrevet:&#x00A0;<xfd:field xpath="$XFCrtLocalDateTime"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Content --> <fo:block font-size="11pt" line-height="15pt"> <!-- Title and criteria table --> <fo:table width="100%" table-layout="fixed"> <fo:table-column column-width="proportional-column-width(15)" column-number="1"/> <fo:table-column column-width="proportional-column-width(35)" column-number="2"/> <fo:table-column column-width="proportional-column-width(15)" column-number="3"/> <fo:table-column column-width="proportional-column-width(35)" column-number="4"/> <fo:table-body> <fo:table-row height="1,05cm"> <fo:table-cell padding="2pt" number-columns-spanned="4" display-align="center" text-align="center" id="TitleCell"> <fo:block font-size="14pt"> Finansbalance </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <fo:table-cell> <fo:block> Periode: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/FiscalPeriod/FiscalPeriodDto/Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> Fra dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/DateFrom"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto) = 1"> <fo:table-cell> <fo:block> Afdeling: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Department/DepartmentDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Department/DepartmentDto) = 0"> <fo:table-cell/> <fo:table-cell/> </xsl:if> <fo:table-cell> <fo:block> Til dato: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/DateTo"/> </fo:block> </fo:table-cell> </fo:table-row> <fo:table-row> <xsl:if test="count(/Report/Body/Criteria/Specification/Bearer/BearerDto) = 1"> <fo:table-cell> <fo:block> Bærer: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Bearer/BearerDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> <xsl:if test="count(/Report/Body/Criteria/Specification/Purpose/PurposeDto) = 1"> <fo:table-cell> <fo:block> Formål: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block> <xfd:field xpath="/Report/Body/Criteria/Specification/Purpose/PurposeDto/Description"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> <fo:table-row height="2pt" padding-after="1,5cm"> <fo:table-cell number-columns-spanned="4" id="TitleFooter"/> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- Balance details --> <fo:table table-layout="fixed" width="100%" font-size="11pt" line-height="15pt"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <xfd:table-row-repeat fo:id="47234D0A" xpath="/Report/Body/Data/FiscalBalanceGroupDataDto" id="32B716B6"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt" number-columns-spanned="4"> <!-- Resultatopgørelse / Aktiver / Passiver --> <fo:block> <xsl:if test="not(position() = 1)"> <xsl:attribute name="break-before">page</xsl:attribute> </xsl:if> </fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" margin-bottom="20px" border-bottom-width="1pt" border-bottom-style="solid" id="BalanceHeaderBorder"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="14pt" line-height="20pt" id="BalanceHeader"> <xfd:field xpath="TranslatedDescription"/> </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="Center"> Primo </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="center"> Bevægelse </fo:block> </fo:table-cell> <fo:table-cell display-align="after"> <fo:block text-align="center"> År til dato </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> <!-- Grupper --> <fo:block> <xfd:block-repeat xpath="Details/FiscalBalanceGroupDetailDataDto"> <!-- Overskrift for LedgerAccount --> <fo:block margin-bottom="10px"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse" border-bottom-width="0.25pt" border-bottom-style="solid" id="BalanceHeaderBorder" font-weight="bold" font-family="Calibri"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> <xfd:field xpath="TranslatedGroup"/> </fo:block> </fo:table-cell> <!-- Below is only visible if they have no posts and have amounts themself --> <xsl:if test="count(Details/FiscalBalanceDetailDataDto) = 0 and count(GroupedDetails/FiscalBalanceDetailGroupData) = 0"> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </xsl:if> </fo:table-row> </fo:table-body> </fo:table> </fo:block> <!-- LedgerAccount detaljer --> <fo:block> <fo:block> <fo:block> <!-- Konto subgrupper --> <xfd:block-repeat xpath="GroupedDetails/FiscalBalanceDetailGroupData" margin-bottom="10px"> <fo:block margin-left="10px" font-weight="bold" font-family="Calibri"> <xfd:field xpath="Description"/> </fo:block> <!-- Konto linje (LedgerTag/ArticleGroup/Vat) med gruppering --> <xfd:block-repeat xpath="Details/FiscalBalanceDetailDataDto" font-family="Calibri"> <fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block padding-left="0px" margin-left="20px"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> <!-- Total gruppering --> <fo:table table-layout="fixed" width="100%" font-family="Calibri" font-weight="bold"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="Description"/>, total: </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right" border-top-width="0.25pt" border-top-style="solid" border-color="gray"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xfd:block-repeat> <!-- Konto linje (LedgerTag/ArticleGroup/Vat) uden gruppering --> <xfd:block-repeat xpath="Details/FiscalBalanceDetailDataDto"> <fo:block> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row> <fo:table-cell> <fo:block padding-left="0px" margin-left="10px"> <xfd:field xpath="Description"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:block-repeat> </fo:block> <xfd:conditional-block-sequence> <xfd:conditional-block test="count(Details/FiscalBalanceDetailDataDto) &gt; 0 or count(GroupedDetails/FiscalBalanceDetailGroupData) &gt; 0"> <fo:block keep-together.within-page="auto" keep-with-previous.within-line="always"> <fo:table width="100%" padding-after="20px" border-collapse="collapse" border-top-width="0.25pt" border-top-style="solid" id="BalanceHeaderBorder"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" > <fo:table-cell> <fo:block text-align="right"><xfd:field xpath="TranslatedGroup"/></fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </xfd:conditional-block> </xfd:conditional-block-sequence> </fo:block> </fo:block> <!-- DB I --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Product_Consumption'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Dækningsbidrag I </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> <!-- DB II --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Sales_Costs'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Dækningsbidrag II </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> <!-- IB --> <fo:block> <xsl:if test="Description = 'Xena_Domain_Income_Accounts_Administration_Costs'"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" margin-bottom="5pt"> <fo:table-cell border-width="1pt" border-color="black" padding="2pt"> <fo:block font-size="12pt" line-height="15pt"> Indtjeningsbidrag </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountYearToDate - /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountMonth + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell> <fo:block text-align="right"> <xfd:field xpath="/Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Net_Turn_Over']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Product_Consumption']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Sales_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Wages']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Production_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Administration_Costs']/AmountYearToDate + /Report/Body/Data/FiscalBalanceGroupDataDto/Details/FiscalBalanceGroupDetailDataDto[Description='Xena_Domain_Income_Accounts_Housing_Costs']/AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </xsl:if> </fo:block> </xfd:block-repeat> </fo:block> <fo:block keep-with-previous.within-line="auto" font-size="11pt" line-height="15pt"> <fo:table table-layout="fixed" width="100%" border-collapse="collapse"> <fo:table-column column-width="proportional-column-width(50.0)" column-number="1"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="2"/> <fo:table-column column-width="proportional-column-width(16.5)" column-number="3"/> <fo:table-column column-width="proportional-column-width(17.0)" column-number="4"/> <fo:table-body> <fo:table-row font-family="Calibri" font-weight="bold" > <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="TranslatedDescription"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="AmountYearToDate - AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right"> <xfd:field xpath="AmountMonth" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> <fo:table-cell border-width="1pt" border-top-style="solid" border-color="black"> <fo:block text-align="right" id="341B16B6"> <xfd:field xpath="AmountYearToDate" format="number:##.##0,00 th:. dec:,"/> </fo:block> </fo:table-cell> </fo:table-row> </fo:table-body> </fo:table> </fo:block> </fo:table-cell> </xfd:table-row-repeat> </fo:table-body> </fo:table> </fo:flow> </fo:page-sequence> </xfd:document>
