Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Constant.*.resx
Languages: fo_fo, nb_no, sv_se

# DueType_Cash
source: Cash
fo_fo: Netto
nb_no: Netto
sv_se: Netto

# DueType_RunningMonth
source: Running month
fo_fo: Verandi mánaður
nb_no: Løpende måned
sv_se: Löpande månad

# IntervalType_Week
source: week
nb_no: uke
sv_se: vecka

# IntervalType_Weeks
source: weeks
nb_no: uker
sv_se: veckor

# IntervalType_Year
source: year
nb_no: år
sv_se: år

# IntervalType_Years
source: years
nb_no: år
sv_se: år

# Localized_DueType_xena_cash
source: Cash
fo_fo: Kontant
nb_no: Kontant
sv_se: Kontant

# Localized_DueType_xena_nett
source: Net
fo_fo: Netto
nb_no: Netto
sv_se: Netto

# Localized_DueType_xena_running_month
source: Running month
fo_fo: Verandi mánaður
nb_no: Løpende måned
sv_se: Löpande månad

# Localized_Entity_Article
source: Article
fo_fo: Vøra
nb_no: Vare
sv_se: Vara

# Localized_Entity_Order
source: Order
fo_fo: Ordri
nb_no: Ordre

# Localized_IdentityType_EmailIdentification
source: Email
fo_fo: Teldupostur
nb_no: E-post

# Localized_IdentityType_MobileIdentification
source: Mobile
fo_fo: Fartelefon
nb_no: Mobil
sv_se: Mobil

# Localized_UserGroup_Accountant
source: Accountant
fo_fo: Grannskoðari
nb_no: Revisor
sv_se: Revisor

# Localized_UserGroup_Admin
source: Admin
fo_fo: Umsitari
nb_no: Administrator
sv_se: Administratör

# Localized_UserGroup_Bookkeeper
source: Bookkeeper
fo_fo: Bókhaldari
nb_no: Regnskapsfører
sv_se: Bokhållare

# Localized_UserGroup_SalesAssistent
source: Sales assistent
fo_fo: Søluráðgevari
nb_no: Salgskonsulent
sv_se: Försäljningsassistent

# PartnerBalanceType_Customer
source: Customer balances
fo_fo: Kundajavnar
nb_no: Kundebalanse
sv_se: Kundbalanser

# PartnerBalanceType_Supplier
source: Supplier balances
fo_fo: Leverandørjavni
nb_no: Leverandørbalanse
sv_se: Leverantörbalans

# PartnerPostType_Adjustment
source: Adjustment
fo_fo: Javning
nb_no: Justering
sv_se: Justering

# PartnerPostType_CustomerAdjustment
source: Customer adjustment
fo_fo: Javning, kundi
nb_no: Justering, kunde
sv_se: Justering, kund

# PartnerPostType_CustomerCreditNote
source: Customer credit note
fo_fo: Kreditnota, kundi
nb_no: Kredittnota, kunde
sv_se: Kreditnota, kund

# PartnerPostType_CustomerInterest
source: Customer interest
fo_fo: Rentur, kundi
nb_no: Renter, kunde
sv_se: Ränteavskrivning, kund

# PartnerPostType_CustomerInvoice
source: Customer invoice
fo_fo: Fakturi, kundi
nb_no: Faktura, kunde
sv_se: Faktura, kund

# PartnerPostType_CustomerPayment
source: Customer payment
fo_fo: Gjalding, kundi
nb_no: Betaling, kunde
sv_se: Betalning, kund

# PartnerPostType_CustomerPrimo
source: Primo, customer
fo_fo: Byrjanarbóking, kundi
nb_no: Åpningstall (kunde)
sv_se: Betalning, kund

# PartnerPostType_SupplierAdjustment
source: Supplier adjustment
fo_fo: Justering, leverandør
nb_no: Justering, leverandør
sv_se: Justering, leverantör

# PartnerPostType_SupplierCreditNote
source: Supplier credit note
fo_fo: Kreditnota, leverandørur
nb_no: Kredittnota, leverandør
sv_se: Kreditnota, leverantör

# PartnerPostType_SupplierInterest
source: Supplier interest
fo_fo: Rentutilskriving, leverandørur
nb_no: Rentetilskrivning, leverandør
sv_se: Räntetillskrivning, leverantör

# PartnerPostType_SupplierInvoice
source: Supplier invoice
fo_fo: Fakturi, leverandørur
nb_no: Faktura, leverandør
sv_se: Faktura, leverantör

# PartnerPostType_SupplierPayment
source: Supplier payment
fo_fo: Gjalding, leverandørur
nb_no: Betaling, leverandør
sv_se: Betalning, leverantör

# PartnerPostType_SupplierPrimo
source: Primo, supplier
fo_fo: Byrjanarbóking, leverandørur
nb_no: Åpningstall (leverandør)
sv_se: Primopost, leverantör

# Reports_DefaultName_LedgerTagStatement
source: Ledger tag statement
fo_fo: Fíggjarkontoavrit
nb_no: Finanskontoutskrift
sv_se: Finanskontoutdrag

# Reports_DefaultName_OrderDelivery
source: Deliverynote
fo_fo: Fylgiseðil
nb_no: Følgeseddel
sv_se: Följesedel

# Reports_DefaultName_OrderInvoice
source: Invoice
fo_fo: Fakturi
nb_no: Faktura
sv_se: Faktura

# Reports_DefaultName_OrderOffer
source: Offer
nb_no: Tilbud
sv_se: Erbjudande

# Reports_DefaultName_OrderConfirmation
source: Order confirmation
fo_fo: Ordraváttan
nb_no: Ordrebekreftelse

# Reports_DefaultName_PartnerBalance
source: Partner balance
fo_fo: Vinnupartnarasaldolisti
nb_no: Partner saldoliste
sv_se: Partner saldolista

# Reports_DefaultName_PartnerStatement
source: Partner statement
fo_fo: Vinnupartnarakontoavrit
nb_no: Partnerkontoutskrift
sv_se: Kontoutdrag, partner

# Reports_DefaultName_Reminder
source: Reminder
fo_fo: Rykkjari
nb_no: Purring
sv_se: Påminnelse

# VoucherDraftType_CreditorIncomingInvoice
source: Incoming creditor invoice
nb_no: Inngående kreditorbilag
sv_se: Momsuppgörelse

# VoucherDraftType_Finance
source: Finance
fo_fo: Fíggjarmál
nb_no: Finans
sv_se: Finans

# VoucherDraftType_PartnerPayment
source: Partner payment
fo_fo: Vinnupartnari inn- og útgjalding
nb_no: Partners inn- eller utbetaling
sv_se: Partner in- eller utbetalning

# Xena_Domain_Asset_Accounts
source: Assets
fo_fo: Ognir
nb_no: Eiendeler
sv_se: Tillgångar/räkenskapspost

# Xena_Domain_Asset_Accounts_Advance_Payments
source: Advance payments
fo_fo: Forskotsgjøld
nb_no: Forskuddsbetalinger
sv_se: Förskottsbetalningar

# Xena_Domain_Asset_Accounts_Cash
source: Cash
fo_fo: Tøkur peningur
nb_no: Likvide midler
sv_se: Kontant

# Xena_Domain_Asset_Accounts_Customer_Receivables
source: Customer Receivables
fo_fo: Áognir
nb_no: Kundefordringer
sv_se: Tillgodohavande, kund

# Xena_Domain_Asset_Accounts_Financial_Fixed_Asset
source: Financial Fixed Assets
fo_fo: Fíggjarligur útbúnaður
nb_no: Finansielle anleggsmidler
sv_se: Finansiella anläggningstillgångar

# Xena_Domain_Asset_Accounts_Intangible_Fixed_Asset
source: Intangible Fixed Assets
fo_fo: Óevnisligur útbúnaður
nb_no: Immaterielle eiendeler
sv_se: Immateriella anläggningstillgångar

# Xena_Domain_Asset_Accounts_ManualStock
source: Manual stock
fo_fo: Manuel goysla
nb_no: Manuelt lager
sv_se: Manuellt lager

# Xena_Domain_Asset_Accounts_Other_Receivables
source: Other Receivables
fo_fo: Aðrar áognir
nb_no: Andre fordringer
sv_se: Andra tillgodohavanden

# Xena_Domain_Asset_Accounts_Stock
source: Stock
fo_fo: Vørugoymsla
nb_no: Varelager
sv_se: Varulager

# Xena_Domain_Asset_Accounts_Stock_Reception
source: Stock reception
nb_no: Varemottak
sv_se: Varumottagning

# Xena_Domain_Asset_Accounts_Tangible_Fixed_Asset
source: Tangible Fixed Assets
fo_fo: Støðisogn
nb_no: Varige driftsmidler
sv_se: Realtillgångar

# Xena_Domain_Income_Accounts
source: Income
fo_fo: Rakstrarúrslit
nb_no: Resultatoppgjør
sv_se: Inkomst

# Xena_Domain_Income_Accounts_Administration_Costs
source: Administration costs
fo_fo: Fyrisitingarútreiðslur
nb_no: Administrasjonskostnader
sv_se: Administrationsomkostnader

# Xena_Domain_Income_Accounts_Consolidation_Result
source: Consolidation result
fo_fo: Samtaksúrslit
nb_no: Konsernresultat
sv_se: -->checka

# Xena_Domain_Income_Accounts_Depreciation
source: Depreciations
fo_fo: Avskriving
nb_no: Avskrivninger
sv_se: Avskrivningar

# Xena_Domain_Income_Accounts_Financial_Costs
source: Financial costs
fo_fo: Fíggjarbókingar
nb_no: Finansposteringer
sv_se: Financiella kostnader

# Xena_Domain_Income_Accounts_Housing_Costs
source: Housing costs
fo_fo: Útreiðslur hús/ hølir
nb_no: Omkostninger hus/lokale
sv_se: Lokalomkostnader

# Xena_Domain_Income_Accounts_Net_Turn_Over
source: Nett turn over
fo_fo: Netto umseting
nb_no: Nettoomsetning
sv_se: Nettoomsättning

# Xena_Domain_Income_Accounts_Product_Consumption
source: Product consumption
nb_no: Vareforbruk
sv_se: Varuförbruk

# Xena_Domain_Income_Accounts_Sales_Costs
source: Sales costs
fo_fo: Sølukostnaðir
nb_no: Salgskostnader
sv_se: Försäljningsomkostnader

# Xena_Domain_Income_Accounts_System_Differences
source: System differences
nb_no: Systemdifferanse
sv_se: Systemdifferens

# Xena_Domain_Income_Accounts_Taxes
source: Taxes
nb_no: Skatt
sv_se: Skatter och avgifter

# Xena_Domain_Income_Accounts_Wages
source: Personel costs
fo_fo: Starvsfólkakostnaður
nb_no: Personalkostnader
sv_se: Lön

# Xena_Domain_Liability_Accounts
source: Liabilities
fo_fo: Skuld
nb_no: Gjeld

# Xena_Domain_Liability_Accounts_Equity
source: Equity
fo_fo: Eginpeningur
nb_no: Egenkapital
sv_se: Eenkaptial

# Xena_Domain_Liability_Accounts_Long_Term_Debt
source: Long term debt
fo_fo: Langfreistað skuld
nb_no: Langsiktig gjeld
sv_se: Långsiktig skuld

# Xena_Domain_Liability_Accounts_Other_Short_Term_Debt
source: Other short term debt
fo_fo: Onnur stuttfreistað skuld
nb_no: Annen kortsiktig gjeld
sv_se: Annan kortsiktig skuld

# Xena_Domain_Liability_Accounts_Provisions
source: Provisions
nb_no: Avsetninger
sv_se: THOMAS

# Xena_Domain_Liability_Accounts_Trade_Payables
source: Trade payables
fo_fo: Leverandørur
nb_no: Leverandør
sv_se: Leverantörrskulder

# Xena_Domain_Liability_Accounts_UnPaid_Stock
source: Unpaid stock
nb_no: Varelager, ubetalt
sv_se: varulager, utbetalt

# Xena_Domain_Liability_Accounts_Vat_Debt
source: Vat debt
fo_fo: Skyldigt MVG
nb_no: Skyldig moms
sv_se: Momsskuld

# Xena_Fiscal_NewDocument_Description
source: {0} has sent you a new document
fo_fo: {0} hevur sent eitt nýtt skjal
nb_no: {0} har sendt et nytt dokument
sv_se: {0} har skickat ett nytt dokument

# Xena_Fiscal_NewInvoice_Description
source: {0} sent you an invoice
fo_fo: {0} hevur sent ein faktura
nb_no: {0} har sendt en faktura
sv_se: {0} har skickat en faktura

# Xena_User_NewInvoice_Description
source: {0} sent you an invoice
fo_fo: {0} hevur sent ein faktura
nb_no: {0} har sendt en faktura
sv_se: {0} har skickat en faktura

# ContextType_Customer
source: Customer
fo_fo: Kundi
nb_no: Kunde
sv_se: Kund

# ContextType_Supplier
source: Supplier
fo_fo: Leverandørur
nb_no: Leverandør
sv_se: Leverantör

# Domain_VoucherDraftTexts_Payment
source: Payment by {0}
fo_fo: Gjalding frá {0}
nb_no: Betaling fra {0}
sv_se: Betalning från {0}

# IntervalType_Day
source: day
fo_fo: dagur
nb_no: dag
sv_se: dag

# IntervalType_Days
source: days
fo_fo: Dagar
nb_no: dager
sv_se: dagar

# IntervalType_Month
source: month
fo_fo: mánaður
nb_no: måned
sv_se: Månad

# IntervalType_Months
source: months
fo_fo: Mánaðir
nb_no: måneder
sv_se: månad

source: Invite
nb_no: Invitasjon
sv_se: Inbjudan

source: Mail
fo_fo: Teldupostur
nb_no: E-post
sv_se: E-mail

# PartnerInviteHistoryEntry
source: Partner invitation
fo_fo: Vinnupartnarainnbjóðing
nb_no: Partnerinvitasjon
sv_se: Partnerinbjudan

source: Phone
nb_no: Telefon
sv_se: Telefon

# Reports_DefaultName_InventoryCountingList
source: Inventory counting list
fo_fo: Goymsluteljingarlisti
nb_no: Lageropptellingsliste
sv_se: Inventeringslista

# Reports_DefaultName_LedgerAccountSpecificationReportList
source: Ledger account specification
fo_fo: Kontoútgreining
nb_no: Kontospesifikasjon
sv_se: Kontospecifikation

# xena_cash
source: Cash
fo_fo: Kontant
nb_no: Kontant
sv_se: Kontant

# xena_ledgerposttype_consumption
source: Own consumption
fo_fo: Eginnýtsla
nb_no: Eget forbruk
sv_se: Eget förbruk

# xena_ledgerposttype_resale
source: For re-sale
nb_no: Videresalg
sv_se: Till återförsäljning

# xena_nett
source: Nett
fo_fo: Netto
nb_no: Netto
sv_se: Netto

# xena_partnertype_company
source: Company
fo_fo: fyritøka
nb_no: Firma
sv_se: Företag

# xena_partnertype_indeterminate
source: Indeterminate
fo_fo: Annað
nb_no: Annet
sv_se: Annat

# xena_partnertype_person
source: Private person
fo_fo: Privatpersónur
nb_no: Privatperson
sv_se: Privatperson

# Xena_User_NewDocument_Description
source: New document from {0}
fo_fo: Nýtt skjal frá {0}
nb_no: Nytt dokument fra {0}
sv_se: Nytt dokument från {0}

source: Note
fo_fo: Upprit
nb_no: Notat

# Reports_DefaultName_LedgerPostReportList
source: Ledger post list
fo_fo: Fíggjarbókingalisti
nb_no: Finansposteringsliste
sv_se: Finanspostlista

# Reports_DefaultName_PartnerPostReportList
source: Partner posts
fo_fo: Vinnupartnarabókingar
nb_no: Partnerposteringer
sv_se: Partnerposter

# Reports_DefaultName_PartnerSaldoReportList
source: Partner saldos
fo_fo: Vinnupartnarasalda
nb_no: Partnersaldoer
sv_se: Partnersaldon

# Reports_DefaultName_PrimoFiscalBalance
source: Primo fiscal balance
fo_fo: Byrjanarjavni
nb_no: Åpningsbalanse
sv_se: Primo balans

# xena_running_month
source: Running month
fo_fo: Verandi mánaður
nb_no: Løpende måned
sv_se: Privatperson

# Reports_DefaultName_ArticlePostReportList
source: Article post list
nb_no: Liste over vareposteringer
sv_se: Varupostlista

# Reports_DefaultName_VatSettlement
source: Vat settlement
fo_fo: MVG uppgerð
nb_no: Momsoppgjør
sv_se: Momsuppgörelse

# xena_vatsettlement
source: Vat settlement
fo_fo: MVG uppgerð
nb_no: Momsoppgjør
sv_se: Momsuppgörelse

# xena_vatsettlementadjustment
source: Vat settlement adjustment
fo_fo: MVG uppgerð, rætting
nb_no: Momsoppgjør, justering
sv_se: Momsavräkning, justering

# Localized_ContextType_ContextType_Customer
source: Sales
fo_fo: Søluordri
nb_no: Salgsordre

# Localized_ContextType_ContextType_Supplier
source: Purchase
fo_fo: Keypsordri
nb_no: Kjøpsordre

# Reports_DefaultName_FiscalBalance
source: Fiscal balance
fo_fo: Fíggjarstøða og úrslit
nb_no: Balanse

# SubscriptionInvoiceStates_Invoiced
source: Invoiced
fo_fo: Faktureraður
nb_no: Fakturert

# SubscriptionInvoiceStates_Open
source: Open
nb_no: Åpen

# SubscriptionInvoiceStates_Paid
source: Paid
fo_fo: Goldið
nb_no: Betalt

source: Article group
nb_no: Varegruppe

# BankPostingReconciliationSuggestionType_LedgerPost
source: Ledger post
nb_no: Finanspostering

# BankPostingReconciliationSuggestionType_LedgerPostPreview
source: Ledger post preview
fo_fo: Fyribilsvísing av fíggjarbókingum
nb_no: Forhåndsvisning av finansposter

# BankPostingReconciliationSuggestionType_PartnerPost
source: Partner post
fo_fo: Vinnupartnarabóking
nb_no: Partnerpostering

# Command_ElectronicInvoice
source: Electronic invoice
fo_fo: Talgildur fakturi
nb_no: Elektronisk faktura

# Command_ElectronicInvoice_Created
source: Created
fo_fo: Stovnaður
nb_no: Opprettet

# Command_ElectronicInvoice_Created_Details
source: Electronic invoice created
fo_fo: Talgildur fakturi stovnaður
nb_no: Elektronisk faktura opprettet

# Command_ElectronicInvoice_Error
source: Electronic invoice rejected
fo_fo: Talgildur fakturi avvístur
nb_no: Elektronisk faktura avvist

# Command_ElectronicInvoice_OK
source: Electronic invoice delivered (step 3 af 3)
fo_fo: Talgildur fakturi sendur og viðgjørdur
nb_no: Elektronisk faktura sendt (trinn 3 av 3)

# Command_ElectronicInvoice_Pending
source: Electronic invoice created (step 1 of 3)
fo_fo: Talgildur fakturi stovnaður (stig 1 av trimum)
nb_no: Elektronisk faktura opprettet (trinn 1 av 3)

# Command_ElectronicInvoice_SentOK
source: Electronic invoice sent (step 2 of 3)
fo_fo: Talgildur fakturi sendur (stig 2 av trimum)
nb_no: Elektronisk faktura sendt (trinn 2 av 3)

# Domain_ImportVatTransaction_Cancelation
source: {0} - cancellation
fo_fo: (ógildað)
nb_no: {0} - annullert

# Domain_Ledger_Default_Description
source: Default
nb_no: Standard

source: Fiscal period
fo_fo: Roknskaparár
nb_no: Regnskapsår

# ImportVatLineType_Customs
source: Customs
nb_no: Toll

# LedgerLineType_Default
source: Finance
fo_fo: Fíggjarmál
nb_no: Finans

# LedgerLineType_ManualPurchase
source: Manual purchase
fo_fo: Manuelt keyp
nb_no: Manuelt kjøp

# LedgerLineType_ManualSales
source: Manual sales
fo_fo: Bóka sølu
nb_no: Manuelt salg

# LedgerLineType_PartnerPayment
source: Partner payment
fo_fo: Vinnupartnaragjalding
nb_no: Partnerbetaling

# LedgerPostPreviewType_Contra
source: Contra
fo_fo: Mòtkonto
nb_no: Motkonto

# LedgerPostPreviewType_Default
source: Default
nb_no: Standard

# LedgerPostPreviewType_ManualPurchase
source: Manual purchase
fo_fo: Manuelt keyp
nb_no: Manuelt kjøp

# LedgerPostPreviewType_ManualSales
source: Manual sales
fo_fo: Bóka sølu
nb_no: Manuelt salg

source: Ledger tag
fo_fo: Konto
nb_no: Konto

# LedgerTagType_CurrencyDifference
source: Currency differences
nb_no: Valutakursdifferanse

# LedgerTagType_Default
source: Default
nb_no: Standard

# LedgerTagType_Settlement
source: Settlement
fo_fo: Gjaldskonto
nb_no: Betalingskonto

# Localized_RecipientAddressType_DKCVR
source: CVR (Denmark)
fo_fo: CVR (Danmark)
nb_no: CVR (Danmark)

# Localized_RecipientAddressType_GLN
source: GLN
fo_fo: EAN
nb_no: EAN

# Localized_RecipientAddressType_NOORGNO
source: Org.nummer (Norway)
fo_fo: V-tal (Norra)
nb_no: Org. nummer (Norge)

# Localized_RecipientAddressType_SEORGNO
source: Org.nummer (Sweden)
fo_fo: V-tal (Svøríki)
nb_no: Org. nummer (Sverige)

# Localized_Xena_InventoryStatus_InStock
source: In stock
fo_fo: Á goymslu
nb_no: På lager

# Localized_Xena_InventoryStatus_InStockOtherDepartment
source: In stock in other department
fo_fo: Á goymslu í aðrari deild
nb_no: På lager i en annen avdeling

# Localized_Xena_InventoryStatus_NotInStock
source: Not in stock
fo_fo: Ikki á goymslu
nb_no: Ikke på lager

# Localized_Xena_InventoryStatus_NotInStockButOrdered
source: Not in stock, but ordered
fo_fo: Ikki á goymslu, men er bílagt
nb_no: Ikke på lager, men er bestilt

# Localized_Xena_InventoryStatus_PartiallyInStock
source: Partially in stock
fo_fo: Partvís á goymslu
nb_no: Delvis på lager

# Localized_Xena_InventoryStatus_UnknownStatus
source: Unknown status
nb_no: Ukjent status

# Localized_Xena_InventoryStatus_Xena_InventoryStatus_NotInStockSomeOrdered
source: Not in stock, some are ordered
fo_fo: Ikki á goymslu, men er bílagt
nb_no: Ikke på lager, men noe er bestilt

# Vat
source: VAT code
fo_fo: MVG kota
nb_no: Momskode

# VatType_Default
source: Default
nb_no: Standard

# VatType_EUVat
source: EU
nb_no: Utland

# VatType_Purchasing
source: Purchasing
fo_fo: KeypsMVG
nb_no: Kjøpsmoms

# VatType_Sales
source: Sales
fo_fo: Sølumvg
nb_no: Salgsmoms

# ImportVatLineType_Vat
source: VAT
fo_fo: MVG
nb_no: Moms

# LedgerLineType_SupplierInvoice
source: Supplier invoice
fo_fo: Leverandørur
nb_no: Kreditor

# PaymentMeansType_NO_Bank_Mod_10
source: Norweigan bank account (Mod 10)
fo_fo: KID (modul 10)
nb_no: KID (modulus 10)

# PaymentMeansType_NO_Bank_Mod_11
source: Norweigan bank account (Mod 11)
fo_fo: KID (modul 11)
nb_no: KID (modulus 11)

# PaymentMeansType_Bank
source: Misc. bank account
fo_fo: Bankakonto (ymsar)
nb_no: Bankkonto (diverse)

# PaymentMeansType_Bank_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_Bank_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_Bank_Help
source: Misc. bank accounts are printed on your invoice, but not included in electonic invoicing nor codelines used for online banking. You must supply at least an account number. Is not included in electronic invoices.
fo_fo: Diverse bankkonti udskrives på fakturaer, men er ikke inkluderet i elektroniske fakturaer og der er heller ikke kodelinjer til automatisk kontonummergenkendelse.
nb_no: Diverse bankkonti utskrives på fakturaer, men er ikke inkludert i elektronisk fakturaer, og det er heller ikke kodelinjer for automatisk kontonummergjenkjenning

# PaymentMeansType_DK_Bank
source: Danish bank account
fo_fo: Bankakonto (donsk)
nb_no: Bankkonto (dansk)

# PaymentMeansType_DK_Bank_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_Bank_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_DK_Bank_Help
source: Danish bank acount that is printed on your invoice with the information you supply for direct deposits to your bank account. Is included in electronic invoices.
fo_fo: Danske bankkonti kommer med på både fysiske og elektroniske fakturaer så modtageren kan anvende den som betalingsform.
nb_no: Danske bankkonti kommer med både på fysiske og elektroniske fakturaer, slik at mottakeren kan bruke dem som betalingsform.

# PaymentMeansType_DK_FIK_71
source: Danish FIK account (Nets 71)
fo_fo: FIK 71
nb_no: FIK 71

# PaymentMeansType_DK_FIK_71_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_FIK_71_AccountLabel
source: Supplier number
fo_fo: Lev. nr.
nb_no: Lev. nr.

# PaymentMeansType_DK_FIK_71_Help
source: Danish Nets account that prints a line similar to +71<123456123456781+12345678 on your invoices. Is included in electronic invoices.
fo_fo: Dansk NETS konto som udskriver en linje i stil med +71<123456123456781+12345678 på fysiske fakturaer. Kontoen bliver også sendt med elektroniske fakturaer. Du skal taste dit leverandørnummer i konto-feltet.
nb_no: Dansk NETS konto som skriver ut en linje i stil med +71<123456123456781+12345678 på fysiske fakturaer. Kontoen blir også sendt med elektroniske fakturaer. Du skal taste leverandørnummeret ditt i kontofeltet.

# PaymentMeansType_DK_FIK_73
source: Danish FIK account (Nets 73)
fo_fo: FIK 73
nb_no: FIK 73

# PaymentMeansType_DK_FIK_73_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_FIK_73_AccountLabel
source: Supplier number
fo_fo: Lev. nr.
nb_no: Lev. nr.

# PaymentMeansType_DK_FIK_73_Help
source: Danish Nets account that prints a line similar to +73< +12345678 on your invoices. Is included in electronic invoices.
fo_fo: Dansk NETS konto som udskriver en linje i stil med +73< +12345678 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste dit leverandørnummer i konto-feltet.
nb_no: Dansk NETS konto som skriver ut en linje i stil med +73< +12345678 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste ditt leverandørnummer i kontofeltet.

# PaymentMeansType_DK_FIK_75
source: Danish FIK account (Nets 75)
fo_fo: FIK 75
nb_no: FIK 75

# PaymentMeansType_DK_FIK_75_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_FIK_75_AccountLabel
source: Supplier number
fo_fo: Lev. nr.
nb_no: Lev. nr.

# PaymentMeansType_DK_FIK_75_Help
source: Danish Nets account that prints a line similar to +75<0123456123456781+12345678 on your invoices. Is included in electronic invoices.
fo_fo: Dansk NETS konto som udskriver en linje i stil med +75<0123456123456781+12345678 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste dit leverandørnummer i konto-feltet.
nb_no: Dansk NETS konto som skriver ut en linje i stil med +75<0123456123456781+12345678 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste ditt leverandørnummer i kontofeltet.

# PaymentMeansType_DK_Giro_01
source: Danish Giro account (01)
fo_fo: Giro 01
nb_no: Giro 01

# PaymentMeansType_DK_Giro_01_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_Giro_01_AccountLabel
source: Giro number
fo_fo: Gironr.
nb_no: Gironr.

# PaymentMeansType_DK_Giro_01_Help
source: Danish Giro account that prints a line similar to +01< +1234567 on your invoices. Is included in electronic invoices.
fo_fo: Danske giro konto som udskriver en linje i stil med +01< +1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste dit gironummer i konto-feltet.
nb_no: Dansk girokonto som skriver ut en linje i stil med +01< +1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste ditt gironummer i kontofeltet.

# PaymentMeansType_DK_Giro_04
source: Danish Giro account (04)
fo_fo: Giro 04
nb_no: Giro 04

# PaymentMeansType_DK_Giro_04_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_Giro_04_AccountLabel
source: Giro number
fo_fo: Gironr.
nb_no: Gironr.
