Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Constant.*.resx
Languages: fo_fo, nb_no, sv_se

# PaymentMeansType_DK_Giro_04_Help
source: Danish Giro account that prints a line similar to +04<123456123456781+1234567 on your invoices. Is included in electronic invoices.
fo_fo: Danske giro konto som udskriver en linje i stil med +04<123456123456781+1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste dit gironummer i konto-feltet.
nb_no: Dansk girokonto som skriver ut en linje i stil med +04<123456123456781+1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste ditt gironummer i kontofeltet.

# PaymentMeansType_DK_Giro_15
source: Danish Giro account (15)
fo_fo: Giro 15
nb_no: Giro 15

# PaymentMeansType_DK_Giro_15_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_Giro_15_AccountLabel
source: Giro number
fo_fo: Gironr.
nb_no: Gironr.

# PaymentMeansType_DK_Giro_15_Help
source: Danish Giro account that prints a line similar to +15<123456123456781+1234567 on your invoices. Is included in electronic invoices.
fo_fo: Danske giro konto som udskriver en linje i stil med +15<123456123456781+1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste dit gironummer i konto-feltet.
nb_no: Dansk girokonto som skriver ut en linje i stil med +15<123456123456781+1234567 på fakturaer. Kontoen sendes også med elektroniske fakturaer. Du skal taste ditt gironummer i kontofeltet.

# PaymentMeansType_DK_NemKonto
source: Danish NemKonto
fo_fo: Nemkonto (DK)
nb_no: NemKonto (dansk)

# PaymentMeansType_DK_NemKonto_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_DK_NemKonto_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_DK_NemKonto_Help
source: Danish NemKonto is used for public entities. Is only used for electronic invoices.
fo_fo: Dansk NemKonto er brugt af offentlige myndigheder til betaling. Kan kun bruges i forbindelse med elektroniske fakturaer og kræver alene at firmaets konto er oprettet på nemkonto.dk. Du skal derfor ikke udfylde noget ud over at oprette den som betalingsmåde i Xena.
nb_no: Dansk NemKonto brukes av offentlige myndigheder til betaling. Kan kun brukes i forbindelse med elektroniske fakturaer og krever at firmaets konto er oprettet på nemkonto.dk. Du skal derfor ikke utfylle noe ut over å opprette den som betalingsmåte i Xena.

# PaymentMeansType_IBAN_Non_EU
source: IBAN (Non-EU)
fo_fo: IBAN (ei EU)
nb_no: IBAN (ikke EU)

# PaymentMeansType_IBAN_Non_EU_AccountIdentifierLabel
source: Bank identifier
fo_fo: Bankakota
nb_no: Bankkode

# PaymentMeansType_IBAN_Non_EU_AccountLabel
source: IBAN number
fo_fo: IBAN nr.
nb_no: IBAN-nr.

# PaymentMeansType_IBAN_Non_EU_Help
source: IBAN (Non-EU) is used for international deposits to your bank account and will be shown on your invoices. Is included in electronic invoices.
fo_fo: IBAN (ej EU) bruges til internationale overførsler til din bankkonto og vil blive vist på fakturaer, både fysiske og elektroniske.
nb_no: IBAN (ikke EU) brukes til internasjonale overførsler til din bankkonto og vil bli vist på fakturaer, både fysiske og elektroniske.

# PaymentMeansType_IBAN_SWIFT_AccountLabel
source: IBAN number
fo_fo: IBAN nr.
nb_no: IBAN-nr.

# PaymentMeansType_IBAN_SWIFT_Help
source: IBAN/SWIFT account is used for international EU deposits to your bank account and will be shown on your invoices. Is included in electronic invoices.
fo_fo: IBAN/SWIFT bruges til internationale overførsler til din bankkonto og vil blive vist på fakturaer, både fysiske og elektroniske.
nb_no: IBAN/SWIFT brukes til internasjonale overførsler til din bankkonto og vil bli vist på fakturaer, både fysiske og elektroniske.

# PaymentMeansType_NO_Bank
source: Norweigan bank account
fo_fo: Norsk bankakonto
nb_no: Norsk bankkonto

# PaymentMeansType_NO_Bank_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_NO_Bank_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_NO_Bank_Help
source: Norweigan bank account that is printed on your invoice with the information you supply for direct inserts on your bank account. Is not included in electronic invoices.
fo_fo: Norske bankkonti udskrives på fakturaer som betalingsform. Anvendes også på elektroniske fakturaer.
nb_no: Norske bankkonti utskrives på fakturaer som betalingsform. Brukes også på elektroniske fakturaer.

# PaymentMeansType_NO_Bank_Mod_10_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_NO_Bank_Mod_10_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_NO_Bank_Mod_10_Help
source: Norweigan bank account that is printed as a code line on your invoice using modulus 10. Ask your bank for information whether your bank account should use Modulus 10 or 11, if in doubt. Is not included in electronic invoices.
fo_fo: Norsk bankkonto som skrives på fakturaer med modulus10. Spørg din bank hvorvidt du skal anvendes modulus 10 eller 11 ved tvivlsspørgsmål. Denne inkluderes ikke i elektroniske fakturaer.
nb_no: Norsk bankkonto som skrives på fakturaer med modulus10. Spør banken din om du skal anvende modulus 10 eller 11 dersom du er usikker. Dette er ikke med på elektroniske fakturaer.

# PaymentMeansType_NO_Bank_Mod_11_AccountIdentifierLabel
source: Account identitifer
fo_fo: Skrás.nr.
nb_no: Reg. nr.

# PaymentMeansType_NO_Bank_Mod_11_AccountLabel
source: Account
fo_fo: Konto
nb_no: Konto

# PaymentMeansType_NO_Bank_Mod_11_Help
source: Norweigan bank account that is printed as a code line on your invoice using modulus 11. Ask your bank for information whether your bank account should use Modulus 10 or 11, if in doubt. Is not included in electronic invoices.
fo_fo: Norsk bankkonto som skrives på fakturaer med modulus11. Spørg din bank hvorvidt du skal anvendes modulus 10 eller 11 ved tvivlsspørgsmål. Denne inkluderes ikke i elektroniske fakturaer.
nb_no: Norsk bankkonto som skrives på fakturaer med modulus11. Spør banken din om du skal anvende modulus 10 eller 11 dersom du er usikker. Dette er ikke med på elektroniske fakturaer.

# Reports_DefaultName_ArticleStockReportList
source: Article stock
fo_fo: Goymsluvirðislisti
nb_no: Lagerverdiliste

# XenaApp_Category_CreditRating
source: Credit rating
fo_fo: Meting
nb_no: Kredittvurdering

# XenaApp_Category_Maps
source: Maps
fo_fo: Kort
nb_no: Kart

# XenaApp_Category_Misc
source: Miscellaneous
fo_fo: Ymiskt
nb_no: Diverse

# XenaApp_Category_Reporting
source: Reporting
nb_no: Rapportering

# XenaApp_PluginPlacement_MainMenu_Finance
source: Finance
fo_fo: Fíggjarmál
nb_no: Finans

# XenaApp_PluginPlacement_MainMenu_FiscalSetup
source: Fiscal setup
fo_fo: Fyritøkuuppseting
nb_no: Firmaoppsetning

# XenaApp_PluginPlacement_MainMenu_Purchasing
source: Purchasing
fo_fo: Keyp
nb_no: Kjøp

# XenaApp_PluginPlacement_MainMenu_Reports
source: Reports
fo_fo: Útskriftir
nb_no: Rapporter

# XenaApp_PluginPlacement_MainMenu_Sales
source: Sales
fo_fo: Søla
nb_no: Salg

# XenaApp_PluginPlacement_MainMenu_Setup
source: Setup
fo_fo: Uppseting
nb_no: Oppsett

# XenaApp_PluginPlacement_Tab_Contact
source: Contact tab
fo_fo: Samband spjaldur
nb_no: Kontakter fane

# XenaApp_PluginPlacement_Tab_Details
source: Details tab
fo_fo: Útgreiningaspjaldur
nb_no: Detaljer fane

# XenaApp_PluginPlacement_Tab_Main
source: Main tab
fo_fo: Høvuðsskiljiblað
nb_no: Hovedfane

# XenaApp_PluginPlacement_Tab_Setup
source: Setup tab
fo_fo: Uppseting
nb_no: Oppsett-fane

# XenaApp_PluginPlacement_Tab_Statistics
source: Statistics tab
nb_no: Statistikk-fane

# XenaApp_PluginPlacement_Widget
source: Widget
nb_no: Widget-boks

# XenaApp_PluginType_ArticleDetails
source: Article details
nb_no: Varedetaljer

# XenaApp_PluginType_ArticleOverview
source: Article overview
fo_fo: Vøruyvirlit
nb_no: Vareoversikt

# XenaApp_PluginType_MainMenuItem
source: Main menu
fo_fo: Høvuðsvalmynd
nb_no: Hovedmeny

# XenaApp_PluginType_OrderDetails
source: Order details
fo_fo: Ordraútgreining
nb_no: Ordredetaljer

# XenaApp_PluginType_OrderOverview
source: Order overview
fo_fo: Ordrayvirlit
nb_no: Ordreoversikt

# XenaApp_PluginType_PartnerDetails
source: Partner details
fo_fo: Vinnupartnaraútgreining
nb_no: Partnerdetaljer

# XenaApp_PluginType_PartnerOverview
source: Partner overview
fo_fo: Vinnupartnarayvirlit
nb_no: Partneroversikt

# XenaApp_PluginType_SubscriptionDetails
source: Subscription details
fo_fo: Haldslýsing
nb_no: Abonnementsdetaljer

# XenaApp_PluginType_SubscriptionOverview
source: Subscription overview
fo_fo: Yvirlit høld
nb_no: Abonnementsoversikt

# XenaApp_Visibility_Private
source: Private
fo_fo: Privat
nb_no: Privat

# XenaApp_Visibility_Public
source: Public
fo_fo: Almenn
nb_no: Offentlig

# Localized_UserGroup_AccountantAdmin
source: Accountant administrator
fo_fo: Grannskoðarafyrisitari
nb_no: Revisor administrator

# Localized_UserGroup_AccountantBookkeeper
source: Accountant bookkeeper
fo_fo: Grannskoðarabókhaldari
nb_no: Revisor regnskapsfører

# Reports_DefaultName_FiscalBalanceAccountant
source: Fiscal balance for accountant
fo_fo: Grannskoðarajavni
nb_no: Revisorbalanse

# Reports_DefaultName_LedgerJournal
source: Ledger journal
fo_fo: kladdajournal
nb_no: Kladdejournal

# Reports_DefaultName_PartnerSaldoAgeReportList
source: Partner saldos age-distributed
fo_fo: Vinnupartnarasalda, aldursbýtt
nb_no: Partnersaldo aldersfordelt

# XenaApp_Visibility_Internal
source: Internal
fo_fo: Innanhýsis
nb_no: Intern

# XenaApp_PluginType_FiscalSetupUserMemberships
source: User memberships
fo_fo: brúkarar
nb_no: Brukere

# Delivery_Cancelled
source: (Cancelled)
fo_fo: (Ógildað)
nb_no: (Annulert)

source: Customer email
fo_fo: Kundateldupostadressa
nb_no: Kundens e-post

# DataImport_FromBillysBilling
source: Import data from Billys Billing
fo_fo: Flyt inn data frá Billys billing
nb_no: Importer data fra Billys Billing

# DataImport_FromC5
source: Import from C5
fo_fo: Flyt inn frá C5
nb_no: Importer fra C5

# DataImport_FromEconomic
source: Import data from e-conomic
fo_fo: Flyt inn data frá e-conomic
nb_no: Importer data fra e-conomic

# DataImport_Manually
source: Import data manually
fo_fo: Flyt inn data manuelt
nb_no: Importer data manuelt

# EUType_Goods
source: Goods
nb_no: Varer

# EUType_None
source: None
fo_fo: Eingin
nb_no: Ingen

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_AllInStock
source: All in stock
fo_fo: Alt á goymslu
nb_no: Alt på lager

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_BarredForDelivery
source: Barred for delivery
nb_no: Sperret for levering

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_CannotDeliver
source: Cannot deliver
fo_fo: Kann ikki leverast
nb_no: Kan ikke leveres

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_Delivered
source: Delivered
fo_fo: Leverað
nb_no: Levert

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_NotApplicable
source: Not applicable
fo_fo: Ikki nýtandi
nb_no: Ikke aktuell

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_NothingInStock
source: Nothing in stock
nb_no: Ingenting på lager

# Localized_LedgerBookkeepingStatus_BankReconciliation_Inserted
source: Bank reconciliation inserted
fo_fo: Bankaavstemman sett inn
nb_no: Bankavstemming satt inn

# Localized_LedgerBookkeepingStatus_Cancelled
source: Cancelled
fo_fo: Ógildað
nb_no: Annullert

# Localized_LedgerBookkeepingStatus_Completed
source: Completed
fo_fo: Liðugur
nb_no: Fullført

# Localized_LedgerBookkeepingStatus_Documents_Moved_To_Vouchers
source: Documents moved to vouchers
fo_fo: Skjøl flutt til fylgisskjøl
nb_no: Dokumenter flyttet til bilag

# Localized_LedgerBookkeepingStatus_History_Inserted
source: History inserted
fo_fo: Søga innsett
nb_no: Historikk satt inn

# Localized_LedgerBookkeepingStatus_Started
source: Bookkeeping started
fo_fo: Bóking byrjað
nb_no: Bokføring startet

# Localized_Theme_Blue
source: Blue
fo_fo: Bláur
nb_no: Blå

# Localized_Theme_Coffee
source: Coffee
fo_fo: Kaffi
nb_no: Kaffe

# Localized_Theme_Dark
source: Dark
fo_fo: Myrkur
nb_no: Mørk

# Localized_Theme_Dusty
source: Dusty
nb_no: Støvete

# Localized_Theme_LightYellow
source: Light yellow
fo_fo: Ljós gul
nb_no: Lysegul

# Localized_Theme_MintGreen
source: Mint green
fo_fo: Mint grønur
nb_no: Mintgrønn

# Localized_Theme_NaviBlue
source: Navi blue
fo_fo: Marinebláur
nb_no: Marineblå

# Localized_Theme_OceanBlue
source: Ocean blue
fo_fo: Sjóbláur
nb_no: Havblå

# Reports_DefaultName_EUSalesVatFree
source: EU sales without VAT
nb_no: Utlandssalg uten moms

# StockCountFriendlyData_ArticleDescription_Translated
source: Article description
nb_no: Varebeskrivelse

# StockCountFriendlyData_ArticleNumber_Translated
source: Article number
nb_no: Varenummer

# StockCountFriendlyData_ArticleVariantAbbreviation_Translated
source: Article variant
nb_no: Variant

# StockCountFriendlyData_Location_Translated
source: Location
fo_fo: Staðseting
nb_no: Plassering

# VatType_EUVat_Goods
source: EU - goods
nb_no: Utland - Varer

# VatType_EUVat_Services
source: EU - services (reverse charge)
nb_no: Utland - Tjenester

# xena_importtasktype_articlegroupimport
source: Article group import
nb_no: Varegruppe import

# xena_importtasktype_articleimport
source: Article import
nb_no: Vareimport

# xena_importtasktype_customerimport
source: Customer import
fo_fo: Kundainnflyting
nb_no: Kundeimport

# xena_importtasktype_fiscalyearimport
source: Fiscal year import
fo_fo: Roknskaparár innflyting
nb_no: Regnskapsår import

# xena_importtasktype_ledgerimport
source: General ledger import
fo_fo: Innflutningur av kontoskipan
nb_no: Import av kontoplan

# xena_importtasktype_postingimport
source: Ledger posting import
fo_fo: Innflutningu av fíggjarbókingum
nb_no: Finansimport

# xena_onestop_vatsettlement
source: One-Stop VAT settlement
fo_fo: One-stop MVG avrokning
nb_no: One-Stop momsavregning

# xena_onestop_vatsettlementadjustment
source: One-Stop VAT settlement adjustment
fo_fo: One-stop MVG rætting
nb_no: One-Stop momsjustering

# XenaApp_PluginType_HomeIndex
source: My Disktop
fo_fo: Mítt skriviborð
nb_no: Mitt skrivebord

# EUType_Services
source: Services
nb_no: Tjenester

# Localized_DeliveryStatus_SalesOrderDeliveryStatus_SomeInStock
source: Some in stock
fo_fo: Partvís á goymslu
nb_no: Delvis på lager

# Localized_DueType_xena_prepaid
source: Pre-paid
fo_fo: Goldið frammanundan
nb_no: Forskuddsbetalt

# Localized_LedgerBookkeepingStatus_Saving_Settlements
source: Saving settlements
nb_no: Lagre utligninger

# Localized_LedgerBookkeepingStatus_Saving_Transaction
source: Saving transaction
nb_no: Lagre transaksjoner

# Localized_LedgerBookkeepingStatus_Transactions_Created
source: Transactions created
nb_no: Transaksjoner opprettet

# Localized_LedgerBookkeepingStatus_Transactions_Validated
source: Transactions validated
nb_no: Transaksjoner validert

# Localized_LedgerBookkeepingStatus_Transactions_Validation_Failed
source: Validations failed
nb_no: Validering mislyktes

# Localized_Theme_Pink
source: Pink
nb_no: Rosa

# Localized_Theme_Prikly
source: Prikly
fo_fo: Reyðvín
nb_no: Rødvin

# Localized_Theme_Purple
source: Purple
fo_fo: Lilla
nb_no: Lilla

# Localized_Theme_Rusty
source: Rusty
fo_fo: Rustreyður
nb_no: Rust

# Localized_Theme_Salmon
source: Salmon
fo_fo: Laksur
nb_no: Laks

# Localized_Theme_Yellow
source: Yellow
fo_fo: Gulur
nb_no: Gul

# Localized_UserGroup_Pending
source: Pending
fo_fo: Viðgerast
nb_no: Avventer

# Reports_DefaultName_OrderPickList
source: Pick list
nb_no: Plukkliste

# Reports_DefaultName_VatSettlement_OneStop
source: Vat settlement (One Stop VAT)
fo_fo: MVG avrokning (One stop-moms)
nb_no: Momsavregning (One stop-moms)

# StockCountFriendlyData_Quantity_Translated
source: Quantity, in stock
fo_fo: Nøgd, á goymslu
nb_no: Antall, på lager

# StockCountFriendlyData_QuantityCounted_Translated
source: Quantity, counted
fo_fo: Upptalt
nb_no: Antall, talt

# StockCountFriendlyData_QuantityReserved_Translated
source: Quantity, reserved
fo_fo: Nøgd, bílagt
nb_no: Antall, reservert

source: Supplier email
fo_fo: Teldupostur hjá leverandøri
nb_no: Leverandørs e-post

source: Voucher:
fo_fo: Fylgiskjal:
nb_no: Bilag:

# xena_importtasktype_supplierimport
source: Supplier import
fo_fo: Innflyta leverandørar
nb_no: Leverandørimport

# Localized_UserGroup_AccountantClientAccess
source: Client access
fo_fo: klientur atgongd
nb_no: Klienttilgang

# Domain_Payment
source: Payment
fo_fo: Gjalding
nb_no: Betaling

# Localized_PartnerContextType_All
source: All
fo_fo: Øll
nb_no: Alle

# Localized_PartnerContextType_Customer
source: Customer
fo_fo: Kundi
nb_no: Kunde

# Localized_PartnerContextType_Resource
source: Resource
fo_fo: Starvsfólk
nb_no: Medarbeider

# Localized_PartnerContextType_Supplier
source: Supplier
fo_fo: Leverandørur
nb_no: Leverandør

# XenaApp_PluginType_AppDetails
source: App details
fo_fo: App útgreining
nb_no: App-detaljer

# XenaApp_PluginType_DevDetails
source: Developer details
nb_no: Utviklerdetaljer

# XenaApp_PluginType_DevIndex
source: Developer index
nb_no: Utvikleroversikt

# Xena_Domain_Income_Accounts_Production_Costs
source: Production costs
fo_fo: Framleiðslukostnaður
nb_no: Produksjonsomkostninger

# XenaApp_PluginType_LedgerTagDetails
source: Ledgertag details
fo_fo: Fíggjarkonto útgreining
nb_no: Finanskontodetaljer

# XenaApp_Category_Webshop
source: Webshop
fo_fo: Nethandil
nb_no: Nettbutikk

# Reports_DefaultName_PriceAgreementReportList
source: Price agremeent list
fo_fo: Prísavtalulisti
nb_no: Prisavtaleliste

# VATFree
source: VAT exempt
fo_fo: MVG fríur
nb_no: Momsfri

source: VAT taxable
fo_fo: MVG skyldigur
nb_no: Momspliktig

# WithoutVAT
source: - VAT free
nb_no: - Momsfri

# Domain_ReportEmailSetup_OrderConfirmation_DefaultBody
source: Enclosed as PDF is the agreed confirmation.
nb_no: Sender som avtalt ordrebekreftelsen (vedlagt som PDF).

source: - with VAT
nb_no: - med moms

# Domain_ReportEmailSetup_OrderConfirmation_DefaultSubject
source: Confirmation
fo_fo: Ordraváttan
nb_no: Ordrebekreftelse

# Domain_ReportEmailSetup_OrderDelivery_DefaultBody
source: Enclosed as PDF is the agreed delivery note.
nb_no: Vedlagt finner du følgeseddelen.

# LocationType_Default
source: Default
nb_no: Standard

# Reports_DefaultName_ArticleGroupStatisticReportList
source: Article group margin list
nb_no: Varegruppe dekningsgrad

# Domain_ReportEmailSetup_OrderDelivery_DefaultSubject
source: Delivery
fo_fo: Fylgiseðil
nb_no: Følgeseddel

# Reports_DefaultName_ArticleMarginReportList
source: Article margins
nb_no: Varemargin

# Domain_ReportEmailSetup_OrderInvoice_DefaultBody
source: Enclosed as PDF is the agreed invoice.
nb_no: Vedlagt finner du fakturaen, som avtalt.

# Domain_ReportEmailSetup_OrderInvoice_DefaultSubject
source: Invoice
fo_fo: Fakturi
nb_no: Faktura

# Reports_DefaultName_HistoricStockValueReportList
source: Historic stock value
nb_no: Historisk lagerverdi

# Reports_DefaultName_LedgerTagStatisticReportList
source: Ledger tag statistcis
nb_no: Finanskonto statistikk

# Domain_ReportEmailSetup_OrderOffer_DefaultBody
source: Enclosed as PDF is the agreed offer.
nb_no: Sender som avtalt tilbudet.

# Domain_ReportEmailSetup_OrderOffer_DefaultSubject
source: Offer
nb_no: Tilbud

# XenaApp_PluginType_ArticleGroupDetails
source: Article group details
nb_no: Varegruppe-detaljer

# LocationType_Temporary
source: Temporary
nb_no: Midlertidig

# Reports_DefaultName_PartnerStatisticReportList
source: Partner statistics
fo_fo: Vinnupartnarahagtøl
nb_no: Partnerstatistikk

# XenaApp_PluginPlacement_MainMenu_Stock
source: Stock
nb_no: Lager

# Localized_IdentityType_AliasIdentification
source: Alias
fo_fo: Dulnevni

# Localized_UserGroup_Bank
source: Bank
fo_fo: Banki

# VatType_Import
source: Import
fo_fo: Innflutningur

# XenaApp_PluginPlacement_MainMenu_AppStore
source: App store
fo_fo: App handil

# XenaApp_PluginType_SetupApp
source: App setup
fo_fo: App uppseting

# Localized_Entity_Partner
source: Partner
fo_fo: Vinnupartnari

source: Partner
fo_fo: Vinnupartnari

# BankPostingReconciliationSuggestionType_PartnerSaldo
source: Partner saldo
fo_fo: Vinnupartnarasalda
