Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Currencies.*.resx
Languages: fo_fo

# Localized_Currency_AFN
source: Afghani
fo_fo: Afganskur

# Localized_Currency_ALL
source: Albanian Lek
fo_fo: Albansk lek

# Localized_Currency_DZD
source: Algerian Dinar
fo_fo: Algerisk dinar

# Localized_Currency_ARS
source: Argentine Peso
fo_fo: Argentinsk peso

# Localized_Currency_AMD
source: Armenian Dram
fo_fo: Armensk dram

# Localized_Currency_AUD
source: Australian Dollar
fo_fo: Avstralskur dollari

# Localized_Currency_AZN
source: Azerbaijanian Manat
fo_fo: Aserbadjanskur dollari

# Localized_Currency_BDT
source: Bangladeshi Taka
fo_fo: Bangladesj Taka

# Localized_Currency_BHD
source: Bahraini Dinar
fo_fo: Barainsk dinar

# Localized_Currency_BZD
source: Belize Dollar
fo_fo: Belisiskur dollari

# Localized_Currency_BGN
source: Bulgarian Lev
fo_fo: Bulgarsk lev

# Localized_Currency_BND
source: Brunei Dollar
fo_fo: Bruneiskur dollari

# Localized_Currency_CAD
source: Canadian Dollar
fo_fo: Kanadiskur dollari

# Localized_Currency_CLP
source: Chilean Peso
fo_fo: Kilensk peso

# Localized_Currency_COP
source: Colombian Peso
fo_fo: Kolumbiansk peso

# Localized_Currency_CRC
source: Costa Rican Colon
fo_fo: Kosta Rika kolon

# Localized_Currency_DKK
source: Danish Krone
fo_fo: Donsk króna

# Localized_Currency_DOP
source: Dominican Peso
fo_fo: Dominikansk peso

# Localized_Currency_GBP
source: UK Pound Sterling
fo_fo: Bretsk pund

# Localized_Currency_EGP
source: Egyptian Pound
fo_fo: Egyptisk pund

# Localized_Currency_EEK
source: Estonian Kroon
fo_fo: Estiskur króni

# Localized_Currency_ETB
source: Ethiopian Birr
fo_fo: Etiopiskur birr

# Localized_Currency_EUR
source: Euro
fo_fo: Evra

# Localized_Currency_PHP
source: Philippine Peso
fo_fo: Filipsoyskur peso

# Localized_Currency_GTQ
source: Guatemalan Quetzal
fo_fo: Guatemalskur quetzal

# Localized_Currency_BYR
source: Belarusian Ruble
fo_fo: Hvítarussibkur rublar

# Localized_Currency_HKD
source: Hong Kong Dollar
fo_fo: Hong kong dollari

# Localized_Currency_HNL
source: Honduran Lempira
fo_fo: Hondursk lempira

# Localized_Currency_IDR
source: Indonesian Rupiah
fo_fo: Indonesiskur rupia

# Localized_Currency_INR
source: Indian Rupee
fo_fo: Indiskur rupi

# Localized_Currency_ISK
source: Icelandic Krona
fo_fo: Íslandskar krónur

# Localized_Currency_ILS
source: Israeli New Shekel
fo_fo: Nýggj israelsk sekul

# Localized_Currency_IQD
source: Iraqi Dinar
fo_fo: Irakisk dinar

# Localized_Currency_IRR
source: Iranian Rial
fo_fo: Iransk rial

# Localized_Currency_JMD
source: Jamaican Dollar
fo_fo: Jamaikiskur dollari

# Localized_Currency_JPY
source: Japanese Yen
fo_fo: Japansk yen

# Localized_Currency_CNY
source: PRC Renminbi
fo_fo: Kinesisk renminbi

# Localized_Currency_KES
source: Kenyan Shilling
fo_fo: Kenjisk shilling

# Localized_Currency_BAM
source: Convertible Marks
fo_fo: Konvertible Mærker

# Localized_Currency_HRK
source: Croatian Kuna
fo_fo: Kroatisk kuna

# Localized_Currency_KRW
source: Korean Won
fo_fo: Koreiskur won

# Localized_Currency_KWD
source: Kuwaiti Dinar
fo_fo: Kuvaitisk dinar

# Localized_Currency_LVL
source: Latvian Lats
fo_fo: Lettlendsk latts

# Localized_Currency_LBP
source: Lebanese Pound
fo_fo: Libansk pund

# Localized_Currency_LTL
source: Lithuanian Litas
fo_fo: Litavsk litas

# Localized_Currency_LYD
source: Libyan Dinar
fo_fo: Libysk dinar

# Localized_Currency_MKD
source: Macedonian Denar
fo_fo: Makedónsk denar

# Localized_Currency_MOP
source: Macao Pataca
fo_fo: Macao pacata

# Localized_Currency_MYR
source: Malaysian Ringgit
fo_fo: Malaisisk ringgit

# Localized_Currency_MAD
source: Moroccan Dirham
fo_fo: Marokkansk dirham

# Localized_Currency_MXN
source: Mexican Peso
fo_fo: Meksikanskur peso

# Localized_Currency_NIO1
source: Nicaraguan Cordoba Oro
fo_fo: Nikaraguriskur cordoba oro

# Localized_Currency_NPR
source: Nepalese Rupees
fo_fo: Nepalsk rupi

# Localized_Currency_NZD
source: New Zealand Dollar
fo_fo: Nýsælendskur dollari

# Localized_Currency_TWD
source: New Taiwan Dollar
fo_fo: Nýggjur taivanskur dollari

# Localized_Currency_NIO
source: Nigerian Naira
fo_fo: Nigeriansk naira

# Localized_Currency_NOK
source: Norwegian Krone
fo_fo: Norskur króni

# Localized_Currency_OMR
source: Omani Rial
fo_fo: Omansk rial

# Localized_Currency_PAB
source: Panamanian Balboa
fo_fo: Panamansk balboa

# Localized_Currency_PKR
source: Pakistan Rupee
fo_fo: Pakistanskur rupi

# Localized_Currency_PYG
source: Paraguay Guarani
fo_fo: Paraguaiskur guarani

# Localized_Currency_CHF
source: Swiss Franc
fo_fo: Sveisisk franc

# Localized_Currency_CHF1
source: Swiss Franc
fo_fo: Sveisisk franc

# Localized_Currency_PEN
source: Peruvian Nuevo Sol
fo_fo: Peruansk nuevo sol

# Localized_Currency_PLN
source: Polish Zloty
fo_fo: Polskur zloty

# Localized_Currency_QAR
source: Qatari Rial
fo_fo: Katarsk rial

# Localized_Currency_RON
source: Romanian Leu
fo_fo: Rumensk leu

# Localized_Currency_RUB
source: Russian Ruble
fo_fo: Russisk rubel

# Localized_Currency_RWF
source: Rwandan Franc
fo_fo: Ruandiskur franc

# Localized_Currency_SAR
source: Saudi Riyal
fo_fo: Saudisk riyal

# Localized_Currency_TJS
source: Ruble
fo_fo: Rubel

# Localized_Currency_UYU
source: Peso Uruguayo
fo_fo: Uruguaiskur peso
