Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/DummyData.*.resx
Languages: fo_fo, nb_no

# DummyData_ArticleGroup_Description
source: Article group {0}
nb_no: Varegruppe {0}

# DummyData_ArticleGroup_Description_First
source: First article group
fo_fo: Fyrsta vørubólkur
nb_no: Første varegruppe

# DummyData_ArticleGroup_Description_Second
source: Second article group
fo_fo: Annar vørubólkur
nb_no: Annen varegruppe

# DummyData_BankDebt
source: Bank debt
fo_fo: Bankaskuld
nb_no: Bankgjeld

# DummyData_BankDebt_First
source: Bank account #1
fo_fo: Bankakonto 1
nb_no: Bankkonto 1

# DummyData_BankDebt_Second
source: Bank account #2
fo_fo: Bankakonto 2
nb_no: Bankkonto 2

# DummyData_Bonds
source: Bonds
fo_fo: Skuldarbræv
nb_no: Obligasjoner

# DummyData_Brochures
source: Brochures
fo_fo: Bóklingar
nb_no: Brosjyrer

# DummyData_Cars
source: Cars
fo_fo: Bilar
nb_no: Biler

# DummyData_Department_Administration
source: Administration dept.
fo_fo: Fyrisitingardeild
nb_no: Administrativ avd.

# DummyData_Depreciation
source: Depreciation
fo_fo: Avskriving
nb_no: Avskrivning

# DummyData_Electricity
source: Electricity
fo_fo: El
nb_no: El

# DummyData_Electricity_Tax
source: Electricity tax
fo_fo: El avgjald
nb_no: El-avgift

# DummyData_Employees
source: Employees
fo_fo: Starvsfólk
nb_no: Ansatte

# DummyData_Heating
source: Heating
nb_no: Varme

# DummyData_Lawyers
source: Lawyers
fo_fo: Advokatar
nb_no: Advokater

# DummyData_LedgerTag_Accounting
source: Accounting
fo_fo: Grannskoðari
nb_no: Revisor

# DummyData_Location_Dimension1
source: Shelf #1
fo_fo: Hylla 1
nb_no: Hylle 1

# DummyData_Location_Dimension1_Row1
source: Row 1
fo_fo: Rað 1
nb_no: Rekke 1

# DummyData_Location_Dimension1_Row8
source: Row 8
fo_fo: Rað 8
nb_no: Rekke 8

# DummyData_Location_Dimension1_Section2
source: Section 2
fo_fo: Partur 2
nb_no: Seksjon 2

# DummyData_Location_Dimension1_Section3
source: Section 3
fo_fo: Partur 3
nb_no: Seksjon 3

# DummyData_Location_Dimension1_Shelf1
source: Shelf 1
fo_fo: Hylla 1
nb_no: Hylle 1

# DummyData_Location_Dimension1_Shelf3
source: Shelf 3
fo_fo: Hylla 3
nb_no: Hylle 3

# DummyData_Machinery
source: Machinery
fo_fo: Maskinur
nb_no: Maskiner

# DummyData_Manual_Consumption
source: Manual consumption
fo_fo: Manuelt forbrúk
nb_no: Manuelt forbruk

# DummyData_Manual_Sales
source: Manual sales
fo_fo: Boka sølu
nb_no: Manuelt salg

# DummyData_OccasionalVAT
source: Occasional VAT
fo_fo: Manuelt MVG
nb_no: Manuell moms

# DummyData_OfficeSupplies
source: Office supplies
fo_fo: Skrivstovulutir
nb_no: Kontorartikler

# DummyData_Order_DeliveryAddress_City
source: Aalborg
nb_no: Oslo

# DummyData_Order_DeliveryAddress_Name
source: Delivery plant # 2
fo_fo: Leveringsadressa 2
nb_no: Leveringsadresse 2

# DummyData_Order_DeliveryAddress_PlaceName
source: Delivery place
fo_fo: Leveringsstað 1
nb_no: Leveringssted 1

# DummyData_Order_DeliveryAddress_Street
source: Delivery street 23
fo_fo: Leveringsgate 23
nb_no: Leveringsgate 23

# DummyData_Order_DeliveryAddress_Zip
source: DK-9000
nb_no: NO-0921

# DummyData_Order_InvoiceEmail
source: invoice@test.com
fo_fo: fakturi@test.fo
nb_no: faktura@test.no

# DummyData_Order_OurReference
source: 342234 (our reference)
fo_fo: 342234 (okkara tilv.)
nb_no: 342234 (vår ref.)

# DummyData_Order_YourReference
source: 6654-FA (your reference)
fo_fo: 6654-FA (tykkara tilv.)
nb_no: 6654-FA (deres ref.)

# DummyData_OrderTask_First_Description
source: First order task description
fo_fo: Fyrsta uppgávulýsing
nb_no: Første oppgavebeskrivelse

# DummyData_OrderTask_First_Details
source: First order task details First order task - second line details
fo_fo: Fyrsta ordrauppgávutekstur Fyrsti uppgáva, linja 2
nb_no: Første ordreoppgave-tekst Første ordreoppgave, linje 2

# DummyData_OrderTask_Second_Description
source: Second order task description
fo_fo: Onnur ordrauppgávulýsing
nb_no: Annen oppgavebeskrivelse

# DummyData_OrderTask_Second_Details
source: First order task details First order task - second line details
fo_fo: Onnur ordrauppgáva, tekst Onnur ordrauppgáva, linja tvey
nb_no: Andre ordreoppgave-tekst Andre oppgave, linje 2

# DummyData_Partner_Attention
source: The person in charge
fo_fo: Stjórin
nb_no: Sjefen

# DummyData_Partner_City
source: Århus C
fo_fo: Tórshavn
nb_no: Bergen

# DummyData_Partner_First
source: SuperSchnell Ltd.
nb_no: Virksomhet AS

# DummyData_Partner_Fourth
source: Some private consumer
nb_no: Tilfeldig kunde

# DummyData_Partner_Name
source: SuperSchnell A/S
nb_no: Virksomhet AS

# DummyData_Partner_Note
source: Partner note
fo_fo: Vinnupartnaraupprit
nb_no: Partnernotat

# DummyData_Partner_OrgNumber
source: DK-12345678
nb_no: NO-12345678

# DummyData_Partner_PhoneNumber
source: Main phone
fo_fo: Høvuðsnummar
nb_no: Hovednummer

# DummyData_Partner_PlaceName
source: Invoicing place name
fo_fo: Fakturastað
nb_no: Fakturasted

# DummyData_Partner_Second
source: A company Ltd.
fo_fo: Fyritøkan A/S
nb_no: Butikken AS

# DummyData_Partner_Street
source: Invoicing street 14
fo_fo: Fakturagøta 14
nb_no: Fakturagate 14

# DummyData_Partner_Third
source: Mom and Pop's store
fo_fo: Blómuhandilin pf.
nb_no: Blomster AS

# DummyData_Partner_Zip
source: DK-8000
nb_no: NO-5003

# DummyData_Pensions
source: Pensions
fo_fo: Pensjónir
nb_no: Pensjoner

# DummyData_ReminderStep_Description
source: Reminder step 1
fo_fo: Gjaldsáminning 1
nb_no: Betalingspåminnelse 1

# DummyData_Rent
source: Rent
fo_fo: Húsaleiga
nb_no: Husleie

# DummyData_Rented_Officeequipment
source: Rented officeequipment
fo_fo: Leiga innbúgv
nb_no: Leie av inventar

# DummyData_Rented_Suppliers
source: Suppliers
fo_fo: Leverandørar
nb_no: Leverandører

# DummyData_Representation
source: Representation
fo_fo: Umboð
nb_no: Representasjon

# DummyData_ShortDebt_Pensions
source: Pensions
fo_fo: Pensjónir
nb_no: Pensjoner

# DummyData_ShortDebt_Taxes
source: Taxes
nb_no: Skatt

# DummyData_Stamps
source: Stamps
fo_fo: Frímerkir
nb_no: Frimerker

# DummyData_Stocks
source: Stocks
fo_fo: Partabrøv
nb_no: Aksjer

# DummyData_Telephone
source: Telephone
nb_no: Telefon

# DummyData_Unit_Pcs_Abbreviation
source: Pcs
nb_no: Stk.

# DummyData_Unit_Pcs_Description
source: Pieces
nb_no: Stykk

# DummyData_Unit_Ton_Description
source: Tonnes
nb_no: Tonn

# DummyData_Vat_Ingoing_Description
source: Ingoing VAT
nb_no: Inngående moms

# DummyData_VAT_Manual
source: Manual VAT
fo_fo: Manuelt MVG
nb_no: Manuell moms

# DummyData_Vat_Outgoing_Description
source: Vat outgoing
nb_no: Utgående moms

# DummyData_VatSpecification_Company
source: Xena Ltd.
nb_no: Fabrikken AS

# DummyData_Voucher_Description
source: Voucher description
fo_fo: Fylgiskjalslýsing
nb_no: Bilagsbeskrivelse

# DummyData_Wages
source: Wages
fo_fo: Lønir
nb_no: Lønninger

# DummyData_Warehouse_Description
source: Inventory location #1
fo_fo: Goymslustað 1
nb_no: Lager 1

# DummyData_Warehouse_Dimension1
source: Row
fo_fo: Rað
nb_no: Rekke

# DummyData_Warehouse_Dimension2
source: Shelf
fo_fo: Hylla
nb_no: Hylle

# DummyData_Accounting
source: Accounting
fo_fo: Grannskoðari
nb_no: Revisor

# DummyData_Accounting_SetAside
source: Accountant, Set aside
fo_fo: Grannskoðari, avsett
nb_no: Revisor, avsatt

# DummyData_Accounting_SpecialAssignment
source: Accountant, special assignment
fo_fo: Grannskoðari, seruppgáva
nb_no: Revisor, spesialoppgave

# DummyData_Accrual
source: Accrual
fo_fo: Tíðaravmarking
nb_no: Periodeavgrensningsposter

# DummyData_Article_First_Description
source: Article description 1
nb_no: Varebeskrivelse 1

# DummyData_Article_Second_Description
source: Article description 2
nb_no: Varebeskrivelse 2

# DummyData_Article_Stock_Descríption
source: Bolts
nb_no: Skruer

# DummyData_Advertising
source: Advertising
fo_fo: Lýsing
nb_no: Reklame

# DummyData_Article_SweatShirt_Descríption
source: Sweatshirt
nb_no: Skjorte

# DummyData_Marketing
source: Marketing costs
fo_fo: Sølukostnaðir
nb_no: Salgsomkostninger

# DummyData_MiscSalesCosts
source: Misc. sales costs
fo_fo: Ymsir sølukostnaðir
nb_no: Diverse salgsomkostninger

# DummyData_Article_Third_Description
source: Bucket set
nb_no: Bøttesett

# DummyData_Bank
source: Bank
fo_fo: Banki

# DummyData_Hardware
source: Hardware
fo_fo: Tólbúnaður

# DummyData_Location_Dimension1_Hall1
source: Hall 1
fo_fo: Høll 1
