Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Errors.*.resx
Languages: da_dk, fo_fo, nb_no, sv_se

# Command_AdjustAveragePrice_Latest_Movement_Date_Is_Later_Than_FiscalDate
source: Latest movement on this article was at {0}. Date for regulation must be same or later.
da_dk: Sidste bevægelse på varen var {0}. Datoen for reguleringen skal derfor være samme dato eller senere.
nb_no: Siste bevegelse på varen var {0}. Datoen for reguleringen skal derfor være samme dato eller senere.

# Command_AdjustAveragePrice_No_Inventory_Management
source: Inventory management is not enabled on this article
da_dk: Lagerstyring er ikke aktiveret på denne vare
fo_fo: Goymslustýring er ikki virkt í hesi vøruni
nb_no: Lagerstyring er ikke aktivert på denne varen

# Xena_FiscalSetup_InviteSupporter_NoSupporterWithTheGivenName
source: No supporter with the given name: {0}
da_dk: Ingen supporter fundet med navnet {0}
fo_fo: Eingin supportari funnin kallaður: {0}
nb_no: Ingen supporter ble funnet med navnet: {0}

# Xena_XenaPrice_GetXenaUserPrice_NotAllowed
source: Not allowed
da_dk: Ikke tilladt
fo_fo: Ikki loyvt
nb_no: Ikke tillatt

# Command_CreatePurchaseDrafts_Nothing_To_Create
source: No suppliers were found to create purchase drafts on
da_dk: Ingen leverandør blev fundet til oprettelse af købskladde
fo_fo: Ingen leverandør blev fundet til oprettelse af købskladde
nb_no: Ingen leverandører ble funnet til opprettelsen av kjøpskladd

# Command_ImportPrimoArticlePost_No_Articles_Found
source: No articles match the supplied article numbers.
da_dk: Ingen vare passer med det angivede varenr
fo_fo: Eingin vøra hóskar til ásetta vørunummarið
nb_no: Ingen varer passer med det angitte varenr.

# Domain_Validation_PurchaseDraftLine_Missing_Article
source: Missing article
da_dk: Manglende varenr
fo_fo: Vantandi vørunr.
nb_no: Manglende varenr.

# Domain_Validation_VoucherPreview_Nothing_To_Bookkeep
source: Nothing to bookkeep
da_dk: Intet at bogføre
fo_fo: Einki at bóka
nb_no: Ingenting å bokføre

# Domain_LedgerPostPreview_Missing_LedgerTag
source: Missing ledger tag
da_dk: Manglende finanskonto
fo_fo: Vantandi fíggjarkonto
nb_no: Manglende finanskonto

# Query_VoucherPreviewSummary_Nothing_To_Bookkeep
source: Nothing to bookkeep
da_dk: Intet at bogføre
fo_fo: Einki at bóka
nb_no: Ingenting å bokføre

# Command_ImportC5Account_CannotImport_Without_Ledger
source: Cannot import postings without importing ledger
da_dk: Kan ikke importere posteringer uden at importere kontoplanen
fo_fo: Kann ikki innflyta bókingar uttan at innflyta kontoskipan
nb_no: Kan ikke importere posteringer uten å importere kontoplanen

# Command_InitializeC5Import_User_Not_Authorized
source: User ({0}) is not authorized to perform an import (must be bookkeeper or administrator)
da_dk: Brugeren {0} har ikke rettigheder til at lave en import(Import kræver enten bogførings- eller administratorrolle)
fo_fo: Brugeren {0} har ikke rettigheder til at lave en import(Import kræver enten bogførings- eller administratorrolle)
nb_no: Brukeren {0} har ikke rettigheter til å importere. (Import krever enten bokførings- eller administratorrolle)

# Controller_ApiArticleMapping_Nothing_To_Insert
source: Nothing to insert
da_dk: Intet at indsætte
fo_fo: Einki at seta inn
nb_no: Ingenting å sette inn

# Xena_PartnerResourceContext_ChangeTheme_NotAllowed
source: Not allowed to make changes to this resource
da_dk: Det er ikke tilladt at foretage denne ændring på medarbejderen
fo_fo: Tað ber ikki til at útinna henda broyting fyri starvsfólkið
nb_no: Det er ikke tillatt å foreta denne endringen på medarbeideren

# Xena_PartnerResourceContext_ChangeTheme_ThemeNotFound
source: Theme not found
da_dk: Temaet blev ikke fundet
nb_no: Tema ble ikke funnet

# Command_ImportStockCountDrafts_Failed_To_Import
source: Failed to import stock count for article: {0} {1}
da_dk: Kunne ikke importere optælling for vare {0} {1}
fo_fo: Kunne ikke importere optælling for vare {0} {1}
nb_no: Kunne ikke importere opptelling for vare {0} {1}

# Domain_Validation_OrderStatus_Color
source: Missing color
da_dk: Mangler farve
fo_fo: Vantandi litur
nb_no: Manglende farge

# Domain_Validation_OrderStatus_Name
source: Missing name
da_dk: Mangler navn
fo_fo: Vantar navn
nb_no: Mangler navn

# Domain_PriceDiscountAgreement_Must_Have_Either_Article_Or_ArticleGroup
source: Price discount agreements must be set on either an article or article group
da_dk: Rabataftaler skal sættes på enten en vare eller en varegruppe
fo_fo: Avsláttaravtalur skulu íbindast eina vøru ella ein vørubólk
nb_no: Rabattavtaler skal enten settes på en vare eller en varegruppe

# Command_ReArrangeOrderLines_Invalid_ContextType
source: {0} is not a valid contextType
da_dk: {0} er ikke en gyldig kontekst
fo_fo: ikki gildigt høpi
nb_no: {0} er ikke en gyldig kontekst

# Command_ReArrangeOrderLines_No_OrderLines_Selected
source: No orderlines selected
da_dk: Ingen ordrelinjer valgt
fo_fo: Ongar ordralinjur valdar
nb_no: Ingen ordrelinjer ble valgt

# Command_ReArrangeOrderLines_OrderLineIds_Not_Found
source: The following orderlines where not found: {0}
da_dk: Følgende ordrelinjer blev ikke fundet: {0}
fo_fo: Følgende ordrelinjer blev ikke fundet: {0}
nb_no: Følgende ordrelinjer ble ikke funnet: {0}

# Command_ReArrangeOrderLines_OrderLines_Delivered
source: The following orderlines have already been delivered: {0}
da_dk: Følgende ordrelinjer er allerede leveret: {0}
fo_fo: Følgende ordrelinjer er allerede leveret: {0}
nb_no: Følgende ordrelinjer er allerede levert: {0}

# Command_ReArrangeOrderLines_OrderLines_Invoiced
source: The following orderlines have already been invoiced: {0}
da_dk: Følgende ordrelinjer er allerede faktureret: {0}
fo_fo: Følgende ordrelinjer er allerede faktureret: {0}
nb_no: Følgende ordrelinjer er allerede faktureret: {0}

# Command_UpdateArticleSupplier_Article_Is_Not_Inventory_Managed
source: Article {0} is not marked for inventory management
da_dk: Varen {0} har ikke lagerstyring
nb_no: Varen {0} har ikke lagerstyring

# Command_BookkeepLedger_Bookkeeping_Was_Cancelled
source: Bookkeeping was cancelled by user
da_dk: Bogføringen blev afbrudt af brugeren
fo_fo: Bóking varð avbrotin av brúkara
nb_no: Bokføringen ble avbrutt av bruker

# Command_CancelOrderDelivery_Already_Cancelled
source: Delivery has already been cancelled
da_dk: Leveringen er allerede annulleret
fo_fo: Levering er longu avlýst
nb_no: Levering er allerede kansellert

# Command_CreateOffer_Nothing_To_Pick
source: Nothing to deliver (for pick list)
da_dk: Intet at leverer(til pluklisten)
fo_fo: Einki at levera (til stykkjalistan)
nb_no: Ingenting å levere (til plukklisten)

# Command_LinkArticlesInGroup_All_Articles_Linked
source: Article group ({0}) has no articles that have not already been linked.
da_dk: Varegruppen ({0}) har ingen varer som ikke allerede er sammenkædet.
nb_no: Varegruppen ({0}) har ingen varer som ikke allerede er linket.

# Command_LinkArticlesInGroup_Not_Linked
source: Article group ({0}) is not linked to an article group
da_dk: Varegruppen ({0}) er ikke sammenkædet med en varegruppe
nb_no: Varegruppen ({0}) er ikke linket med en varegruppe

# Command_TransferMembership_AdminRequired
source: You must be administrator to perform this action
da_dk: Det kræves administratorrettigheder for at udføre denne handling.
fo_fo: Fyrisitararættindi krevst fyri at útinna gerðina
nb_no: Du må være administrator for å utføre denne handlingen.

# Command_TransferMembership_MembershipNotFound
source: Membership not found
da_dk: Medlemskab blev ikke fundet
fo_fo: Limaskap ikki funnið
nb_no: Medlemskap ble ikke funnet

# Command_TransferMembership_NotAllowed
source: Not allowed
da_dk: Ikke tilladt
fo_fo: Ikki loyvt
nb_no: Ikke tillatt

# Command_TransferMembership_NotValidEmail
source: Not a valid email
da_dk: Ikke en gyldig email
fo_fo: Ikki gildigur teldupostur
nb_no: Ikke en gyldig e-post

# Command_TransferMembership_UserHasAccess
source: User has already access
da_dk: Brugeren har allerede adgang
fo_fo: Brúkari hevur longu atgongd
nb_no: Brukeren har allerede tilgang

# Domain_FiscalPeriod_Loced_At
source: Fiscal period ({0}) is locked at {1}
da_dk: Regnskabsåret ({0}) er låst per {1}
fo_fo: Roknskaparárið ({0}) er læst per {1}
nb_no: Regnskapsåret ({0}) er låst per {1}

# Domain_Ledger_Bookkeeping_Date_Before_Locked_At_Date
source: Ledger line (voucher: {0} at {1}) is before the fiscal periods lock date ({2})
da_dk: Kassekladdelinjen (bilag: {0} på {1}) er før finansperiodens låsedato ({2})
fo_fo: Kassekladdelinjen (bilag: {0} på {1}) er før finansperiodens låsedato ({2})
nb_no: Kassakladdlinjen (bilag: {0} på {1}) er før finansperiodens låsedato ({2})

# Domain_Order_Nothing_To_Cancel
source: Nothing to cancel
da_dk: Intet at annullere
fo_fo: Einki at ógilda
nb_no: Ingenting å annulere

# Domain_Order_Nothing_To_Deliver
source: Nothing to deliver
da_dk: Intet at leverere
fo_fo: Einki at levera
nb_no: Ingenting å levere

# Domain_Validation_BankSettlement_Must_Balance
source: Bank settlement does not balance
da_dk: Bankudligningen balancerer ikke
fo_fo: Bankaútlíkningin javnvigar ikki
nb_no: Bankavstemmingen balanserer ikke

# Updater_LedgerLine_Ledger_Is_Bookkeeping
source: Ledger ({0}) is bookkeeping
da_dk: Kladden ({0}) er ved at blive bogført
fo_fo: Kladdan ({0}) verður bókað
nb_no: Kladden ({0}) holder på å bli bokført

# Updater_ReportLayout_InvalidCulture
source: {0} is not a valid culture
da_dk: {0} er ikke et gyldig sprog
fo_fo: {0} er ikki eitt gildigt mál
nb_no: {0} er ikke et gyldig språk

# Xena_Domain_Delivery_OrderTask_Has_Not_Been_Delivered
source: Order task has not been delivered
da_dk: Ordreopgaven er ikke blevet leveret
fo_fo: Ordrauppgávan er ikki leverað
nb_no: Ordreoppgaven er ikke levert

# Xena_Domain_FailedToTransferMembership
source: Failed to transfer membership of this fiscalsetup to user: {1}
da_dk: Kunne ikke overføre ejerskabet af dette regnskab til brugeren: {1}
fo_fo: Kunne ikke overføre ejerskabet af dette regnskab til brugeren: {1}
nb_no: Kunne ikke overføre eierskapet av dette regnskapet til brukeren: {1}

# Xena_OrderUpdater_NoTermsOfPayment
source: No terms of payment
da_dk: Ingen betalingsbetingelser
fo_fo: Ongar gjaldstreytir
nb_no: Ingen betalingsbetingelser

# Command_HandleOTPSetupRequest_IncorrectCode
source: Incorrect code - request new code.
da_dk: Koden er ikke korrekt. Lav ny kode
fo_fo: Kotan er ikki røtt. Ger nýggj kotu
nb_no: Koden er ikke korrekt. Lag ny kode.

# Command_HandleOTPSetupRequest_IncorrectPhoneNumber
source: Incorrect phone number
da_dk: Ugylidgt telefonnummer
nb_no: Ugyldig telefonnummer

# Command_HandleOTPSetupRequest_NoActivation
source: No code saved - request new code.
da_dk: Ingen kode gemt - Hent ny kode
fo_fo: Eingin kota gomd. Heinta nýggja kotu.
nb_no: Ingen kode er lagret. Hent ny kode.

# Command_HandleOTPSetupRequest_UserNotFound
source: User not found
da_dk: Brugeren blev ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Command_SendOTPConfirmationCode_ErrorInSendingCode
source: An error occurred while sending the confirmation code
da_dk: En fejl opstod under afsende af engangskoden.
fo_fo: Eitt brek kom fyri meðan einnýtiskotan varð send
nb_no: En feil oppstod under sendingen av engangskoden

# Command_SendOTPConfirmationCode_NotANumber
source: Entered is not a correct phone number
da_dk: Det er ikke et korrekt telefonnummer der er indtastet
fo_fo: Tað àsetta er ikki eitt gildigt telefonnummar
nb_no: Du har ikke skrevet inn et korrekt telefonnummer

# Command_SendOTPSetupConfirmationCode_PhoneNumberRequired
source: Phone number required
da_dk: Telefonnummer krævet
nb_no: Telefonnummer påkrevd

# Command_SendOTPSetupConfirmationCode_UserNotFound
source: User not found
da_dk: Bruger ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Domain_FixedAssetPurchase_Nothing_To_Depreciate
source: Nothing to depreciate
da_dk: Intet at nedskrive
fo_fo: Einki at avskriva
nb_no: Ingenting å avskrive

# Domain_Validation_FixedAsset_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse

# Domain_Vat_Invalid_VatType
source: VatType is not valid ({0}) - valid vat types include: {1}
da_dk: Momstypen er ikke gyldig ({0}) - gyldige momstyper er: {1}
fo_fo: Momstypen er ikke gyldig ({0}) - gyldige momstyper er: {1}
nb_no: Momstypen er ikke gyldig ({0}) - gyldige momstyper er: {1}

# Query_VatProblem_DefaultEUVAT_Goods_Marked_Non_EUVatGoods
source: Default EU Goods VAT is marked as non-EU Goods type
da_dk: Standard EU momsen på varer er ikke en EU vare-moms.
nb_no: Stadard utlandsmoms på varer er ikke en utlands-vare-moms

# Query_VatProblem_DefaultEUVAT_Services_Marked_Non_EUVatServices
source: Default EU Services VAT is marked as non-EU Services type
da_dk: Standard EU momsen på ydelser er ikke en EU ydelse-moms.
nb_no: Standard utlandsmoms på tjenester er ikke en utlands-tjeneste-moms

# Query_VatProblem_DefaultPurchaseVAT_Marked_Non_Purchasing
source: Default purchasing VAT is marked as non-purchase type
da_dk: Standard købsmomsen er ikke af typen købsmoms
nb_no: Standard kjøpsmoms er ikke av typen kjøpsmoms

# Query_VatProblem_DefaultSalesVAT_Marked_Non_Sales
source: Default sales VAT is marked as non-sales type
da_dk: Standard salgsmomsen er ikke af typen salgsmoms
fo_fo: Standard salgsmomsen er ikke af typen salgsmoms
nb_no: Standard salgsmoms er ikke av typen salgsmoms

# Query_VatProblem_Marked_As_Default_Type
source: VAT Code is marked as non-determinate - should be changed appropriately.
da_dk: Momskoden er markeret som "Ukendt", der bør vælges en passende type.
fo_fo: MVG kotan er merkt sum "ókjent". Vel ein hóskandi kotu.
nb_no: Momskoden er markert som "ukjent". Velg en passende kode.

# Query_VatReconciliationPost_Cannot_Supply_Both_LedgerTag_And_ArticleGroup
source: Cannot supply both ledgertag and articlegroup
da_dk: Der kan ikke angives både finanskonto og varegruppe
fo_fo: Har kann ikki ásetast bæði fíggjarkonto og vørubólk
nb_no: Kan ikke angi både finanskonto og varegruppe

# Command_BulkInserImportedPostingCommand_NoValidAccount
source: {0} is not a valid account
da_dk: {0} er ikke en gyldig konto
fo_fo: ikki gildig konto
nb_no: {0} er ikke en gyldig konto

# Command_BulkInsertImportedAccount_ImportFailed
source: Import for {0} failed
da_dk: Import af {0} fejlede
fo_fo: Innflutningur av {0} miseydnaðist
nb_no: Import av {0} mislyktes

# Command_BulkInsertImportedAccount_ImportFailed_DuplicateAccountNumber
source: Following account numbers were duplicated:
da_dk: Følgende kontonumre er duplikerede
fo_fo: Fylgjandi kontonummur eru avritað
nb_no: Følgende kontonumre ble kopiert:

# Command_BulkInsertImportedAccountCommand_ImportTaskNotFound
source: Import task not found
da_dk: Importopgaven er ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_BulkInsertImportedArticleCommand_ImportTaskNotFound
source: Import task not found
da_dk: Importopgaven er ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_BulkInsertImportedArticleGroupCommand_DuplicateArticleGroups
source: Following article groups were duplicated:
da_dk: Følgende varegrupper er duplikerede:
fo_fo: Fylgjandi vørubólkar vóru avritaðar
nb_no: Følgende varegrupper ble kopiert:

# Command_BulkInsertImportedArticleGroupCommand_ImportFailed
source: Import for {0} failed, as the article group is missing description
da_dk: Import af {0} fejlede fordi varegruppen mangler beskrivelse
fo_fo: Innflutningur av {0} miseydnaðist tí vørubólkurin manglar lýsing
nb_no: Import av {0} mislyktes fordi varegruppen mangler beskrivelse

# Command_BulkInsertImportedArticleGroupCommand_ImportTaskNotFound
source: Import task not found
da_dk: Importopgaven er ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_BulkInsertImportedPostingCommand_ImportFailed
source: Import for {0} failed
da_dk: Import af {0} fejlede
fo_fo: Innflutningur av {0} miseydnaðist
nb_no: Import av {0} mislyktes

# Command_BulkInsertImportedPostingCommand_ImportTaskNotFound
source: Import task not found
da_dk: Importopgaven er ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_RequestResetDataImportTask_FiscalSetupNotFound
source: Fiscalsetup not found
da_dk: Regnskab ikke fundet
fo_fo: Roknskapur varð ikki funnin
nb_no: Regnskap ikke funnet

# Command_RequestResetDataImportTask_ImportTaskNotFound
source: Import task not found
da_dk: Importopgaven er ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_RequestResetDataImportTask_NotAllowedToDeleteAccounts
source: Not allowed to delete imported accounts, because they are used by imported postings
da_dk: Det er ikke muligt at slette importerede konti fordi de bruges af importede posteringer.
fo_fo: Tað ber ikki til at strika innfluttar kontoir, tær eru í nýtslu á innfluttum bókingum
nb_no: Ikke mulig å slette importerte kontoer, for de brukes av importerte posteringer

# Command_RequestResetDataImportTask_NotAllowedToDeleteArticleGroups
source: Not allowed to delete imported article groups, because they are used by imported articles
da_dk: Det er ikke muligt at slette importede varegrupper fordi de bruges af importerede varer.
fo_fo: Tað ber ikki til at strika innfluttar vørubólkar, teir eru í nýtslu á influttum vørum
nb_no: Ikke tillatt å slette importerte varegrupper, for de brukes av importerte varer

# Deleters_FixedAsset_Has_Purchases
source: Cannot delete fixed assets with purchases
da_dk: Anlægsaktiver med køb kan ikke slettes
fo_fo: Útbúnaður við keypi kann ikki slettast
nb_no: Kan ikke slette anleggsmidler med kjøp

# Deleters_FixedAssetPurchase_Depreciations_Exists
source: Cannot delete purchases with depreciations
da_dk: Anlægsaktiver med afskrivninger kan ikke slettes
fo_fo: Útbúnaður við avskriving kann ikki slettast
nb_no: Anleggsaktiver med avskrivninger kan ikke slettes

# Deleters_FixedAssetPurchase_Transaction
source: Cannot delete purchases linked to a voucher
da_dk: Indkøb som er finansbogført kan ikke slettes.
nb_no: Kan ikke slette kjøp som er finansbokført

# Validation_AccountManualImportData_Missing_Description
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Validation_AccountManualImportData_MissingAccountNumber
source: Missing account number
da_dk: Mangler kontonummer
fo_fo: Vantandi kontonummar
nb_no: Mangler kontonummer

# Command_BulkInsertImportedAccount_ImportFailedReasons
source: Import of account: {0} failed for the following reasons: {1}
da_dk: Import for {0} fejlede: {1}
fo_fo: Innflutningur av {0} miseydnaðist: {1}
nb_no: Import for {0} mislyktes: {1}

# Command_BulkInsertImportedArticleGroupCommand_ImportFailedReasons
source: Import of articlegroup: {0} failed for the following reasons: {1}
da_dk: Import for {0} fejlede: {1}
fo_fo: Innflutningur av {0} miseydnaðist: {1}
nb_no: Import for {0} mislyktes: {1}

# Command_BulkInsertImportedPartnerCommand_ImportFailed
source: Import of partner: {0} failed for the following reasons: {1}
da_dk: Import for {0} fejlede: {1}
fo_fo: Innflutningur av {0} miseydnaðist: {1}
nb_no: Import for {0} mislyktes: {1}

# Command_BulkInsertImportedPartnerCommand_ImportTaskNotFound
source: Import task missing
da_dk: Importopgaven blev ikke fundet
fo_fo: Innflutningsuppgávan varð ikki funnin
nb_no: Importoppgaven ble ikke funnet

# Command_BulkInsertImportedPartnerCommand_Validation_ContactNoMissing
source: Contact number missing
da_dk: Kundenr mangler
fo_fo: Kundanr. manglar
nb_no: Kundenr. mangler

# Command_BulkInsertImportedPostingCommand_ImportFailedReasons
source: Import for post: {0} failed for the following reasons: {1}
da_dk: Import for {0} fejlede: {1}
fo_fo: Innflutningur av {0} miseydnaðist: {1}
nb_no: Import for {0} mislyktes: {1}

# Validation_ArticleGroupImportData_Missing_Description
source: Missing description
da_dk: Beskrivelse mangler
nb_no: Beskrivelse mangler

# Command_BulkInsertImportedArticle_ImportFailedReasons
source: Import of article: {0} failed for the following reasons: {1}
da_dk: Import for {0} fejlede: {1}
fo_fo: Innflutningur av {0} miseydnaðist: {1}
nb_no: Import for {0} mislyktes: {1}

# Command_UpdateFiscalAccountantCommand_AccountantNotFound
source: Accountant not found
da_dk: Revisor ikke fundet
fo_fo: Grannskoðari ikki funnin
nb_no: Revisor ikke funnet

# Command_UpdateFiscalAccountantCommand_LedgerNotFound
source: Ledger not found
da_dk: Kladde ikke fundet
fo_fo: kladda ikki funnin
nb_no: Kladd ikke funnet

# Command_UpdateFiscalAccountantCommand_NoFiscalSetup
source: No fiscalsetup found
da_dk: Intet regnskab fundet
fo_fo: Einki roknskap funnið
nb_no: Ingen regnskap funnet

# Domain_Validation_AccountantDepartment_Missing_Description
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Xena_InvitePartner_Supporters_And_Accountants_Cannot_Invite
source: Supporters and accountants cannot invite partners
da_dk: Supportere og revisorer kan ikke invitere partnere
nb_no: Supportere og revisorer kan ikke invitere partnere

# Command_MergeLocation_Cannot_Merge_Location_Onto_It_Self
source: You must supply different locations to merge.
da_dk: Der skal angives forskellige lokationer
nb_no: Det skal angis forskjellige plasseringer

# Domain_Order_Cannot_Delete_Order_With_Deliveries
source: Order ({0}) has at least one delivery and cannot be deleted.
da_dk: Ordre {0} har mindst en levering og kan derfor ikke slettes.
fo_fo: Ordri {0} hevur í minsta lagi eina levering og kann tí ikki strikast
nb_no: Ordre {0} har minst én levering og kan derfor ikke slettes.

# Domain_Order_Cannot_Delete_Order_With_Invoices
source: Order ({0}) has at least one invoice and cannot be deleted.
da_dk: Ordre {0} har mindst en fatkura og kan derfor ikke slettes.
fo_fo: Ordri {0} hevur í minsta lagi ein fakura og kann tí ikki strikast
nb_no: Ordre {0} har minst én faktura og kan derfor ikke slettes.

# Domain_StockCountDraft_Article_Does_Not_Have_Inventory_Management
source: Article ({0}) does not have inventory management
da_dk: Varen {0} har ikke lagerstyring
nb_no: Varen {0} har ikke lagerstyring

# Domain_VatSettlement_Has_Been_Paid
source: Vat settlement has already been paid
da_dk: Momsafregningen er allerede betalt
fo_fo: MVG avrokning er longu goldið
nb_no: Momsavregningen er allerede betalt

# Xena_ActivityUpdater_ActivityTypeRequired
source: Activity type required
da_dk: Aktivitetstype er påkrævet
fo_fo: Virksemi slag kravt
nb_no: Aktivitetstype påkrevd

# Xena_ActivityUpdater_OrderRequiredForThisActivityType
source: Order required for this type of activity
da_dk: En ordre er påkrævet for denne aktivitetstype
nb_no: En ordre er påkrevd for denne aktivitetstypen

# Xena_Home_CreditCardRequiredRoleChanging_UserNotFound
source: User not found for membership: {0}
da_dk: Brugeren blev ikke fundet for medlemskabet: {0}
fo_fo: Brúkari ikki funnin fyri limaskap: {0}
nb_no: Brukeren ble ikke funnet for medlemskapet: {0}

# Command_CreateActivityFromAppointmentCommand_AppointmentIsMissing
source: Appointment is missing
da_dk: Aftale mangler
fo_fo: Avtala manglar
nb_no: Avtale mangler

# Command_CreateActivityFromAppointmentCommand_ResourceIsMissing
source: Resource is missing
da_dk: Medarbejder mangler
fo_fo: Resursa vantar
nb_no: Medarbeider mangler

# Command_MoveEconomicTransaction_No_Change
source: Nothing to change
da_dk: Intet at ændre
fo_fo: Einki at broyta
nb_no: Ingenting å endre

# Deleters_OrderLine_Cannot_Delete_Delivered_OrderLines
source: Cannot delete delivered order lines
da_dk: Leverede varelinjer kan ikke slettes
fo_fo: Linjur við leveraðum vørum kunnu ikki strikast
nb_no: Leverte varelinjer kan ikke slettes
