Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Errors.*.resx
Languages: da_dk, fo_fo, nb_no, sv_se

# Xena_Domain_Bookkeeping_LedgerPostDraft_Missing_LedgerTag
source: Ledger tag not set
da_dk: Finanskonto er ikke udfyldt
fo_fo: Fíggjarkonto er ikki útfylt
nb_no: Finanskonto er ikke utfylt
sv_se: Finanskontot är inte ifyllt

# Xena_Domain_Bookkeeping_LedgerPostDraft_Warning_Vats_Dont_Match
source: VAT is not the same as default VAT on ledgertag
da_dk: Moms er ikke det samme som standardmoms på finanskonto
fo_fo: MVG samsvarar ikki við standard MVG á fíggjarkonto
nb_no: Moms er ikke det samme som standardmoms på finanskonto
sv_se: Momsen motsvarar inte standardmomsen på finanskontot

# Xena_Domain_Bookkeeping_VoucherDraft_Partner_Deactivated
source: Partner is deactivated
da_dk: Partner er deaktiveret
fo_fo: Vinnupartnari er óvirktur
nb_no: Partner er deaktivert
sv_se: Partner har avaktiverats

# Xena_Domain_Delivery_Order_Is_Deleted
source: Order is deleted
da_dk: Ordren er slettet
fo_fo: Ordrin er strikaður
nb_no: Ordren er slettet
sv_se: Ordern är borttagen

# Xena_Domain_Delivery_Order_No_Partner
source: No partner on order
da_dk: Ingen partner er valgt på ordre
fo_fo: Eingin vinnupartnari á ordra
nb_no: Ingen partner er valgt på ordre
sv_se: Ingen partner har valts för ordern

# Xena_Domain_Delivery_Order_Partner_Is_Deactivated
source: Partner is deactivated
da_dk: Partner er deaktiveret
fo_fo: Vinnupartnari er óvirktur
nb_no: Partner er deaktivert
sv_se: Partner är avaktiverad

# Xena_Domain_Delivery_OrderTask_Already_Delivered
source: Ordertask is already delivered
da_dk: Ordeopgave er allerede leveret
fo_fo: Ordrauppgávan er ikki leverað
nb_no: Ordreopgaven er allerede levert
sv_se: Partner är avaktiverad

# Xena_Domain_Invoicing_Order_Is_Deleted
source: Order is deleted
da_dk: Ordren er slettet
fo_fo: Ordrin er strikaður
nb_no: Ordren er slettet
sv_se: Ordern är borttagen

# Xena_Domain_Invoicing_Order_No_Partner
source: No partner on order
da_dk: Ingen partner er valgt på ordre
fo_fo: Eingin vinnupartnari á ordra
nb_no: Ingen partner er valgt på ordre
sv_se: Ingen partner har valts för ordern

# Xena_Domain_Invoicing_Order_Partner_Is_Deactivated
source: Partner is deactivated
da_dk: Partner er deaktiveret
fo_fo: Vinnupartnari er óvirktur
nb_no: Partner er deaktivert
sv_se: Partner är avaktiverad

# Xena_Domain_Invoicing_OrderTask_Already_Invoiced
source: Ordertask already invoiced
da_dk: Ordeopgaven er allerede faktureret
fo_fo: Ordrauppgávan er longu fakturerað
nb_no: Ordreoppgaven er allerede fakturert

# Xena_Domain_ReminderStep_ReminderStep_Has_No_Consequence_For_PartnerPost
source: Reminderstep has no consequence for partner post
da_dk: Påmindelsesplanen har ingen konsekvens for partneren
fo_fo: Påmindelsesplanen har ingen konsekvens for partneren
nb_no: Påminnelsesplanen har ingen konsekvens for partneren
sv_se: Påminnelsesplanen har ingen konsekvens för partnerposten

# Xena_Domain_Validation_Article_Missing_ArticleNumber
source: Empty or missing article number
da_dk: Tomt eller manglende varenummer
nb_no: Tom eller mangler varenummer
sv_se: Tom eller saknar varunummer

# Xena_Domain_Validation_Article_Missing_Description
source: Empty or missing description
da_dk: Tom eller manglende beskrivelse
nb_no: Tom eller mangler beskrivelse
sv_se: Tom eller saknar beskrivning

# Xena_Domain_Validation_Article_Missing_Group
source: Missing group
da_dk: Manglende gruppe
fo_fo: Vantandi bólkur
nb_no: Mangler gruppe
sv_se: Grupp saknas

# Xena_Domain_Validation_ArticleGroup_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Bearer_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_CurrencyExchangeRate_ExchangeRate_Must_Be_Positive
source: Exchangerate must be positive
da_dk: Valutakursen skal være positiv
nb_no: Vekslingskurs må være positiv
sv_se: Valutakursen måste vara positiv

# Xena_Domain_Validation_CurrencyExchangeRate_Missing_Currency
source: Missing currency
da_dk: Manglende valuta
fo_fo: Vantandi gjaldoyra
nb_no: Manglende valuta
sv_se: Valuta saknas

# Xena_Domain_Validation_Department_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_EconomicTransaction_Amount_Must_Balance
source: Amounts must balance
da_dk: Beløbet skal balancere
fo_fo: Upphæddir mugu javnviga
nb_no: Beløp må balansere
sv_se: Beloppen måste balancera

# Xena_Domain_Validation_FiscalPeriod_StartDate_Must_Be_After_EndDate
source: Start date must be before end date
da_dk: Startdato skal være før slutdato
nb_no: Startdatoen må være før sluttdatoen
sv_se: Startdatum måste vara före slutdatum

# Xena_Domain_Validation_FiscalSetup_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Ledger_Must_Balance
source: Ledger must balance
da_dk: Finanskonto skal balancere
fo_fo: Fíggjarkonto skal javnviga
nb_no: Finanskonto må balansere
sv_se: Finanskonto måste balancera

# Xena_Domain_Validation_LedgerTag_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_LedgerTag_Missing_LedgerAccount
source: Missing ledger account
da_dk: Manglende finanskonto
fo_fo: Vantandi fíggjarkonto
nb_no: Manglende finanskonto
sv_se: Finanskonto saknas

# Xena_Domain_Validation_OrderLine_Article_Is_Deactivated
source: Article is deactivated
da_dk: Varen er deaktiveret
nb_no: Varen er deaktivert
sv_se: Varan är avaktiverad

# Xena_Domain_Validation_Purpose_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_ReminderStep_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Settlement_Partner_Must_Balance
source: Partner must balance
da_dk: Partner skal balancere
fo_fo: Vinnupartnari skal javnviga
nb_no: Partner skal balansere
sv_se: Partner måste balancera

# Xena_Domain_Validation_Unit_Missing_Abbreviation
source: Missing abbreviation
da_dk: Manglende forkortelse
fo_fo: Vantandi stytting
nb_no: Manglende forkortelse
sv_se: Förkortning saknas

# Xena_Domain_Validation_Unit_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Vat_Missing_Abbreviation
source: Missing abbreviation
da_dk: Manglende forkortelse
fo_fo: Vantandi stytting
nb_no: Manglende forkortelse
sv_se: Förkortning saknas

# Xena_Domain_Validation_Vat_Missing_Description
source: Missing descirption
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Vat_Percentage_Cannot_Be_Negative
source: Percentage cannot be negative
da_dk: Procent kan ikke være negativ
fo_fo: Prosent kann ikki vera minus
nb_no: Prosent kan ikke være negativ
sv_se: Procentsatsen kan inte vara negattiv

# Xena_User_Creation_Duplicate_User
source: Another user exists with this user name
da_dk: Anden bruger benytter dette brugernavn
fo_fo: Brúkaranavnið er í nýtslu
nb_no: En annen bruker har dette brukernavnet
sv_se: Användarnamnet är upptaget

# Xena_User_Creation_Invalid_Email
source: Not a valid email address
da_dk: Ikke gyldig e-mailadresse
fo_fo: Ikki gildig teldupostadressa
nb_no: Ikke gyldig e-postadresse
sv_se: Ogiltig e-mailadress

# Xena_User_Creation_Password_Must_Be_5_Characters_Or_More
source: Password must be at least 6 characters long
da_dk: Adgangskode skal være på mindst 6 tegn
fo_fo: Kotan skal vera minst 6 tekn
nb_no: Passordet må inneholde minst 6 tegn
sv_se: Lösenordet måste bestå av minst 5 tecken

# Xena_Domain_Validation_ArticleEANNumber_Missing_EANNumber
source: Missing EAN-number
da_dk: Manglende EAN-nummer
fo_fo: Vantandi EAN-nummar
nb_no: Mangler EAN-nummer
sv_se: EAN-nummer saknas

# Xena_Domain_Processing_Order_Cash_Order_Must_Be_Paid
source: Cash orders must be paid when invoiced
da_dk: Kontantorder skal betales med det samme
fo_fo: Kontantordri skal gjaldast beinanvegin
nb_no: Kontantordre skal betales med det samme
sv_se: Kontant order måste betalas direkt

# Xena_Domain_Processing_Order_Is_Already_Delivered
source: Cannot deliver an already delivered order
da_dk: Ordren er allerede leveret
fo_fo: Ordrin er longu leveraður
nb_no: Ordren er allerede levert
sv_se: Ordern är redan levererad

# Xena_Domain_Processing_Order_Is_Already_Invoiced
source: Cannot invoice an already invoiced order
da_dk: Ordren er allerede faktureret
fo_fo: Ordrin er longu faktureraður
nb_no: Ordren er allerede fakturert
sv_se: Ordern är redan fakturerad

# Xena_Domain_Processing_Order_No_Effect
source: Nothing is processed
da_dk: Intet er forarbejdet
nb_no: Ingenting er behandlet

# Xena_Domain_Processing_Order_Order_Must_Be_Paid_In_Full
source: Order must be paid in full
da_dk: Det betalte beløb skal stemme med ordrens total
fo_fo: Upphædd samsvarar ikki við ordraupphædd
nb_no: Det betalte beløpet skal stemme med ordrens total
sv_se: Det betalda beloppet ska stämma överens med orderns total

# Xena_Domain_Bookkeeping_LedgerPostDraft_NothingToBookkeep
source: Nothing to bookkeep
da_dk: Intet at bogføre
fo_fo: Einki at bóka
nb_no: Ingenting å bokføre
sv_se: Inget att bokföra

source: Amounts on customer posts do not match ledger posts on customer account
da_dk: Beløbet på kundens posteringer stemmer ikke med finansposeringerne på kundens konto
fo_fo: Beløbet på kundens posteringer stemmer ikke med finansposeringerne på kundens konto
nb_no: Beløbet på kundens posteringer stemmer ikke med finansposteringerne på kundens konto
sv_se: Beloppet på kundens poster motsvarar inte finansposterna på kundens konto

source: Amounts on supplier posts do not match ledger posts on supplier account
da_dk: Beløbet på leverandørens posteringer stemmer ikke med finansposteringerne på leverandørens konto
fo_fo: Beløbet på leverandørens posteringer stemmer ikke med finansposteringerne på leverandørens konto
nb_no: Beløpet på leverandørens posteringer stemmer ikke med finansposteringerne på leverandørens konto
sv_se: Beloppet på leverantörens poster motsvarar inte finansposterna på leverantörens konto

# Xena_Domain_Validation_LedgerTag_Invalid_LedgerAccount
source: Invalid ledger account
da_dk: Ugyldig finanskonto
nb_no: Ugyldig finanskonto
sv_se: Ogiltigt finanskonto

# Xena_Domain_Validation_LedgerTag_NetTurnOver_Not_Allowed
source: Cannot make ledger tags in net turnover
da_dk: Kan ikke oprette finanskonti i omsætning
fo_fo: Kann ikki stovna fíggjarkontoir í umseting
nb_no: Kan ikke opprette finanskonti i omsetning
sv_se: Kan inte upprätta finanskonton i omsättning

# Xena_Domain_Validation_LedgerTag_ProductConsumption_Not_Allowed
source: Cannot make ledger tags in product ponsumption
da_dk: Kan ikke oprette finanskonti i vareforbrug
fo_fo: Kann ikki stovna kontoir í vørunýtslu
nb_no: Kan ikke opprette finanskonti i vareforbruk
sv_se: Kan inte upprätta finanskonton i varuförbruk

# Xena_Domain_Validation_PrimoLedgerPost_Invalid_LedgerAccount
source: Invalid ledger account
da_dk: Ugyldig finanskonto
nb_no: Ugyldig finanskonto
sv_se: Ogiltigt finanskonto

source: Fiscal date is later than start of fiscal period
da_dk: Datoen er senere end starten på finansperioden
fo_fo: Dagfesting er seinni enn byrjanina á fíggjartíðarskeiðið
nb_no: Datoen er senere enn starten på finansperioden
sv_se: Datumet ligger senare än början på räkenskapsåret

# Xena_Domain_Validation_PrimoPartnerPost_Missing_Partner
source: Missing partner
da_dk: Manglende partner
fo_fo: Vantandi vinnupartnari
nb_no: Manglende partner
sv_se: Partner saknas

# Xena_Domain_Validation_PrimoArticlePost_Missing_Article
source: Missing article
da_dk: Manglende vare
fo_fo: Vantandi vøra
nb_no: Manglende vare
sv_se: Vara saknas

# Xena_Domain_Validation_PrimoArticlePost_Negative_AveragePrice
source: Negative average price
da_dk: Negativ gennemsnitspris
fo_fo: Negativur miðalprísur
nb_no: Negativ gjennomsnittspris
sv_se: Negativt genomsnittspris

# Xena_Domain_Validation_PrimoArticlePost_Negative_Quantity
source: Negative quantity
da_dk: Negativt antal
fo_fo: Negativ nøgd
nb_no: Negativt antall
sv_se: Negativt antal

# Xena_Domain_Validation_Partner_Missing_Name
source: Empty or missing name
da_dk: Tomt eller manglende navn
nb_no: Tomt eller mangler navn
sv_se: Tom eller namn saknas

# Xena_Domain_Validation_Voucher_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Bookkeeping_LedgerPostDraft_Must_Balance
source: Ledger post drafts must balance (difference: {0})
da_dk: Finansposteringer skal balancere (difference: {0})
fo_fo: Fíggjarbókingar skal javnviga (difference: {0})
nb_no: Finansposteringene må balansere (differanse: {0})
sv_se: Finansposterna måste balancera (differens: {0})

# Xena_Domain_Bookkeeping_LedgerPostDraft_None
source: No Ledger post drafts
da_dk: Ingen finansposteringer
fo_fo: Ongar fíggjarbókingar
nb_no: Ingen finansposteringer
sv_se: Inga finansposter

# Xena_Domain_Bookkeeping_VoucherDraft_VoucherDraftType_Not_Supported
source: Voucher draft type is not supported
da_dk: Bilagstype er ikke supporteret
fo_fo: Fylgisskjalsfílutýpa riggar ikki
nb_no: Bilagstype understøttes ikke
sv_se: Bilagstypen understöds ej

# Xena_Domain_VoucherDraft_Validation_Finance_Drafts_Cannot_Have_Partner
source: Finance vouchers cannot have a partner
da_dk: Finansbilag kan ikke have en partner
fo_fo: Fíggjarfylgisskjal kann ikki hava vinnupartnara
nb_no: Finansbilag kan ikke ha en partner
sv_se: Finansbilagan kan inte ha en partner

# Xena_Domain_VoucherDraft_Validation_Finance_Drafts_Cannot_Have_Settlements
source: Finance vouchers cannot have settled partner posts
da_dk: Finansbilag må ikke have udlignede partner posteringer
fo_fo: Fíggjarfylgisskjal kann ikki hava útlíknaðar vinnupartnarabókingar
nb_no: Finansbilag kan ikke ha utlignede partnerposteringer
sv_se: Finansbilaga får inte ha utjämnande partnerposter

# Xena_Domain_Bookkeeping_EconomicTransaction_Warning_SystemDifference
source: Differences will be bookkeept
da_dk: Der vil blive bogført på differencekontoen
fo_fo: Bókast á munarkonto
nb_no: Det vil bli bokført på differansekontoen

source: Fiscaldates on one or more ledgerposts differ from economic transactions fiscaldate
da_dk: Datoen på en eller flere finansposter er forskellig fra transaktionens
fo_fo: Dagfesting á einari ella fleiri fíggjarbókingum samsvarar ikki við dagfesting á handlinum
nb_no: Datoen på en eller flere finansposter er forskjellig fra transaksjonens
sv_se: Datum på en eller flera finansposter motsvarar inte transaktionsdatum

# Xena_Domain_Bookkeeping_VoucherDraft_Warning_Future_FiscalDate
source: Fiscal date is in the future
da_dk: Dato er fremtidig
fo_fo: Dagfesting er í framtíðini
nb_no: Dato er framtidig
sv_se: Datumet är framtidigt

# Xena_Domain_Validation_VariantRange_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Variant_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Article_Already_Has_Variants
source: Article already has variants
da_dk: Varen har allerede varianter
nb_no: Varen har allerede varianter
sv_se: Artikeln har redan varianter

# Xena_Domain_Validation_Article_Variants_Already_Disabled
source: Variants already disabled
da_dk: Variantstyring er allerede deaktiveret
nb_no: Variantstyring er allerede deaktivert
sv_se: Variantstyrning redan avaktiverad

# Xena_Domain_Validation_PrimoArticlePost_Variant_Not_Applicable_For_Article
source: This variant is not applicable for the article
da_dk: Varianten passer ikke sammen med varen
nb_no: Varianten passer ikke sammen med varen
sv_se: Den här varianten passar inte med varan

# Xena_Domain_Validation_OrderLine_Missing_ArticleVariant
source: Article has no chosen variant
da_dk: Varen har varianter - der skal vælges en
nb_no: Varen har varianter - velg en
sv_se: Varan har ingen vald variant

# Xena_Domain_Validation_OrderLine_Variant_Not_Applicable_For_Article
source: This variant is not applicable for the article
da_dk: Varianten passer ikke sammen med varen
nb_no: Varianten passer ikke sammen med varen
sv_se: Den här varianten passar inte med varan

# Xena_Domain_Validation_Location_Missing_Dimension1
source: Missing dimension 1
da_dk: Manglende dimension 1
fo_fo: Vantandi dimensjón 1
nb_no: Mangler dimensjon 1
sv_se: Saknad dimension 1

# Xena_Domain_Validation_Location_Missing_Dimension2
source: Missing dimension 2
da_dk: Manglende dimension 2
fo_fo: Vantandi dimensjón 2
nb_no: Mangler dimensjon 2
sv_se: Saknad dimension 2

# Xena_Domain_Validation_Location_Missing_Dimension3
source: Missing dimension 3
da_dk: Manglende dimension 3
fo_fo: Vantandi dimensjón 3
nb_no: Mangler dimensjon 3
sv_se: Saknad dimension 3

# Xena_Domain_Validation_Location_Missing_Dimension4
source: Missing dimension 4
da_dk: Manglende dimension 4
fo_fo: Vantandi dimensjón 4
nb_no: Mangler dimensjon 4
sv_se: Saknad dimension 4

# Xena_Domain_Validation_Location_Missing_Dimension5
source: Missing dimension 5
da_dk: Manglende dimension 5
fo_fo: Vantandi dimensjón 5
nb_no: Mangler dimensjon 5
sv_se: Saknad dimension 5

# Xena_Domain_Validation_Warehouse_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Partner_ChangeInvoicEmail_Invalid_Email
source: Not a valid email address
da_dk: Dette er ikke en gyldig e-mailadresse
fo_fo: Ikki gildigur teldupostur
nb_no: Dette er ikke en e-postadresse
sv_se: Ogiltig e-mailadress

# Xena_Domain_Validation_CurrencyExchangeRate_NotFoundForDate
source: No exchange rate found for {0}, date: {1}
da_dk: Der findes ikke valutakurs for {0} pr. {1}
fo_fo: Eingin gjaldoyrakursur er ásett fyri {0} um {1}
nb_no: Det finnes ikke valutakurs for {0} pr. {1}
sv_se: Det finns ingen valutakurs för {0} pr. {1}

# Xena_User_Creation_Name_Empty
source: Name for user is not set
da_dk: Navn for bruger er ikke sat
fo_fo: Navn til brúkara ikki valt
nb_no: Navn for bruker er ikke valgt
sv_se: Namn för användare har inte angivits

# Xena_Domain_Validation_Location_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse
sv_se: Beskrivning saknas

# Xena_Domain_Validation_Location_Missing_Abbreviation
source: Missing abbreviation
da_dk: Manglende kode
fo_fo: Vantandi kota
nb_no: Manglende kode
sv_se: Kod saknas

# Controller_ApiArticle_SpecifyVariants_Difference_Quantity
source: Quantities on specifications do not match the original quantity
da_dk: Mængden på den oprindelige beholdning stemmer ikke overens med specifikationerne
fo_fo: Mængden på den oprindelige beholdning stemmer ikke overens med specifikationerne
nb_no: Mengden på den opprinnelige beholdning stemmer ikke overens med spesifikasjonene
sv_se: Antalet som angivits i specifikationen motsvarar inte ursprungligt antal

# Controller_ApiArticle_SpecifyVariants_No_Specifications
source: Missing specifications of variants
da_dk: Manglende specifikation af varianterne
fo_fo: Vantandi tilskilan av variantunum
nb_no: Mangler spesifikasjon av variantene
sv_se: Specifikation om varianterna saknas.

# Domain_ArticlePost_No_Article
source: Missing article on article post
da_dk: Manglende vare på vareposteringen
fo_fo: Vantandi vøra á vørubókingini
nb_no: Manglende vare på vareposteringen
sv_se: Vara saknas på varuposten

# Domain_ArticlePost_Variant_Does_Not_Match_Article
source: Article variant's article is not the same as the article on the article post
da_dk: Variantens vare stemmer ikke overens med varen på vareposteringen
nb_no: Variantens vare stemmer ikke overens med varen på vareposteringen
sv_se: Varans variant motsvarar inte varan på artikelposten

# Domain_Payment_Difference_Is_Too_Large
source: Difference is: {0} {2}, but cannot exceed {1} {2}
da_dk: Differencen er: {0} {2}, men må maksimalt være: {1} {2}
fo_fo: Munurin er: {0} {2}, men kann í mesta lagi vera: {1} {2}
nb_no: Differansen er: {0} {2}, men kan maksimalt være: {1} {2}
sv_se: Differensen är: {0} {2}, men får maximalt vara: {1} {2}

# Domain_Payment_PartnerPost_Already_Settled
source: Partner post (id: {0}) is already settled on settlement (id: {1})
da_dk: Partnerposteringen (id: {0}) er allerede udlignet: (id: {1})
fo_fo: Vinnupartnarabókingin (id: {0}) er longu útlíknað: (id: {1})
nb_no: Partnerposteringen (id: {0}) er allerede utlignet: (id: {1})
sv_se: THOMAS - udligning

# Domain_Payment_PartnerPost_Not_Found
source: Partner post not found - Id: {0}
da_dk: Partnerposteringen blev ikke fundet - Id: {0}
fo_fo: Vinnupartnarabókingin varð ikki funnin - eyðmerki: {0}
nb_no: Partnerposteringen ble ikke funnet - Id: {0}
sv_se: Partnerposterna hittades inte - Id: {0}

# Domain_Payment_PartnerPost_On_Wrong_Partner
source: Partner post (Id: {0}) is not on this partner (Id: {1})
da_dk: Partnerpostering (Id: {0}) tilhører ikke denne partner: (Id: {1})
fo_fo: Vinnupartnarabóking (Id: {0}) hoyrir ikki til vinnupartnaran (Id: {1})
nb_no: Partnerpostering (Id: {0}) tilhører ikke denne partner: (Id: {1})
sv_se: Partnerpost (Id: {0}) tillhör inte denna partner: (Id: {1})

# Domain_Payment_NoPartnerPosts_Supplied
source: No partner posts selected
da_dk: Der er ikke valgt en partnerposteringer til betaling
fo_fo: Eingin partnarabóking ásett til gjalding
nb_no: Det er ikke valgt en partnerpostering til betaling
sv_se: Inga partnerposter är valda.

# Controller_ApiFiscalSetup_Cannot_Delete_Last_User
source: Cannot delete the last user in the fiscal setup. Delete the fiscal setup instead.
da_dk: Den sidste bruger i et regnskab kan ikke slettes. Slet regnskabet i stedet.
fo_fo: Síðsti brúkari í roknskapinum kann ikki strikast. Strika roknskapin í staðin.
nb_no: Den siste bruker i et regnskap kan ikke slettes. Slett regnskapet istedenfor.
sv_se: Den sista användaren i räkenskapet kan inte raderas. Ta bort räkenskapet istället.

# Domain_Subscription_No_Orders_Created
source: Subscription ({0}) created an empty order
da_dk: Abonnement ({0}) oprettede en tom ordre
fo_fo: Hald ({0}) stovnaði tóman ordra
nb_no: Abonnement ({0}) opprettet en tom ordre

# Domain_Subscription_OrderFailedToBookkeep
source: Order from subscription failed to bookkeep
da_dk: Bogføring af ordre fra abonnement fejlede
fo_fo: Bóking av ordra frá haldi miseydnaðist
nb_no: Bokføring av ordre fra abonnement feilet

source: Transaction is involved in other transactions and cannot be cancelled.
da_dk: Transaktionen er kædet sammen med andre transaktioner og kan ikke annulleres.
nb_no: Transaksjonen er knyttet sammen med andre transaksjoner og kan ikke annulleres.

# Domain_Subscription_Activate_Already_Active
source: Subscription is already active
da_dk: Abonnement er allerede aktiveret
fo_fo: Haldið er longu virkt
nb_no: Abonnementet er allerede aktivert

# Domain_Subscription_Activate_EndDate_Before_NextRun
source: End date is before next run date
da_dk: Slutdato er før startdato
nb_no: Sluttdato er før startdato
