Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Errors.*.resx
Languages: da_dk, fo_fo, nb_no, sv_se

# Domain_Subscription_Activate_Invalid_Customer_Email
source: Customer has no valid email
da_dk: Kunden har ikke en gyldig email
fo_fo: Kundin hevur onga gildiga teldupostadressu
nb_no: Kunden har ingen gyldig e-post

# Domain_Subscription_Activate_No_Customer
source: Subscription has no customer
da_dk: Abonnement har ingen kunde
fo_fo: Haldið hevur ongan kunda
nb_no: Abonnementet har ingen kunde

# Domain_Subscription_Deactivate_Already_Inactive
source: Subscription is already inactive
da_dk: Abonnementet er allerede inaktivt
fo_fo: Haldið er longu óvirkið
nb_no: Abonnementet er allerede inaktivt

# Domain_DeleteUser_UserNotFound
source: User not found
da_dk: Bruger ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Domain_Resource_Delete_Cannot_Delete_Users_Resource
source: Cannot delete a resource which is connected to a user
da_dk: Medarbejderen kan ikke slettes da den er tilknyttet en bruger
fo_fo: Starvsfólkið kann ikki strikast tí tað er íbundið ein brúkara
nb_no: Medarbeideren kan ikke slettes, fordi den er knyttet til en bruker

# Domain_Subscription_Activate_No_SubscriptionLines
source: No subscription lines on subscription
da_dk: Ingen abonnementslinjer på abonnementet
fo_fo: Ongar vørulinjur á hald
nb_no: Ingen abonnementslinjer på abonnementet

# Domain_Subscription_Activate_SubscriptionLines_Without_Article
source: There are {0} lines without article
da_dk: Der er {0} linjer uden en vare
fo_fo: Har eru {0} linjur uttan vørur
nb_no: Der er {0} linjer uten varer

# Xena_ArticleInventoryEnabler_InventoryManagementIsEnabled
source: Inventory management is already enabled on this article
da_dk: Lagerstyring er allerede aktiveret på denne vare
fo_fo: Goymslustýring er longu virkt á vøruni
nb_no: Lagerstyring er allerede aktivert på denne varen

# Xena_ArticleInventoryEnabler_OrdertasksNotInvoiced
source: There are {0} ordertasks which are invoiced and not delivered for this article
da_dk: Der er {0} ordreopgaver som er faktureret, men ikke leveret, på denne vare.
fo_fo: Har eru {0} ordrauppgávur, sum eru faktureraðar, men ikki avhendaðar, fyri hesa vøruna.
nb_no: Der er {0} ordreoppgaver som er fakturert, men ikke levert, på denne varen.

# Xena_CreatePartnerFromDto_FiscalSetupNotFound
source: Fiscal setup not found
da_dk: Regnskabet ikke fundet
fo_fo: Roknskapurin ikki funnin
nb_no: Regnskapet finnes ikke

# Xena_CreatePartnerFromDto_NothingHasBeenDone
source: Nothing has been done
da_dk: Intet udført
nb_no: Ingenting utført

# Xena_CreatePartnerFromDto_UserNotFound
source: User not found
da_dk: Bruger ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Xena_Domain_Article_VariantCreation_No_Variants
source: No variants available for the variant range
da_dk: Ingen varianter er tilgængelig for denne variantrække
nb_no: Ingen varianter for denne variantserien

# Xena_LinkPartnerToVCard_FiscalSetupNotFound
source: Fiscal setup not found
da_dk: Regnskab ikke fundet
fo_fo: Roknskapur finst ikki
nb_no: Regnskap finnes ikke

# Xena_LinkPartnerToVCard_UserNotFound
source: User not found
da_dk: Bruger ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Xena_Notification_VCardUpdate_NoVCardFound
source: No VCard found id: {0}
da_dk: Intet VCard fundet med ID: {0}
nb_no: Ingen vCard funnet med ID: {0}

# Xena_PartnerFromSearchDtoCreator_InvalidEmail
source: Nothing to link - invalid or empty email
da_dk: Intet at forbinde - Ugyldig eller manglende email
nb_no: Ingenting å koble. Ugyldig eller manglende e-post

# Domain_FailedToInviteUser
source: Failed to invite user: {0}
da_dk: Kunne ikke invitere bruger: {0}
fo_fo: Kunne ikke invitere bruger: {0}
nb_no: Kunne ikke invitere bruker: {0}

# Xena_GetOrderFromNotification_OrderNotFound
source: Order not found
da_dk: Ordre ikke fundet
fo_fo: Ordri ikki funnin
nb_no: Ordre finnes ikke

# Xena_GetSubscriptionFromNotification_SubscriptionNoTFound
source: Subscription not found
da_dk: Abonnement ikke fundet
fo_fo: Hald finst ikki
nb_no: Abonnement ikke funnet

# Domain_Subscription_Activate_Cannot_Be_Cash_Without_Ticket
source: Subscription cannot be set to cash payment when customer has not set a paymentticket
da_dk: Abonnementet kan ikke sættes til kontant betaling før kunden har indtastet kortoplysninger
fo_fo: Haldið kann ikki setast til gjaldast kontant uttan kundin hevur sligið inn kortupplýsingar
nb_no: Abonnementet kan ikke settes til kontant betaling før kunden har inntastet kortopplysninger

# Domain_Validation_ReportLayout_Missing_Name
source: Missing name
da_dk: Manglende navn
fo_fo: Vantandi navn
nb_no: Manglende navn

# Xena_ApiFiscalSetup_CreateMembership_XenasubscriptionRequired
source: Xena subscription is required
da_dk: Xenaabonnement er påkrævet
nb_no: Xena-abonnement er nødvendig

# Xena_Domain_Validation_VatSettlementTransaction_CreateReverse_AlreadyReversed
source: Vat settlement has already been reversed
da_dk: Momsafregning er allerede annulleret
fo_fo: MVG avrokning er longu ógildað
nb_no: Momsavregning er allerede annullert

source: Cannot reverse a transaction with a payment transaction on - reverse that transaction first.
da_dk: En transaktion med betaling kan ikke annulleres. Annuller betalingen først og prøv igen.
fo_fo: Ein handil við gjalding kann ikki ógildast. Ógilda gjaldingina fyrst og royn aftur
nb_no: En transaksjon med betaling kan ikke annulleres. Annuller betalingen først og prøv igjen.

# Xena_Domain_Validation_VatSettlementTransaction_HasBeenCanceled
source: Settlement has been canceled - and cannot be paid
da_dk: Udligningen er blevet annulleret og kan ikke betales.
nb_no: Utligningen er annullert og kan ikke betales.

# Xena_Domain_Validation_VatSettlementTransaction_LedgerTag_NotFound
source: LedgerTag (id:{0}) not found.
da_dk: Finanskontoen (id: {0}) blev ikke fundet
fo_fo: Fíggjarkontoin (id: {0}) finst ikki
nb_no: Finanskontoen (id: {0}) ble ikke funnet

# Controller_ReportAccountant_InvalidEmail
source: Invalid email ({0})
da_dk: Ugyldig email ({0})
nb_no: Ugyldig e-post ({0})

source: Cannot disable variants when they have been used.
da_dk: Varianter kan ikke deaktiveres når de har været i brug.
nb_no: Kan ikke deaktivere varianter når de har vært brukt.

# Xena_Order_ProcesOrder_CannotProcess
source: Cannot process an order without partner
da_dk: Ordren kan ikke behandles uden at denne har en partner
fo_fo: Kann ikki viðgera ein ordra uttan vinnupartnara
nb_no: Kan ikke behandle en ordre uten en partner

# Xena_Public_UnsubscribeNewsLetter_InvalidEmail
source: Invalid email
da_dk: Ugyldig email
nb_no: Ugyldig e-post

# Xena_Vat_ReadVatSettlementData_FiscalPeriodNotFound
source: Fiscal period not found for next VAT period.
da_dk: Der kunne ikke findes et regnskabsår for næste momsperiode
fo_fo: Einki roknskaparár fyri næsta mvg-tíðarskeið
nb_no: Det finnes ikke et regnskapsår for neste momsperiode

# Controller_ApiFiscalSetup_MembershipNotFound
source: Membership not found
da_dk: Rettigheder ej fundet
fo_fo: Rættindi ikki funnin
nb_no: Rettigheter ikke funnet

# Controller_FiscalPeriod_MustFirstCreateAFiscalPeriod
source: You must first create a fiscalperiod
da_dk: Du skal først oprette en finansperiode
fo_fo: Tú skalt fyrst stovna eitt fíggjartíðarskeið
nb_no: Du må først opprette en finansperiode

# Domain_OrderTask_Delete_Invoiced_Delivered
source: Cannot delete an invoiced or delivered order task
da_dk: En faktureret eller leveret opgave kan ikke slettes
fo_fo: Ein fakturerað ella avhendað uppgávu kann ikki strikast
nb_no: En fakturert eller levert opgave kan ikke slettes

# Domain_VoucherDraft_Settlement_Difference_Cannot_Exceed_Allowed
source: Settlement difference cannot be greater than {0} for {1}. Difference was: {2}
da_dk: Udligningsdifferencen kan ikke være større end {0} for {1}
nb_no: Utligningsdifferansen kan ikke være større enn {0} for {1}

# Xena_Home_MergeUser_LoginNotValid
source: Login not valid
da_dk: Ugyldigt login
nb_no: Ugyldig innlogging

# Xena_Home_MergeUser_NotLoggedIn
source: Not logged in
da_dk: Ikke logget ind
fo_fo: Ikki inritaður
nb_no: Ikke logget inn

# Xena_Home_ResetPassword_NoLongerPossibleToResetPassword
source: No longer possible to reset password. Request a new password reset, if necessary
da_dk: Det er ikke længere muligt at nulstille kodeordet. Lav en ny nulstilling af kodeord hvis det stadig er nødvendigt.
fo_fo: Det er ikke længere muligt at nulstille kodeordet. Lav en ny nulstilling af kodeord hvis det stadig er nødvendigt.
nb_no: Det er ikke lenger mulig å nullstille passordet. Lag en ny nullstilling av passord hvis det er nødvendig.

# Controller_OAuth_Mismatch_ClientId_Or_ClientSecret
source: You need a correct clientid and a matching clientSecret to authorize.
da_dk: Du skal angive gyldigt ClientID og tilhørende ClientSecret for at kunne godkende.
fo_fo: Tú skalt áseta gildigt viðskiftaraeyðmerki og tilhoyrandi viðskiftaradulsmál fyri at kunna góðkenna
nb_no: Du må oppgi gyldig ClientID og tilhørende ClientSecret for å kunne godkjenne.

# Domain_Validation_WebHookSubscription_Invalid_CallbackUri
source: Callback uri is empty or not a valid URi
da_dk: Callback URL er enten tom eller ikke gyldig URL.
fo_fo: Callback URL er enten tom eller ikke gyldig URL.
nb_no: Callback URL er enten tom eller ikke en gyldig URL.

# Domain_Validation_WebHookSubscription_Invalid_EntityType
source: Invalid entity type
da_dk: Ugyldig entitetstype
nb_no: Ugyldig entitetstype

# Command_ElectronicCVRInvoice_InvalidCVR
source: {0} is not a valid OrgNumber - example: DK12345678
da_dk: {0} er ikke et gyldigt CVR nr - eksempel: DK12345678
fo_fo: {0} er ikki eitt gildigt V-tal - dømi: 592692
nb_no: {0} er ikke et gyldig CVR nr - eksempel: DK12345678

# Command_ElectronicEANInvoice_InvalidCVR
source: {0} is not a valid EAN number - use 13 digits
da_dk: {0} er ikke et gyldigt EAN-nummer, der skal være 13 tal
fo_fo: {0} ikki gildigt EAN-nummar, har skal vera 13 tøl
nb_no: {0} er ikke et gyldig EAN-nummer, det skal være 13 tall

# Command_ElectronicInvoice_Address_No_City
source: Address is invalid - no city (address: {0})
da_dk: Adressen er ugyldig - Manglende by (Addresse: {0})
fo_fo: Adressan er ógildig - manglar bý (address: {0})
nb_no: Adressen er ugyldig - Manglende by (Adresse: {0})

# Command_ElectronicInvoice_Address_No_StreetNumber
source: Address is invalid - no streetnumber (address: {0})
da_dk: Adressen er ugyldig - Manglende vejnummer (Addresse: {0})
fo_fo: Adressan er ógildig - manglar vegnummar (address: {0})
nb_no: Adressen er ugyldig - Manglende veinummer (Adresse: {0})

# Command_ElectronicInvoice_Address_No_Zip
source: Address is invalid - no zipcode (address: {0})
da_dk: Adressen er ugyldig - Manglende postnr (Addresse: {0})
fo_fo: Adressan er ógildig - manglar postnummar (address: {0})
nb_no: Adressen er ugyldig - Manglende postnr. (Adresse: {0})

# Command_ElectronicInvoice_InvalidAddressType
source: Recipient address type ({0}) is invalid. Valid types are: {1}
da_dk: Modtageradressetype ({0}) er ugyldig. Gyldige muligheder er: {1}
fo_fo: Modtageradressetype ({0}) er ugyldig. Gyldige muligheder er: {1}
nb_no: Mottakers adressetype ({0}) er ugyldig. Gyldige muligheter er: {1}

# Controller_ApiArticle_Nothing_To_Insert
source: No articles supplied for insert
da_dk: Ingen varer at indsætte
fo_fo: Ongar vørur at seta inn
nb_no: Ingen varer å sette inn

# Controller_ApiFiscalSetup_AlreadyRegistredWithSproom
source: This fiscalsetup (id: {0}) is already registrered with Sproom
da_dk: Regnskabet (id: {0}) er allerede registreret hos Sproom
fo_fo: Regnskabet (id: {0}) er allerede registreret hos Sproom
nb_no: Regnskapet (id: {0}) er allerede registrert hos Sproom

# Controller_ApiFiscalSetup_InvalidEmailAddress
source: Email is not valid ({0})
da_dk: E-mailen {0} er ikke gyldig
fo_fo: Telduposturin {0} er ikki gildigur
nb_no: E-posten {0} er ikke gyldig

# Controller_ApiFiscalSetup_OrgNumber_Already_Registered
source: The requested organization number ({0}) is already registrered with Sproom - contact Sproom at support@sproom.net for details.
da_dk: Det ønskede CVR-nummer({0}) er allerede registreret hos Sproom - kontakt Sproom på support@sproom.net for detaljer.
fo_fo: Det ønskede CVR-nummer({0}) er allerede registreret hos Sproom - kontakt Sproom på support@sproom.net for detaljer.
nb_no: Det ønskede org.nummeret ({0}) er allerede registreret hos Sproom - kontakt Sproom på support@sproom.net for detaljer.

# Domain_FiscalSetup_Sproom_Is_Already_Enabled
source: Sproom is already actived on this fiscalsetup
da_dk: Sproom er allerede aktiveret på dette regnskab
nb_no: Sproom er allerede aktivert på dette regnskapet

# Xena_DeleteExtensions_DocumentCannotBeDeleted
source: Document is referenced - and cannot be deleted.
da_dk: Dokumentet har referencer og kan derfor ikke slettes.
fo_fo: Skjalið inniheldur tilvísingar og kann tí ikki strikast
nb_no: Dokumentet har referanser og kan derfor ikke slettes.

# Xena_Domain_Order_Summary_NoOrdertasksToInvoice
source: No ordertasks to invoice.
da_dk: Der er ingen ordreopgaver til fakturering
fo_fo: Har eru ongar ordrauppgávur at fakturera
nb_no: Det er ingen ordreoppgaver å fakturere

# Domain_Ledger_Bookkeeping_Date_Outside_FiscalPeriod
source: Date {0} is outside the fiscal year {1}
da_dk: Datoen {0} er udenfor regnskabsåret {1}
fo_fo: Dagfestingin {0} er uttanfyri roknskaparárið {1}
nb_no: Datoen {0} er utenfor regnskapsåret {1}

# Domain_Ledger_Bookkeeping_Deactivated
source: {0} ({1}) is deactivated
da_dk: {0} ({1}) er deaktiveret
fo_fo: {0} ({1}) er óvirkt
nb_no: {0} ({1}) er deaktivert

# Domain_Ledger_Bookkeeping_FiscalPeriod_IsClosed
source: Fiscal period {0} is closed
da_dk: Regnskabsåret {0} er lukket
fo_fo: Roknskaparárið ({0}) er læst
nb_no: Regnskapsåret {0} er lukket

# Domain_Ledger_Bookkeeping_No_FiscalPeriod
source: Fiscal period is missing
da_dk: Regnskabsåret mangler
fo_fo: Roknskaparárið manglar
nb_no: Regnskapsåret mangler

# Domain_Ledger_Bookkeeping_Voucher_Not_Balanced
source: Voucher {0} does not balance on {1} - difference is: {2}
da_dk: Bilag {0} balancerer ikke på {1}, differencen er: {2}
fo_fo: Fylgiskjal {0} javnvigar ikki á {1}, munurin er: {2}
nb_no: Bilag {0} balanserer ikke på {1}. Differansen er: {2}

# Domain_Ledger_Missing_Description
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Domain_VoucherDraft_Bookkeeping_FiscalPeriod_Is_Closed
source: Fiscal period {0} is closed
da_dk: Regnskabsåret {0} er lukket
fo_fo: Roknskaparárið ({0}) er læst
nb_no: Regnskapsåret {0} er lukket

# Xena_Document_DeleteDocumentRelation_CannotDeleteDocumentsRemindersOrInvoices
source: Cannot delete documents that are invoices or reminders.
da_dk: Kan ikke slette dokumenter der er faktura eller rykkere
fo_fo: Kann ikki strika skjal sum er fakturi ella rykkjari
nb_no: Kan ikke slette dokumenter som er faktura eller purringer

# Xena_Document_NewVersionFromXenaDocument_NotAllowed
source: Not allowed to this file as a new version
da_dk: Det er ikke tilladt at tilføje en ny version til dette dokument
fo_fo: Tað ber ikki til at leggja eina útgávu aftrat hetta skjalið
nb_no: Det er ikke tillatt å tilføye en ny versjon til dette dokumentet

# Xena_Document_NotPossibleToCreateDocument
source: Not possible to create document
da_dk: Det er ikke muligt at oprette dokument
fo_fo: Ber ikki til at stovna skjal
nb_no: Det er ikke mulig å opprette dokumentet

# Xena_Document_NotPossibleToFindDocument
source: Not possible to find document
da_dk: Det lykkedes ikke at finde dokumentet
fo_fo: Skjalið fanst ikki
nb_no: Kan ikke å finne dokumentet

# Xena_Document_PostDocumentFromUrlByTyped
source: Failed to create document
da_dk: Fejlede i oprettelsen af dokumentet
fo_fo: Brek í stovning av skjali
nb_no: Feil i opprettelsen av dokumentet

# Xena_Document_PostRelationCommand_DocumentIsAlreadyConnected
source: Document is already connected
da_dk: Dokumentet er allerede forbundet
fo_fo: Skjal er longu íbundið
nb_no: Dokumentet er allerede tilknyttet

# Xena_Document_PostRelationCommand_EntityTypeIsNotSupported
source: Entity type: {0} not supported
da_dk: Entitetstypen {0} er ikke understøttet
fo_fo: Entity týpa riggar ikki
nb_no: Entitetstypen {0} er ikke understøttet

# Domain_Bookkeeping_LedgerPostDraft_Invalid_VatDeductionPercentage
source: Vat deduction percentage must be between 0 and 100.
da_dk: Momsfradragsprocent skal være mellem 0 og 100
fo_fo: MVG frádráttar prosent má vera millum 0 og 100
nb_no: Momsfradragsprosenten skal være mellom 0 og 100

# Xena_ApiFiscalSetup_CreateMembership_CreditCardRequired
source: You cannot add a new user without having a credit card connected with your Xena subscription
da_dk: Du kan ikke tilføje en ny bruger uden at have et betalingskort tilknyttet dit Xena abonnement
fo_fo: Tú kanst ikki íbinda ein nýggjan brúkara uttan eitt gjaldskort er íbundið títt Xena hald
nb_no: Du kan ikke tilføye en ny bruker uten å ha et betalingskort tilknyttet ditt Xena-abonnement

# Xena_ApiFiscalSetup_DeleteMembership_CreditCardRequired
source: You must register your credit card in order to keep support
da_dk: Du skal have et betalingskort tilknyttet for at beholde support
fo_fo: Tú mást hava gjaldskort íbundið fyri at fáa support
nb_no: Du må ha et betalingskort tilknyttet for å beholde support

# Xena_ApiFiscalSetup_RequestSupport_CreditCardRequired
source: You cannot request support without having a credit card connected with your Xena subscription
da_dk: Du kan ikke få support uden at have et betalingskort tilknyttet dit Xena-abonnement
fo_fo: Tú kanst ikki fáa support uttan eitt gjaldskort er íbundið títt Xena hald.
nb_no: Du kan ikke få support uten å ha et betalingskort tilknyttet ditt Xena-abonnement

# Xena_FiscalSetup_InviteUser_FiscalSetupNoFound
source: Fiscalsetup not found
da_dk: Regnskab ikke fundet
fo_fo: Roknskapur varð ikki funnin
nb_no: Regnskap ikke funnet

# Xena_FiscalSetup_InviteUser_UserHasAccess
source: User ({0}) already has access
da_dk: Brugeren ({0}) har allerede adgang
fo_fo: Brúkarin ({0}) hevur longu atgongd
nb_no: Brukeren ({0}) har allerede adgang

# Xena_FiscalSetup_UpdateVCardPicture_DocumentNotFound
source: Document not found
da_dk: Dokumentet blev ikke fundet
fo_fo: Skjal varð ikki funnið
nb_no: Dokumentet ble ikke funnet

# Xena_FiscalSetup_UpdateVCardPicture_FiscalSetupDoesNotHaveAVcard
source: Fiscalsetup does not have a vcard
da_dk: Regnskabet har ikke et vCard
fo_fo: Roknskapurin hevur einki vCard
nb_no: Regnskapet har ikke et vCard

# Xena_InvitePartner_PartnerNotFound
source: Partner not found
da_dk: Partneren blev ikke fundet
fo_fo: Vinnupartnari varð ikki funin
nb_no: Partneren ble ikke funnet

# Xena_InvitePartner_VCardNotFound
source: VCard not found
da_dk: Vcardet blev ikke fundet
nb_no: vCardet ble ikke funnet

# Xena_Partner_ResendPartnerInvitation_NotAValidEmail
source: Not a valid email
da_dk: Ikke en gyldig email
fo_fo: Ikki gildigur teldupostur
nb_no: Ikke en gyldig e-post

# Xena_Partner_ResendPartnerInvitation_UserNotFound
source: User not found
da_dk: Brugeren blev ikke fundet
fo_fo: Brúkari ikki funnin
nb_no: Brukeren ble ikke funnet

# Domain_Subscription_Activate_NextRunDate_Before_StartDate
source: Next run date is before start date
da_dk: Datoen for næste kørsel er før abonnementets startdato
fo_fo: Dagfesting fyri næsta koyring er áðrenn haldsbyrjan
nb_no: Datoen for neste kjøring er før abonnementets startdato

# Xena_Partner_MailHistory_MustHaveMailIdentifier
source: Partner mail history entry must have a unique identifier!
da_dk: Partner email-historik skal have en unik nøgle!
fo_fo: Partner email-historik skal have en unik nøgle!
nb_no: E-post-historikk over partner må ha en en unik nøkkel!

# Xena_Partner_MailHistory_MustHavePartner
source: Partner mail history entry must have a partner!
da_dk: Partner email-historik skal have en partner!
fo_fo: Partner email-historik skal have en partner!
nb_no: E-post-historikk over partner må ha en partner!

# Xena_Partner_MailHistory_MustHaveResource
source: Partner mail history entry must have a resource!
da_dk: Partner email-historik skal have en medarbejder!
fo_fo: Partner email-historik skal have en medarbejder!
nb_no: E-post-historikk over partner må ha en medarbeider!

# Domain_Ledger_Bookkeep_Warning_Posting_On_Existing_Voucher
source: There will be posted on existing voucher ({0})
da_dk: Der vil blive posteret på eksisterende bilag! (Bilag {0})
fo_fo: Bókast á verandi fylgiskjali! (Fylgiskjal {0})
nb_no: Det vil bli postert på et eksisterende bilag! (Bilag {0})

# Domain_Ledger_Bookkeep_Warning_Posting_In_Future
source: The following vouchers are in the future: ({0})
da_dk: Følgende bilag har en dato som er i fremtiden: {0}
fo_fo: Følgende bilag har en dato som er i fremtiden: {0}
nb_no: Følgende bilag har en dato som er frem i tid: {0}

# Xena_Document_MoveInboxRelation_RelationNotFound
source: Relation to this document has not been found
da_dk: Relationen til dette dokument blev ikke fundet
fo_fo: Relationen til dette dokument blev ikke fundet
nb_no: Relasjonen til dette dokument ble ikke funnet

# Xena_Document_MoveInboxRelation_ResourceNotFound
source: Resource not found
da_dk: Medarbejderen blev ikke fundet
fo_fo: Starvsfólkið ikki funnið
nb_no: Medarbeideren ble ikke funnet

# Domain_Ledger_Bookkeep_Warning_Different_Vat_From_Default
source: Voucher(s) {0} have a different VAT code from what as default on the ledger tag
da_dk: Bilag(ene) {0} har en anden momskode end er standard på kontoen.
fo_fo: Fylgiskjal(skjøl) {0} hevur/hava eina MVGkotu, ið ikki samsvarar við MVGkotu á kontoini.
nb_no: Bilag(ene) {0} har en momskode som er annerledes enn standard på kontoen.

# Xena_PrimoPostDeleter_CannotDeleteThisPrimoPost
source: Cannot delete this primopost
da_dk: Denne primopostering kan ikke slettes
fo_fo: Hendan byrjanarbókingin kann ikki strikast
nb_no: Dette åpningstallet kan ikke slettes

# Domain_Reconciliation_Cannot_Use_Same_Ledgertag_As_BankContext
source: Cannot use the ledger tag that is on the bankcontext.
da_dk: Bankkontoen kan ikke anvendes som differencekonto
fo_fo: Bankakontoin kann ikki ásetast sum munarkonto
nb_no: Bankkontoen kan ikke settes som differansekonto

# Domain_Activity_Missing_Abbreviation
source: Missing abbreviation
da_dk: Manglende forkortelse
fo_fo: Vantandi stytting
nb_no: Manglende forkortelse

# Domain_Activity_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse

# Domain_PartnerResourceContext_Cannot_Have_API_Access_On_Xena_User
source: Cannot create API keys on users with access to Xena via OAuth2
da_dk: Der kan ikke oprettes API-nøgler på brugere som har adgang via OAuth2
fo_fo: API-lyklar kunnu ikki stovnast á brúkarum við atgongd umvegis OAuth2
nb_no: Det kan ikke opprettes API-nøkler på brukere som har adgang via OAuth2

# Domain_PriceDiscountAgreement_Invalid_Discount_Percentage
source: Discount percentage must be between 0 and 100
da_dk: Rabatprocent skal være mellem 0 og 100
fo_fo: Avsláttarprosentur má vera millum 0 og 100
nb_no: Rabattprosent må være mellom 0 og 100

# Domain_PriceDiscountAgreement_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse

# Domain_PriceGroup_Invalid_ContextType
source: Invalid context type
da_dk: Ugyldig konteksttype
nb_no: Ugyldig konteksttype

# Domain_PriceGroup_Missing_Description
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse

# Domain_ResourcePost_NextAppointment_Is_Before
source: End time ({0} {1}) is before appointments start ({2} {3})
da_dk: Sluttidspunktet({0} {1}) er før aftalens start ({2} {3})
nb_no: Sluttidspunktet({0} {1}) er før avtalens start ({2} {3})
