Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Errors.*.resx
Languages: da_dk, fo_fo, nb_no, sv_se

# Deleters_OrderLine_Cannot_Delete_Invoiced_OrderLines
source: Cannot delete invoiced order lines
da_dk: Fakturerede varelinjer kan ikke slettes
fo_fo: Faktureraðar vørylinjur kunnu ikki slettast
nb_no: Fakturerte varelinjer kan ikke slettes

# Domain_Validation_Article_Already_Is_Bundle
source: Article is already marked as a bundle
da_dk: Varen har allerede en stykliste
nb_no: Varen har allerede en stykkliste

# Domain_Validation_Article_InventoryManagement_Cannot_Be_Bundle
source: Bundled articles cannot have inventory management
da_dk: En vare med stykliste kan ikke have lagerstyring
fo_fo: Ein vøra við stykkjalista kann ikki hava goymslustýring
nb_no: En vare med stykkliste kan ikke ha lagerstyring

# Domain_Validation_Article_Variants_Cannot_Be_Bundle
source: Bundled articles cannot have variants
da_dk: En vare med stykliste kan ikke have varianter
fo_fo: Ein vøra við stykkjalista kann ikki hava variantar
nb_no: En vare med stykkliste kan ikke ha varianter

# Domain_Validation_BundledArticle_CannotHaveInventoryManagement
source: Bundled articles cannot have inventory management
da_dk: En vare med stykliste kan ikke have lagerstyring
fo_fo: Ein vøra við stykkjalista kann ikki hava goymslustýring
nb_no: En vare med stykkliste kan ikke ha lagerstyring

# Domain_Validation_BundledArticle_CannotHaveVariants
source: Bundled articles cannot have variants
da_dk: En vare med stykliste kan ikke have varianter
fo_fo: Ein vøra við stykkjalista kann ikki hava variantar
nb_no: En vare med stykkliste kan ikke ha varianter

# Domain_Validation_LedgerTagGroup_Description_Missing
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Xena_Domain_Validation_Article_Already_Has_InventoryManagement
source: Article already has inventory management
da_dk: Varen har allerede lagerstyring
nb_no: Varen har allerede lagerstyring

# Xena_Subscription_ExecuteSubscriptions_MissingData
source: Missing data to complete online payments
da_dk: Mangler data for at kunne færdiggøre online betaling
fo_fo: Vantar data fyri at kunna útinna online gjalding
nb_no: Mangler data for å kunne fullføre online betaling

# ArticleBundleEnabler_On_Bundle
source: Article is used on bundled article: {0}
da_dk: Varen er brugt som en del af en stykliste på: {0}
nb_no: Varen er brukt som en del av en stykkliste på: {0}

# Command_UserCommand_XenaSubscription_Creditcard_Required
source: You cannot add a new user without having a credit card connected with your Xena subscription
da_dk: Du kan ikke tilføje en ny bruger uden at have et betalingskort tilknyttet dit Xena abonnement
fo_fo: Du kan ikke tilføje en ny bruger uden at have et betalingskort tilknyttet dit Xena abonnement
nb_no: Du kan ikke tilføye en ny bruker uten å ha et betalingskort tilknyttet ditt Xena-abonnement

# Command_UserCommand_XenaSubscription_Inactive
source: Xena subscription is inactive
da_dk: Xena abonnementet er inaktivt
fo_fo: Xena hald er óvirkið
nb_no: Xena-abonnementet er inaktivt

# Updater_OrderPayer_No_Vouchers
source: No vouchers to pay
da_dk: Ingen bilag til betaling
fo_fo: Einki fylgisskjal til gjalding
nb_no: Ingen bilag til betaling

# Creator_Order_Invalid_ContextType
source: ContextType: {0} is not valid. Valid choices are: {1}
da_dk: Konteksttypen {0} er ikke gyldig. Gyldige muligheder er: {1}
fo_fo: Høpistýpan {0} er ikki gildig. Gildigar møguleikar er: {1}
nb_no: Konteksttypen {0} er ikke gyldig. Gyldige muligheter er: {1}

# Command_OnlinePartnerPostPayment_DataTemperedWith
source: Data has been tempered with, and the payment can therefore not be registered as completed
da_dk: Kortet kunne ikke registreres (Hashtjek fejlede)
fo_fo: Data eru broyttar og gjalding kann tí ikki skrásetast
nb_no: Dataene er blitt endret, og betalingen kan derfor ikke registreres.

# Command_OnlinePartnerPostPayment_MD5KeyMissing
source: The provider of this payment has deactivated online payment
da_dk: Modtageren af betalingen har deaktiveret online betaling
fo_fo: Móttakarin hevur óvirkt online gjalding
nb_no: Mottakeren har deaktivert online betaling

# Command_OnlinePartnerPostPayment_UnableToParseId
source: Unable to parse id: {0}
da_dk: Ikke muligt at behandle id: {0}
nb_no: Ikke muligt at behandle id: {0}

# Xena_ApiFiscalSetup_DeleteMembership_XenaSubscriptionMustBeActive
source: Xena subscription must be active
da_dk: Xenaabonnementet skal være aktivt
nb_no: Xena-abonnementet skal være aktivt

# Domain_Vat_Invalid_ExistingVatCode
source: Vat code is already used
da_dk: Momskoden er allerede brugt
fo_fo: MVG kota er longu nýtt
nb_no: Momskoden er allerede brukt

# Command_BulkInsertBarcode_Duplicate_EANNumbers
source: Following EAN Numbers are have duplicates: {0}
da_dk: Følgende EAN numre har dublikater
nb_no: Følgende EAN-numre har duplikater

# Command_BulkInsertBarcode_Missing_ArticleNumber
source: No matching articles with article number: ({0}) have been found
da_dk: Fandt ikke varenummer: ({0})
nb_no: Fant ikke varenummer: ({0})

# Command_BulkInsertBarcode_Missing_EANNumber
source: {0} importlines had no EANNumber
da_dk: {0} linjer havde ikke et EAN nummer
nb_no: {0} linjer hadde ikke et EAN-nummer

# Command_CopyArticle_ArticleNumber_Exists
source: Article number: {0} already exists
da_dk: Varenummer: {0} eksisterer allerede
nb_no: Varenummer: {0} eksisterer allerede

# Command_InsertBarCodesOnOrder_OrderNotFound
source: Order not found
da_dk: Ordre ikke fundet
nb_no: Ordren ble ikke funnet

# Command_InsertBarCodesOnOrder_TaskNotFound
source: Task not found
da_dk: Opgave ikke fundet
fo_fo: Uppgáva ikki funnin
nb_no: Oppgaven ble ikke funnet

# Controller_ApiBarcode_Nothing_To_Insert
source: Nothing to insert
da_dk: Igenting at indsætte
nb_no: Ingenting å sette inn

# Updater_Barcode_EAN_Already_Exists
source: EAN Number already exists
da_dk: EAN nummer findes allerede
nb_no: EAN-nummeret finnes allerede

# Xena_Domain_Validation_ArticleEANNumber_Quantity_Cannot_Be_NonPositive
source: Quantity cannot be non-positive
da_dk: Antal kan ikke være negativ eller nul
nb_no: Antall

# Deleters_PartnerCustomerContext_Has_PartnerPosts
source: Partner has customer posts
da_dk: Partneren har kundeposteringer
fo_fo: Vinnupartnarin hevur kundabókingar
nb_no: Partneren har kundeposteringer

# Deleters_PartnerCustomerContext_Has_PriceDiscountAgreements
source: Partner has price discount agreements
da_dk: Partner har rabat prisaftaler
fo_fo: Vinnupartnari hevur avsláttarprísavtalur
nb_no: Partneren har rabattavtaler

# Deleters_PartnerCustomerContext_Has_Subscriptions
source: Partner has subscriptions
da_dk: Partneren har abonnementer
fo_fo: Vinnupartnarin hevur høld
nb_no: Partneren har abonnementer

# Deleters_PartnerSupplierContext_Has_PartnerPosts
source: Partner has supplier posts
da_dk: Partneren har leverandør posteringer
fo_fo: Vinnupartnarin hevur leverandør bókingar
nb_no: Partneren har leverandørposteringer

# Updater_Location_Already_Exists
source: Location already exists
da_dk: Lokation findes allerede
nb_no: Lokasjonen finnes allerede

# Updater_OrderReceptionDraft_Resource_Not_Allowed
source: Resource (id: {0}, name: {1}) is not allowed to create order reception drafts - must have "Show in order" set to true.
da_dk: Medarbejderen (id: {0}, navn: {1}) har ikke rettigheder til at lave kladder i ordremodtagelsen - vedkommende skal have rettigheden "Vis på ordre".
nb_no: Medarbeideren (id: {0}, navn: {1}) har ikke rettigheter til å lage kladder i ordremottagelsen - vedkommende skal ha rettigheten "Vis på ordre".

# Xena_Bookkeeping_OCRClient_ErrorOccured
source: Error while processing the task - Task status was: {0}
da_dk: Der opstod en fejl under behandlingen - Opgavestatusen var: {0}
nb_no: Det oppstod en feil under behandlingen. Oppgavestatusen var: {0}

# Xena_Bookkeeping_OCRClient_NotEnoughCredits
source: Not enough credits to process the file. Please add more pages to your application balance.
da_dk: Ikke nok kredit til OCR behandling af filen. Venligst tilføj flere sider til din konto.
nb_no: Ikke nok kreditt til å OCR-behandle filen. Vennligst tilføy flere sider til kontoen din.

# Xena_Bookkeeping_ParseVoucherCommand_VoucherPreviewExists
source: Voucher preview has already been created manually for resource inbox document relation (id: {0})
da_dk: Bilagskladden er allerede oprettet manuelt for medarbejder indbakke dokumentation relationen (id: {0})
nb_no: Bilagskladden er allerede opprettet manuelt for medarbeider innboks dokumentasjon relasjon (id: {0})

# Updater_AddtionalArticle_Parent_Cannot_Equal_Child
source: Cannot select the same article as additional on it self
da_dk: En vare kan ikke have sig selv som følgevare
nb_no: En vare kan ikke ha seg selv som følgevare

# Domain_ArticleRelocationTask_Cannot_Move_More_Than
source: Cannot move more than set on line
da_dk: Du kan ikke flytte flere end angivet på linjen
nb_no: Du kan ikke flytte flere enn angitt på linjen

# Domain_ArticleRelocationTask_Cannot_Move_Negative_Quantity
source: Cannot move a negative quantity
da_dk: Du kan ikke flytte negativt antal
nb_no: Du kan ikke flytte et negativt antall

# Domain_ArticleRelocationTask_Locations_Are_Equal
source: To and from locations are the same
da_dk: Til og fra lokation er ens
nb_no: Til og fra lokasjon er like

# Command_RequestFree_HaveMoreThanOneUser
source: You cannot downgrade to a Free Xena subscription with more than one user requiring payment.
da_dk: Du kan ikke nedgradere når du har mere end 1 bruger.
nb_no: Du kan ikke nedgradere når du har mer enn 1 bruker.

# Command_RequestFree_HaveVirtualUsers
source: You cannot downgrade to a Free Xena subscription with API-keys.
da_dk: Du kan ikke nedgradere når du har API-nøgler.
nb_no: Du kan ikke nedgradere når du har API-nøkler.

# Commands_CreateApiUser_NeedPremium_Subscription
source: You need a Premium Xena subscription to create API users
da_dk: Du skal have Xena Premium for at oprette API-nøgler
nb_no: Du skal ha Xena Premium for å opprette API-nøkler

# Commands_RequestPremium_Already_Free
source: You already have a Free Xena subscription
da_dk: Du har allerede et Xena Free abonnement
nb_no: Du har allerede et Xena Free-abonnement

# Commands_RequestPremium_Already_Premium
source: You already have a Premium Xena subscription
da_dk: Du har allerede et Xena Premium abonnement
nb_no: Du har allerede et Xena Premium-abonnement

# Commands_RequestPremium_NoCreditCard
source: You need to register a credit card to get Xena Premium.
da_dk: Du skal registrere et betalingskort for at få Xena Premium
nb_no: Du skal registrere et batlingskort for å få Xena Premium

# Domain_Supporter_Is_Not_XenaSupporter
source: User is not marked as a Xena supporter
da_dk: Brugeren er ikke markeret som supporter
nb_no: Brukeren er ikke markert som Xena-supporter

# Limitied_Functionality_Article_NoMoreThan10InventoryManaged
source: You need a premium subscription to have more than 10 articles with inventory management
da_dk: Du skal have Xena Premium for at oprette mere end 20 varer med lagerstyring
nb_no: Du skal ha Xena Premium for å opprette mer enn 10 vaerer med lagerstyring

# Limitied_Functionality_Bookkeeping_NoMoreThan10Lines
source: You need a premium subscription to bookkeep more than 20 lines at a time in the ledger.
da_dk: Du skal have Xena Premium for at bogføre mere end 20 linjer ad gangen i kassekladden.
nb_no: Du skal har Xena Premium for å bokføre mer enn 10 linjer om gangen i kassakladden.

# Updater_Supporter_UserIsNotSupporter
source: User is not a Xena supporter
da_dk: Brugeren er ikke en Xena Supporter
nb_no: Brukeren er ikke en Xena-supporter

# Command_SetXenaAdvertisment_UpgradeToPremium
source: Upgrade to Premium to set this
da_dk: Opgrader til Premium for at ændre denne
nb_no: Oppgrader til Premium for å endre denne

# Query_Cannot_Be_Sent_Electonically
source: Invoice cannot be sent electronically - unsupported scenario.
da_dk: Fakturaen kan ikke sendes elektronisk - scenariet er ikke understøttet
nb_no: Fakturaen kan ikke sendes elektronisk

# Command_ParseVoucherCommand
source: Fremium user reached max in monthly free parsings (fiscalId: {0})
da_dk: Gratisbruger har nået maksimum af gratis bilagsaflæsninger(regnskabid: {0})
nb_no: Premium-bruker nådde max antall gratis parsings for denne måneden (fiscalId: {0})

# Commands_DeleteArticlesInArticleGroup_NothingToDelete
source: Nothing to delete
da_dk: Intet at slette
nb_no: Ingenting å slette

# Limitied_Functionality_Bookkeeping_NoMoreThan20Lines
source: You need a premium subscription to bookkeep more than 20 lines at a time in the ledger.
da_dk: Du skal have Xena Premium for at bogføre mere end 20 linjer ad gangen i kassekladden.
nb_no: Du skal har Xena Premium for å bokføre mer enn 20 linjer om gangen i kassakladden.

# Domain_EconomicTransaction_SystemDifference_Too_Large
source: On voucher {0}, {1} system difference is too high. Difference is {2} {3}, allowed difference for {3} is {4}.
da_dk: Bilag {0} d. {1}: Differencen på {2} {3} er for høj. Højeste tilladte difference for {3} er {4}.
nb_no: Bilag {0} d. {1}: Differansen på {2} {3} er for høy. Den høyeste tillatte differansen for {3} er {4}.

# Domain_User_NameMustBeSet
source: User name must be set
da_dk: Brugernavn skal angives
nb_no: Brukernavn skal angis

# Updater_FiscalPeriod_CannotAddPeriodWhenPrimoposts
source: You cannot add a period before existing periods, when they have primoposts in the income section.
da_dk: Du kan ikke oprette en finansperiode før eksisterende periode når disse har primoposter i resultatopgørelsen.
nb_no: Du kan ikke oprette en finansperiode før eksisterende periode når disse har åpningstall i resultatoppgjøret.

# Updater_FiscalPeriod_CannotOverlap
source: You cannot create periods that overlap others.
da_dk: Du kan ikke oprette perioder der overlapper.
nb_no: Du kan ikke opprette perioder som overlapper.

# Updater_FiscalPeriod_LedgerPostsEnterNewPeriod
source: Cannot update end of fiscal period when existing ledger posts would enter new period
da_dk: Slutdatoen går ind i en eksisterende regnskabsperiode, det er ikke tilladt.
nb_no: Sluttdatoen er i en eksisterende regnskapsperiode; det er ikke tillatt.

# Updater_FiscalPeriod_LedgerPostsNoPeriod
source: Cannot update end of fiscal period when existing ledger posts would have no period
da_dk: Slutdatoen kan ikke justeres da der ligger finansposteringer mellem den nye og gamle slutdato.
nb_no: Sluttdatoen kan ikke justeres, ettersom det ligger finansposteringer mellom den nye og gamle sluttdatoen.

# Updater_FiscalPeriod_MustBeTheDayBeforeFirstDayOfNextPeriod
source: Fiscal period end must be the day before the first day in the next period ({0}).
da_dk: Regnskabsperioden skal slutte dagen før den næste periode starter({0}).
nb_no: Regnskabsperioden skal slutte dagen før den neste periode starter({0}).

# Updater_FiscalPeriod_MustCoverOneDay
source: Fiscal periods must cover a period of at least one day.
da_dk: Regnskabsperioden skal have en længde af mindst 1 dag.
nb_no: Regnskapsperioden skal vare minst 1 dag.

# Updater_FiscalPeriod_NextDayAfterLastDayInPrevious
source: Fiscal period start must be the next day after the last day in the previous period ({0}).
da_dk: Regnskabsperioden skal starte dagen efter slutdatoen i foregående periode({0}).
nb_no: Regnskapsperioden skal starte dagen etter sluttdatoen i foregående periode({0}).

# Updater_FiscalPeriod_PeriodsAfter
source: Cannot update end of fiscal periood when there are periods after
da_dk: Slutdatoen på regnskabsperioden kan ikke opdateres når der er efterfølgende regnskabsperioder.
nb_no: Sluttdatoen på regnskapsperioden kan ikke oppdateres når det er etterfølgende regnskapsperioder.

# Updater_FiscalPeriod_PeriodsBefore
source: Cannot update start of fiscal period when there are periods before
da_dk: Regnskabsperiodens start kan ikke opdateres når der er foregående regnskabsperioder.
nb_no: Regnskapsperiodens start kan ikke oppdateres når det er foregående regnskapsperioder.

# Updater_Supporter_Duplicate
source: Already added as supporter
da_dk: Supporteren er allerede tilføjet
nb_no: Supporteren er allerede tilføyd

# Xena_Domain_Bookkeeping_EconomicTransaction_Warning_SystemDifference_On_Vouchers
source: The following vouchers will bookkeep system differences: {0}.
da_dk: Følgende bilag vil bogføre på differencekontoen: {0}
nb_no: Følgende bilag vil bokføres på differansekontoen: {0}
