Repository: EG-BRS/Xena.Contracts
Catalog: Xena.Resources/Errors.*.resx
Languages: da_dk, fo_fo, nb_no, sv_se

# Xena_ApiFiscalSetup_CreateApiUser_PartnerNotFound
source: Partner not found
da_dk: Partneren blev ikke fundet
fo_fo: Vinnupartnari varð ikki funin
nb_no: Partneren ble ikke funnet

# Command_ChangePassword_OldPassword
source: Old password is incorrect
da_dk: Den gamle kode er ikke korrekt
fo_fo: Gomul kota ikki rætt
nb_no: Det gamle passordet er ikke korrekt

# Command_MoveInvoiceToInbox_InvoiceNotFound
source: Invoice not found
da_dk: Faktura ikke fundet
fo_fo: Fakturi ikki funnin
nb_no: Faktura ikke funnet

# Command_MoveInvoiceToInbox_NoResource
source: Current user has no resource
da_dk: Aktuel bruger har ingen ressource
fo_fo: Núverandi brúkari hevur onga resursu
nb_no: Aktuell bruker har ingen ressurs

# Command_MoveInvoiceToInbox_NotLoggedIn
source: You are not logged in
da_dk: Du er ikke logget ind
fo_fo: Tú ert ikki innritað/ur
nb_no: Du er ikke logget inn

# Controller_Oauth_Login_YouNeedAClient
source: You need a client to authorize.
da_dk: Du skal have en klient for at kunne lave en godkendelse.
fo_fo: Tú skalt hava ein viðskiftara fyri at kunna góðkenna
nb_no: Du må ha en klient for å kunne lage en godkjennelse.

# Domain_PriceDiscountAgreement_ValidFrom_IsLaterThan_ValidTo
source: Valid from must be before valid to
da_dk: "Gyldig fra" skal være før "Gyldig til"
fo_fo: "Gildigur frá" má vera áðrenn "Gildigur til"
nb_no: "Gyldig fra" må være før "Gyldig til"

# Domain_VolumePriceAgreement_ValidFrom_IsLaterThan_ValidTo
source: Valid from must be before valid to
da_dk: "Gyldig fra" skal være før "Gyldig til"
fo_fo: "Gildigur frá" má vera áðrenn "Gildigur til"
nb_no: "Gyldig fra" må være før "Gyldig til"

# Xena_Document_MoveDocumentToNewInbox_DocumentAlreadyConnected
source: Document is already connected
da_dk: Dokumentet er allerede tilknyttet
fo_fo: Skjal er longu íbundið
nb_no: Dokumentet er allerede tilknyttet

# Xena_Document_MoveDocumentToNewInbox_DocumentNotFound
source: Document not found
da_dk: Dokumentet blev ikke fundet
fo_fo: Skjal varð ikki funnið
nb_no: Dokumentet ble ikke funnet

# Domain_PaymentMeans_Invalid_PaymentMeansType
source: Invalid payment means type: {0}. Valid payment means types are: {1}
da_dk: Ugyldig betalingstype: {0}. Gyldige betalingstyper er: {1}
nb_no: Ugyldig betalingstype: {0}. Gyldige betalingstyper er: {1}

# Domain_Validation_PaymentMeans_Bank_Invalid_Account
source: Missing bank account
da_dk: Mangler bankkonto
fo_fo: Vantandi bankakonto
nb_no: Mangler bankkonto

# Domain_Validation_PaymentMeans_DK_Bank_InvalidAccountNumber
source: Danish bankaccounts have 4 - 10 digits and may have optional spaces in the account number
da_dk: Danske bankkonti skal have 4-10 cifre og kan have valgfri mellemrum.
fo_fo: Danskar bankakontoir skulu hava 4-10 tøl og kunnu hava valfrí millumrúm
nb_no: Danske bankkonti må ha 4-10 sifre og kan ha valgfrie mellomrom.

# Domain_Validation_PaymentMeans_DK_Bank_InvalidRegNumber
source: Danish banks have a four-digit registration number that you need to supply
da_dk: Danske banker har et 4-cifret registreringsnummer som skal oplyses
fo_fo: Danskir bankar hava 4-tals skrásetingarnummar, sum skal upplýsast
nb_no: Danske banker har et 4-sifret registreringsnummer som må opplyses

# Domain_Validation_PaymentMeans_DK_FIK_InvalidAccountNumber
source: The supplier number needs to be 8 digits without spaces
da_dk: Leverandørnummeret skal være 8 cifre uden mellemrum
fo_fo: Leverandørnr má vera 8 tøl
nb_no: Leverandørnummeret må være 8 siffer uten mellomrom

# Domain_Validation_PaymentMeans_DK_Giro_InvalidAccountNumber
source: All Danish giro accounts have a 7 digit number without spaces
da_dk: Alle danske girokonti har et 7-cifret nummer uden mellemrum.
fo_fo: Allir danskir girokontoir hava 7 tøl uttan millumrúm
nb_no: Alle danske girokonti har et 7-sifferet nummer uten mellomrom

# Domain_Validation_PaymentMeans_Iban_InvalidIBANCode
source: IBAN accountnumbers are 2 letters, 2 digits and then up to 30 letters/digits with optional spaces
da_dk: IBAN kontonumre er 2 bogstaver, 2 tal og herefter op til 30 bogstaver/tal med valgfrie mellemrum.
fo_fo: IBAN kontonumre er 2 bogstaver, 2 tal og herefter op til 30 bogstaver/tal med valgfrie mellemrum.
nb_no: IBAN-kontonumre er 2 bokstaver, 2 tall og deretter opptil 30 bokstaver/tall med valgfrie mellomrom.

# Domain_Validation_PaymentMeans_Iban_Swift_InvalidIBANCode
source: IBAN codes have 2 letters, then 2 digits and then up to 30 letters/digits - and optional spaces
da_dk: IBAN koder er 2 bogstaver, 2 tal og herefter op til 30 bogstaver/tal med valgfrie mellemrum.
fo_fo: IBAN koder er 2 bogstaver, 2 tal og herefter op til 30 bogstaver/tal med valgfrie mellemrum.
nb_no: IBAN-koder er 2 bokstaver, 2 tall og deretter opptil 30 bokstaver/tall med valgfrie mellomrom.

# Domain_Validation_PaymentMeans_Iban_Swift_InvalidSWIFTCode
source: SWIFT codes has 6 letters and then 2-5 letters/digits - no spaces allowed
da_dk: SWIFT koder er 6 bogstaver, 2-5 bogstaver/tal. Mellemrum er ikke tilladt.
nb_no: SWIFT-koder er 6 bokstaver og 2-5 bokstaver/tall. Mellomrom er ikke tillatt.

# Domain_Validation_PaymentMeans_InvalidPaymentMeansType
source: Payment means must have a valid payment means type. Valid choices are: {0}
da_dk: Betalingsmåde skal have gyldig betalingsmådetype. Gyldige typer er: {0}
fo_fo: Gjaldsháttur má hava gildig týpu. Gildigar týpur eru: {0}
nb_no: Betalingsmåte må ha gyldig betalingsmåte-type. Gyldige typer er: {0}

# Domain_Validation_PaymentMeans_NO_Bank_Invalid_Control_Cipher
source: Last cipher should have been {0} with account number: {1}. Calculated cipher is: {2}
da_dk: Sidst ciffer skal være {0} med kontonummer: {1}. Beregnet ciffer er: {2}
nb_no: Siste siffer skal være {0} med kontonummer: {1}. Beregnet siffer er: {2}

# Domain_Validation_PaymentMeans_NO_Bank_InvalidAccountNumber
source: A Norweigan bank accountnumber is 11 digits, first 4 are the bank's registration number, next 2 the type of account, next 4 the actual accountnumber and then last a Modulus 11 check cifer
da_dk: En norsk bankkonto har 11 cifre: de første 4 cifre til bankens registreringsnummer, de næste 2 cifre er kontoens type, herefter 4 som er kontoens reele nummer og sidst et modulus ciffer som nr 11.
fo_fo: En norsk bankkonto har 11 cifre: de første 4 cifre til bankens registreringsnummer, de næste 2 cifre er kontoens type, herefter 4 som er kontoens reele nummer og sidst et modulus ciffer som nr 11.
nb_no: En norsk bankkonto har 11 siffer: De første 4 sifrene er bankens id-nummer, de neste 2 sifrene er kontoens type, heretter følger 4 siffer som er kontoens reelle nummer og sist et modulus-siffer som nr. 11.

# Command_RecalculateFiscalPeriodStatistics_NoFiscalPeriod
source: FiscalPeriod for {0} not found
da_dk: Regnskabsår for {0} blev ikke fundet.
fo_fo: Roknskaparár fyri {0} varð ikki funnið.
nb_no: Regnskapsår for {0} ble ikke funnet.

# Xena_Domain_Validation_OrderLine_No_Article_Nor_ArticleGroup
source: Missing article or article group on line: {0} - {1}
da_dk: Manglende vare eller varegruppe på linje {0} - {1}
fo_fo: Vantandi vøra ella vørubólkur á linju {0} - {1}
nb_no: Manglende vare eller varegruppe på linje {0} - {1}

# Xena_Email_SendEmail_OnlyOneEmail
source: There must be only one email when inviting to Xena
da_dk: Der kan kun være 1 email når der inviteres til Xena
fo_fo: Bert ein teldupostur er lov, tá tú bjóðar til Xena
nb_no: Det kan kun være 1 e-post når noen inviteres til Xena

# Xena_Domain_FailedToInviteUser
source: Failed to invite user: {0} to this fiscalsetup
da_dk: Brugeren {0} kunne ikke inviteres til dette regnskab.
fo_fo: Brúkarin {0} kann ikki bjóðast til hetta roknskapið
nb_no: Brukeren {0} kunne ikke inviteres til dette regnskapet.

# Xena_GetPartnerFromPartnerPost_PartnerPostNotFound
source: Partner post not found
da_dk: Partnerposteringen blev ikke fundet
fo_fo: Vinnupartnarabókingin varð ikki funnin
nb_no: Partnerposteringen ble ikke funnet

# Xena_Payment_BookkeepingFailed
source: Bookkeeping failed for partner {0}
da_dk: Bogføring fejlede for partneren {0}
fo_fo: Bóking miseydnaðist fyri vinnupartnara
nb_no: Bokføring feilet for partneren {0}

# Xena_Payment_InvalidPaymentLedgerTag
source: Payment ledger tag for this fiscalsetup is either not set or deactivated
da_dk: Betalingskonto for det aktuelle regnskab er enten ikke valgt eller også er den valgte deaktiveret.
fo_fo: Gjaldskonto fyri núverandi roknskap er ikki ásett ella konto er óvirkt
nb_no: Betalingskonto for det aktuelle regnskapet er ikke valgt eller den er deaktivert.

# Xena_FiscalSetup_DeleteFiscalSetup_FiscalSetupNotFound
source: Fiscal setup not found - id: {0}
da_dk: Virksomheden blev ikke fundet - id: {0}
nb_no: Virksomheten ble ikke funnet - id: {0}

# Xena_FiscalSetup_DeleteFiscalSetup_MustBeAdmin
source: Must be an admin to delete fiscalsetup.
da_dk: For at slette en virksomhed kræves administratorrettigheder
fo_fo: Fyri at strika fyritøku krevst umsitararættindi
nb_no: For å slette en virksomhet kreves administratorrettigheter

# Xena_FiscalSetup_DeleteFiscalSetup_MustBeLoggedIn
source: Must be logged into a fiscalsetup to delete it.
da_dk: Du skal være logget ind i virksomheden for at kunne slette det.
fo_fo: Tú skalt vera innritað/ur í fyritøkuni fyri at strikað hetta.
nb_no: Du må være logget inn i virksomheten for å kunne slette det.

# Domain_Validation_XenaAppPlugin_Invalid_ExternalUri
source: Invalid Uri
da_dk: Ugyldig Uri
nb_no: Ugyldig Uri

# Domain_Validation_XenaAppPlugin_Invalid_PluginPlacement
source: Invalid plugin placement - available placements: {0}
da_dk: Ugyldig plugin placering - gyldige placeringer: {0}
nb_no: Ugyldig plugin-plassering. Gyldige plasseringer: {0}

# Domain_Validation_XenaAppPlugin_Invalid_PluginType
source: Invalid plugin type - available types: {0}
da_dk: Ugyldig plugin type - gyldige typer: {0}
nb_no: Ugyldig plugin-type. Gyldige typer: {0}

# Domain_Validation_XenaAppPlugin_Invalid_Uri
source: {0} is not a valid external uri (must be https and be wellformed)
da_dk: {0} er ikke en gyldig uri (skal være https og korrekt formateret)
fo_fo: {0} er ikki ein gildig url adressa (skal vera https og rætt sniðað)
nb_no: {0} er ikke en gyldig uri (skal være https og korrekt formatert)

# Domain_validation_XenaAppPlugin_Missing_Title
source: Missing title
da_dk: Mangler titel
fo_fo: Vantar heiti
nb_no: Mangler titel

# Domain_XenaApp_Invalid_Callback
source: Invalid callback URI
da_dk: Ugyldig callback URI
nb_no: Ugyldig callback URI

# Domain_XenaApp_Missing_ClientIdentitifier
source: Missing ClientIdentifier
da_dk: Mangler ClientIdentifier
fo_fo: Vantar ClientIdentifier
nb_no: Mangler ClientIdentifier

# Domain_XenaApp_Missing_ClientSecret
source: Missing ClientSecret
da_dk: Mangler ClientSecret
fo_fo: Vantar ClientSecret
nb_no: Mangler ClientSecret

# Domain_XenaApp_Missing_Name
source: Missing name
da_dk: Mangler navn
fo_fo: Vantar navn
nb_no: Mangler navn

# Command_BulkInsertArticle_ImportFailed
source: Import for {0} failed, as the article supposed to be updated was not found
da_dk: Importen fejlede for: {0}. Detaljer:
fo_fo: Innflutningur miseydnaðist fyri: {0}. Útgreining:
nb_no: Importen feilet for: {0}. Detaljer:

# Command_BulkInsertArticle_ImportFailed_DuplicateArticleNumbers
source: Following articlenumbers were duplicated:
da_dk: Følgende varenumre var duplikeret:
fo_fo: Fylgjandi vørunummur vóru avritað
nb_no: Følgende varenumre ble kopiert:

# Validation_ArticleImportData_Missing_ArticleNumber
source: Missing article number
da_dk: Mangler varenummer
fo_fo: Vantar vørunummar
nb_no: Mangler varenummer

# Validation_ArticleImportData_Missing_Description
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Validation_ArticleImportData_Missing_Group
source: Missing article group
da_dk: Mangler varegruppe
fo_fo: Vantar vørubólkur
nb_no: Mangler varegruppe

# Xena_ArticleDeleter_CannotDelete_CurrentlyStock
source: There is currently stock on this article - so you cannot delete it.
da_dk: Der er i øjeblikket et antal af varen på lager og den kan derfor ikke slettes.
fo_fo: Vøran er í løtuni á goymslu og kann tí ikki strikast.
nb_no: Denne varen finnes i øyeblikket på lager, og den kan derfor ikke slettes.

# Xena_ArticleDeleter_CannotDelete_OpeReservations
source: This article has open reservations - so you cannot delete it.
da_dk: Varen har åbne reservationer og kan derfor ikke slettes
nb_no: Varen har åpne reservasjoner og kan derfor ikke slettes

# Xena_ArticleDeleter_CannotDelete_UsedOnOpenPurchase
source: This article is used on open purchase orders - so you cannot delete it.
da_dk: Varen er i brug på åbne købsordre og kan derfor ikke slettes
nb_no: Varen er i bruk på åpne kjøpsordre og kan derfor ikke slettes

# Xena_ArticleDeleter_CannotDelete_UsedOnOpenSales
source: This article is used on open sales orders - so you cannot delete it.
da_dk: Varen er i brug på åbne salgsordre og kan derfor ikke slettes
nb_no: Varen er i bruk på åpne salgsordre og kan derfor ikke slettes

# Command_ImportFromBillysBilling_AlreadyHasArchive
source: Can only import once for each fiscal setup
da_dk: Kan kun importeres en gang per virksomhed
fo_fo: Kann bert innflytast eina ferð í hvørjari fyritøku
nb_no: Kan kun importeres en gang per virksomhet

# Command_ImportFromC5_AlreadyHasArchive
source: Can only import once for each fiscal setup
da_dk: Kan kun importeres en gang per virksomhed
fo_fo: Kann bert innflytast eina ferð í hvørjari fyritøku
nb_no: Kan kun importeres en gang per virksomhet

# Command_ImportFromEconomics_AlreadyHasArchive
source: Can only import once for each fiscal setup
da_dk: Kan kun importeres en gang per virksomhed
fo_fo: Kann bert innflytast eina ferð í hvørjari fyritøku
nb_no: Kan kun importeres en gang per virksomhet

# Command_PostPartnerFromClient_Already_Partner
source: Client is already a partner (id: {0})
da_dk: Klienten er allerede en partner (id: {0})
fo_fo: Klienturin er longu ein partnari (id: {0})
nb_no: Klienten er allerede en partner (id: {0})

# Command_RequestArchiveDeletion_FiscalSetupNotFound
source: Fiscalsetup not found
da_dk: Virksomhed ikke fundet
nb_no: Virksomhet ikke funnet

# Xena_CurrencyAmountToPay_InvalidCurrency
source: Invalid currency ({0})
da_dk: Ugyldig valuta ({0})
nb_no: Ugyldig valuta ({0})

# Xena_CurrencyAmountToPay_NoExchangeRateFound
source: No exchange rate found for {0}, date: {1}
da_dk: Ingen valutakurs fundet for {0}, dato: {1}
fo_fo: Eingin gjaldoyrukursur funnin fyri {0}, dato: {1}
nb_no: Ingen valutakurs funnet for {0}, dato: {1}

# Domain_Validation_ReportLayout_Invalid_XML
source: Invalid XML
da_dk: Ugyldig XML
nb_no: Ugyldig XML

# Domain_XenaApp_Missing_Description
source: Missing description
da_dk: Mangler beskrivelse
fo_fo: Vantandi lýsing
nb_no: Mangler beskrivelse

# Domain_Validation_ArticleMapping_PartnerArticleNumber
source: Missing partner's article number
da_dk: Mangler partnerens varenummer
fo_fo: Vantar vørunummar hjá partnaranum
nb_no: Mangler partnerens varenummer

# Domain_Validation_ArticleMapping_Quantity_NotPositive
source: Quantity must be positive
da_dk: Antal skal være positiv
fo_fo: Nøgd má vera positivt tal
nb_no: Antall må være positivt

# Xena_ArticleVariantDisabler_ArticleNotFound
source: Article not found - id: {0}
da_dk: Varen blev ikke fundet - id: {0}
nb_no: Varen ble ikke funnet - id: {0}

# Deleters_Ledger_In_Use
source: Cannot delete ledger - it is used by: {0}
da_dk: Kladden kan ikke slettes, den bruges af: {0}
fo_fo: Kladden kan ikki strikast, hon brúkast av: {0}
nb_no: Kladden kan ikke slettes, den brukes av: {0}

# Domain_FiscalPeriod_No_CurrentResource
source: User has no resource
da_dk: Brugeren har ingen ressource
fo_fo: Brúkari hevur onga ressursu
nb_no: Brukeren har ingen ressurs

# Domain_Ledger_Is_Out_Of_Numbers
source: Ledger is out of numbers.
da_dk: Kladden er løbet tør for bilagsnumre
fo_fo: Kladdan hevur einki fylgisskjalsnummar eftir
nb_no: Kladden er tom for bilagsnumre

# Domain_Ledger_Minimum_Must_Be_Lower_Than_Maximum
source: Maximum must be greater than minimum
da_dk: Maksimum skal være større end minimum
fo_fo: Hámark má vera størri enn lágmark
nb_no: Maksimum må være større enn minimum

# Domain_Ledger_Too_High_Maximum
source: Maximum cannot be greater than 49,999
da_dk: Maksimum kan ikke være større end 49.999
fo_fo: Hámarkið kann ikki vera størri enn 49.999
nb_no: Maksimum kan ikke være større enn 49.999

# Domain_LedgerNumberSeries_VoucherNumberHasBeenUsed
source: Vouchernumber {0} has already been used in this fiscalperiod.
da_dk: Bilagsnummer {0} har allerede været brugt i denne regnskabsperiode
fo_fo: Fylgiskjalsnummar {0} er longu brúkt hetta roknskaparárið
nb_no: Bilagsnummer {0} har allerede vært brukt i denne regnskapsperioden

# Domain_Validation_ArticleMapping_ArticleVariant_Missing
source: Article has variants - and variant must be set.
da_dk: Varen har varianter og varianten skal derfor sættes
nb_no: Varen har varianter og varianten skal derfor angis

# Domain_Validation_ArticleMapping_PartnerArticle_Missing
source: Must have either an article or a partner
da_dk: Skal have enten en vare eller en partner
nb_no: Må ha enten en vare eller en partner

# Updater_ArticleMapping_ArticleAlreadyMapped
source: Article or article variant har already been mapped on id: {0}
da_dk: Vare eller varevariant er allerede mappet på id: {0}
nb_no: Vare eller varevariant er allerede koblet på id: {0}

# Updater_ArticleMapping_Duplicates_Exists
source: Article mapping already exists on id: {0}
da_dk: Varemapping eksisterer allerede på id: {0}
nb_no: Varekoblingen eksisterer allerede på id: {0}

# Updater_Ledger_OverLapping_Ledgers
source: The following ledgers overlap: {0}
da_dk: Følgende kladder overlapper: {0}
fo_fo: Fylgjandi kladdur umskarast: {0}
nb_no: Følgende kladder overlapper: {0}

# Xena_ArticleGroup_DeleteArticles_Article
source: Article: {0} - {1}
da_dk: Vare: {0} - {1}
nb_no: Vare: {0} - {1}

# Xena_ArticleGroup_DeleteArticles_ArticleGroupNotFound
source: Article group not found: {0}
da_dk: Varegruppen blev ikke fundet: {0}
nb_no: Varegruppen ble ikke funnet: {0}

# Xena_ArticleGroup_DeleteArticles_TheFollowingArticlesCouldNotBeDeleted
source: The following articles could not be deleted, since they are used elsewhere:
da_dk: Følgende varer kunne ikke slettes da de er i brug:
fo_fo: Fylgjandi vørur kunnu ikki strikast tí tær eru í brúk:
nb_no: Følgende varer kunne ikke slettes da de er i bruk:

# Command_BulkInsertArticle_ImportFailed_ArticleNotFound
source: Import for {0} failed, as the article supposed to be updated was not found
da_dk: Importen for {0} fejlede fordi varen ikke kunne findes.
fo_fo: Innflutningur av {0} miseydnaðist tí vøran ikki finst
nb_no: Importen for {0} feilet fordi varen ikke ble funnet.

# Domain_OrderLine_ArticleMapping_Quantity_Modulus_Fail
source: {0} is only sold in quantities of {1}
da_dk: {0} kan kun handles i hele sæt af {1}
fo_fo: {0} seljast bert í nøgdini {1}
nb_no: {0} kan kun handles i enhet av {1}

# Command_RemovalFromSproom_DoesNotUseSproom
source: Your company is not registrered at Sproom.net
da_dk: Din virksomhed blev ikke fundet hos Sproom.net
fo_fo: Tín fyritøka er ikki stovnað hjá Sproom.net
nb_no: Firmaet ditt er ikke registrert hos Sproom.net

# Xena_ApiFiscalSetup_RequestSupport_SubscriptionMustBeActive
source: Your Xena subscription must be active in order to request support
da_dk: Dit Xena abonnement skal være aktivt for at du kan forespørge på support
fo_fo: Títt Xena hald má vera virkið fyri at fáa support
nb_no: Xena-abonnementet ditt må være aktivt for å få support

# Command_BookkeepStockCount_Negative_Stock
source: Article ({0}) would be in negative stock
da_dk: Varen {0} får negativt lager
nb_no: Varen {0} får negativt lager

# Command_BookkeepStockCount_Nothing_To_Bookkeep
source: Nothing to bookkeep
da_dk: Intet at bogføre
fo_fo: Einki at bóka
nb_no: Ingenting å bokføre

# Command_BookkeepStockCount_Quantities_Changed_Refresh_StockCount
source: Some quantities have changed since the stock count was generated - refresh the quantities
da_dk: Nogle antal har ændret sig optællingen er danne - opdater antallene
fo_fo: Nogle antal har ændret sig efter optællingen er danne - opdater antallene
nb_no: Noen antall er endret etter at lagertellingen ble generert - oppdater antallene

# Domain_validation_StockCount_MissingDescription
source: Missing description
da_dk: Manglende beskrivelse
fo_fo: Vantandi lýsing
nb_no: Manglende beskrivelse

# Domain_Validation_StockCountDraft_Negative
source: Quantity counted cannot be less than zero
da_dk: Antal optalt kan ikke være mindre end 0
fo_fo: Upptalt kann ikki vera minni enn 0
nb_no: Antall talt kan ikke være mindre enn 0

# Updater_StockCountDraft_Article_Not_Inventory_Management
source: Article does not have inventory management activated
da_dk: Varen har ikke lagerstyring aktiveret
nb_no: Varen har ikke lagerstyring aktivert

# Updater_StockCountDraft_ArticleVariant_Does_Not_Belong_On_Article
source: Article variant (id: {0}) does not belong on this article (id: {1})
da_dk: Varianten (id: {0}) tilhører ikke denne vare (id: {1})
nb_no: Varianten (id: {0}) tilhører ikke denne varen (id: {1})

# Xena_CanOrderBeSentElectronically_FiscalSetupNotSetup
source: Fiscal setup is not set up for Sproom
da_dk: Regnskabet er ikke opsat til at bruge Sproom
fo_fo: Regnskabet er ikke opsat til at bruge Sproom
nb_no: Regnskapet er ikke satt opp til å bruke Sproom

# Xena_FiscalPeriodDeleter_CannotDeleteAnActiveFiscalPeriod
source: Cannot delete an active fiscalperiod
da_dk: En aktiv finansperiode kan ikke slettes
fo_fo: Virkið fíggjartíðarskeið kann ikki strikast
nb_no: Kan ikke slette en aktiv finansperiode

# Command_ElectronicInvoice_OrderLine_Missing_Description
source: Orderline with article: {0} and price: {1} has no description
da_dk: Ordrelinjen med varen {0} og prisen {1} har ingen beskrivelse
fo_fo: Ordralinjan við vøruni {0} og prísinum {1} hevur onga lýsing
nb_no: Ordrelinjen med varen {0} og prisen {1} har ingen beskrivelse

# Command_ConfirmOrder_Nothing_To_Confirm
source: Nothing to confirm
da_dk: Intet at bekræfte
fo_fo: Einki at vátta
nb_no: Ingenting å bekrefte

# Command_CreateOffer_Nothing_To_Offer
source: Nothing to create an offer from
da_dk: Intet at oprette et tilbud udfra
fo_fo: Einki at stovna tilboð útfrá
nb_no: Ingenting å opprette et tilbud fra

# Command_DeleteOrderConfirmation_No_Confirmation
source: Ordertask id: {0} has not been confirmed. Nothing to delete.
da_dk: Ordreopgaven (id: {0}) er ikke blevet bekræftet. Intet at slette.
fo_fo: Ordrauppgávan (id: {0}) er ikki váttað. Einki at strika.
nb_no: Ordreoppgaven (id: {0}) er ikke blitt bekreftet. Ingenting å slette.

# Domain_Validation_OrderTask_IsAlreadyConfirmed
source: Order task is already confirmed
da_dk: Ordreopgaven er allerede bekræftet
fo_fo: Ordrauppgávan er longu váttað
nb_no: Ordreoppgaven er allerede bekreftet

# Updater_OrderLine_Order_Is_Deactivated
source: Order id: {0} is deactivated.
da_dk: Ordren (id: {0}) er deaktiveret
fo_fo: Ordri (id: {0}) er óvirktur
nb_no: Ordren (id: {0}) er deaktivert

# Updater_OrderLine_OrderTask_ReadOnly
source: Order task id: {0} is readonly.
da_dk: Ordreopgaven(id: {0}) er skrivebeskyttet
fo_fo: Ordrauppgávan (id: {0}) er læst
nb_no: Ordreoppgaven (id: {0}) er skrivebeskyttet

# Updater_OrderTask_ReadOnly
source: Order task id: {0} is read only
da_dk: Ordreopgaven(id: {0}) er skrivebeskyttet
fo_fo: Ordrauppgávan (id: {0}) er læst
nb_no: Ordreoppgaven (id: {0}) er skrivebeskyttet

# Command_AdjustAveragePrice_Cannot_Have_Negative_AverageCostPrice
source: Cannot have negative average cost price
da_dk: Negativ kostpris ikke tilladt
fo_fo: Negativur kostprísur ikki loyvd
nb_no: Negativ kostpris ikke tillatt
